{
  "comments": [
    "My plugin contains the following code:\n    // make clipboard empty\n    getClipboard().setContents(new Object[]{}, new Transfer[]{});\nwhich works fine in 3.0.\n\nIn 3.1.RC3 the following exception is thrown:\njava.lang.IllegalArgumentException: Argument not valid\n\tat org.eclipse.swt.SWT.error(SWT.java:2924)\n\tat org.eclipse.swt.SWT.error(SWT.java:2863)\n\tat org.eclipse.swt.SWT.error(SWT.java:2834)\n\tat org.eclipse.swt.dnd.DND.error(DND.java:262)\n\tat org.eclipse.swt.dnd.DND.error(DND.java:208)\n\tat org.eclipse.swt.dnd.Clipboard.setContents(Clipboard.java:455)\n\tat org.eclipse.swt.dnd.Clipboard.setContents(Clipboard.java:390)\n        ...\n\nI\u0027ve noticed that the Eclipse 3.1 Clipboard class has a new \nmethod \"clearContents()\", which we can\u0027t use because we build against the 3.0 \nAPI.\nI suspect that throwing this exception is an unintended API compatibility break.",
    "What is the desired effect of setting the transfer types and content to an empty\narray?  Are you trying to clear the data held by the Clipboard?",
    "Yes, the intent is to clear the contents of the clipboard.",
    "I have same problem, and to provide compatibility I try to use Java reflection. This works, but I have another problem with Clipboard.clearContents() function. It do not works because following condition always returns false in my case:\n\n...\nif (COM.OleIsCurrentClipboard(this.iDataObject.getAddress()) \u003d\u003d COM.S_OK) {\n...\n\nCould you please tell, what is it -- bug or feature ? And if this is the feature how is possible to clear clipbord without direct calls to COM.OleSetClipboard(0) because from documentation is unclean.",
    "You can not clear the clipboard if you do not own the contents.  Do you have an application running that assists you with clipboard management (e.g. shows you the last ten things that were on the clipboard)?  Applications like this tend to take over control of what was placed on the clipboard and stop you from being able to clear the clipboard.\n\nThe code fails in 3.1 because in 3.0 it was only succeeding on some platforms and was inconsistent.  It is not valid to set the contents of the clipboard to be empty.  You need to call clearContents().",
    "Thank you for your information.\n\n\u003eDo you have an application running that assists you with clipboard management \n\u003e(e.g. shows you the last ten things that were on the clipboard)?  \nYes, this behaviour looks like a Microsoft Office 2003 behaviour.\n\nIn my case I need to clean clipboard because I have Copy/Cut+Paste management of the resources in the Repository View of Team Provider, which is developed by myself. In situation when clipboard content is locked and not cleaned after Cut+Paste I can use Paste operation second time on already moved resource. This is the fastest way to get an exception and unpredictable behaviour.\n\nMay be Eclipse platform has an ability to disable interception of clipboard content by external tools or to take ownership on this content ?\n\nP.S.\nAt this time I solve this problem for me by placing fake content (that disallows \"Paste\" menu item) into clipboard.\n\nAlso may be is a good idea to place information, that you wrote to me into the JavaDOC comments of Clipboard.clearContents() method ? I think this will reduce misunderstanding of the problem.",
    "We WONTFIX this.  It seems that Veronika changed the behavior for 3.1 and won\u0027t change it back now."
  ],
  "commentCreationDates": [
    "2005-06-28T15:29:46+02:00",
    "2005-06-30T05:37:57+02:00",
    "2005-06-30T09:13:38+02:00",
    "2005-11-25T14:01:43+01:00",
    "2005-11-25T16:30:11+01:00",
    "2005-11-25T17:24:47+01:00",
    "2007-06-18T16:58:01+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.IllegalArgumentException",
      "message": "Argument not valid",
      "elements": [
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2924"
        },
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2863"
        },
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2834"
        },
        {
          "method": "org.eclipse.swt.dnd.DND.error",
          "source": "DND.java:262"
        },
        {
          "method": "org.eclipse.swt.dnd.DND.error",
          "source": "DND.java:208"
        },
        {
          "method": "org.eclipse.swt.dnd.Clipboard.setContents",
          "source": "Clipboard.java:455"
        },
        {
          "method": "org.eclipse.swt.dnd.Clipboard.setContents",
          "source": "Clipboard.java:390"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "102010",
      "date": "2005-06-28T15:29:46+02:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "normal"
    }
  ],
  "groupId": "102010",
  "bugId": "102010",
  "date": "2005-06-28T15:29:46+02:00",
  "product": "Platform",
  "component": "SWT",
  "severity": "normal"
}