{
  "comments": [
    "Create a dynamic web project\nCreate a class with one public method (getTheMessage())\nRight click on the class, select Web Service-\u003eCreate Web Service\nAccept the defaults\nPick getMessage() as the method to expose\nClick next\n\nThe following exception gets thrown:\nIWAB0398E Error in generating WSDL from Java java.lang.ClassNotFoundException:\norg.transalta.notifications.NotificationFactory",
    "Kathy,\nwould you please try reproducing this?\n\nJamie,\nI\u0027ve never seen org.transalta.notifications.NotificationFactory in a Web \nservices tools stack trace before. It\u0027s neither an Eclipse nor Axis class as \nfar as I know. Is there a more complete stack trace you can provide for this \nproblem?",
    "The bug occurs when I try to run this tutorial: \n\nhttp://www.eclipse.org/webtools/jst/components/ws/0.7/tutorials/BottomUpWebServ\nice.html\n\nI think that \"org.transalta.notifications.NotificationFactory\" is the java \nbean selected to generate WSDL.",
    "(In reply to comment #2)\n\u003e The bug occurs when I try to run this tutorial: \n\u003e \n\u003e http://www.eclipse.org/webtools/jst/components/ws/0.7/tutorials/BottomUpWebServ\n\u003e ice.html\n\u003e \n\u003e I think that \"org.transalta.notifications.NotificationFactory\" is the java \n\u003e bean selected to generate WSDL.\n\n(In reply to comment #2)\n\u003e The bug occurs when I try to run this tutorial: \n\u003e \n\u003e http://www.eclipse.org/webtools/jst/components/ws/0.7/tutorials/BottomUpWebServ\n\u003e ice.html\n\u003e \n\u003e I think that \"org.transalta.notifications.NotificationFactory\" is the java \n\u003e bean selected to generate WSDL.\n\nThe bug also occurs when you create a simple Java project and run the web\nservices tool, at the step where generating WSDL file, I get the following message: \n\nIWAB0398E Error in generating WSDL from Java java.lang.ClassNotFoundException:\ndemo.Echo\n\nwhere demo.Echo is the Java class that I created and want to enhance as a Web\nService.",
    "I can confirm seeing the \"Class Not Found\" behaviour.  My first attempt at\nbuilding the \u0027bottom-up\u0027 web-service resulted in this behaviour.  I was able to\nget around the problem by Project-\u003eBuild.\n\nI have \u0027automatic\u0027 builds turned on.  I am using Eclipse 3.1.1,\nWTP-WST-SDK-1.0M8 and required dependencies found for WTP-WST-SDK-1.0M8",
    "(In reply to comment #4)\n\u003e I can confirm seeing the \"Class Not Found\" behaviour.  My first attempt at\n\u003e building the \u0027bottom-up\u0027 web-service resulted in this behaviour.  I was able \nto\n\u003e get around the problem by Project-\u003eBuild.\n\u003e I have \u0027automatic\u0027 builds turned on.  I am using Eclipse 3.1.1,\n\u003e WTP-WST-SDK-1.0M8 and required dependencies found for WTP-WST-SDK-1.0M8\n\nI\u0027m running the same environment, but I am not able to work around the problem \nby rebuilding my project.   ",
    "The way I worked around this problem is:\n1. reinstalling eclipse from scratch (version 3.1.1)\n2. menu [help --\u003esoftware updates --\u003efind and install] to install WTP 0.7 *and*\nall its dependancies\n\nProbably installing WTP from zip file had previously left my system missing some\nrequired dependancies...\nGreg",
    "I also can reproduce this behavior with a simple test case.  Using WTP 0.7.1, \nEclipse 3.1.1, all correct dependencies installed (checked via the Find and \nInstall Updates menu).\n\nStart with a brand new workspace.  Setup the Tomcat 5.5 runtime under Window-\n\u003ePreferences to start with.  Create a new Java project.  Create a simple class \ncalled test.Hello, with a single method \"public String sayHello(String msg)\", \nimplement the method as \"return \"Hello\" + msg;\" and then try to create a web \nservice from it.  Click \"Generate Proxy\" and \"Test Web Service\" during \ndeployment.  Use all default options otherwise.  Same failure.  I have Build \nAutomatically set, so the class IS there under my output directory.  ",
    "I have not, BTW, had any success with the reported \"workarounds\" above \n(rebuilding, recreating the workspace, etc).  All attempts with my current \nbuild, new workspaces, or other classes yield the same result I just mentioned.",
    "(In reply to comment #8)\n\u003e I have not, BTW, had any success with the reported \"workarounds\" above \n\u003e (rebuilding, recreating the workspace, etc).  All attempts with my current \n\u003e build, new workspaces, or other classes yield the same result I just \nmentioned.\n\nsame to me! can\u0027t create web service\nplease help!",
    "Kathy, I\u0027m targetting this to M9 though we haven\u0027t had debugged the problem \nyet. The scenario is very golden path, and should be working cleanly in our \nnext milestone.\n\nNote to all: Dave Rodenbaugh\u0027s comment makes mention of creating a Java \nproject, and Java / Web project combos on the Tomcat (non J2EE) server won\u0027t \nwork without explicitly adding the Java project\u0027s jar to the Tomcat server\u0027s \nclasspath... Are others encountering this problem under that condition (ie. \nclass in a Java project vs. in the Web project)?",
    "I tested with the latest integration build candidate I200511091028 available at:\n\nhttp://download.eclipse.org/webtools/committers/drops/I-I200511091028-\n200511091028/\n\nI can get through creating a bottom-up Web service with a bean in a dynamic Web \nproject using Tomcat 5.5.9 and JDK 1.5_04.  I\u0027ve also tested with Tomcat 5.0.28 \nand JDK 1.4.2_09.\n\nI had run through similar testing with WTP 0.7.1 and had no problem with the \nbottom-up Web service scenario with Tomcat 5.5 or Tomcat 5.0.\n\nI suspect the root of the problem is the bean that the wizard is not able to \nfind is in a Java project depended by the Web project when the wizard is run. \nThis problem was in WTP 0.7.1.  I fixed that problem in defect 107808 \n(https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d107808) in early October.  It \nwould be available in recent drivers.\n\nPlease remember though even with the fix, you would have to add the JAR to the \nWeb project\u0027s WebContent/WEB-INF/lib directory in order for the server to pick \nit up at runtime.\n\nPlease reopen the defect if you still encounter this problem with the latest \ndriver and include detail steps to reproduce the problem.\n\n*** This bug has been marked as a duplicate of 107808 ***",
    "As we are trying to close down WTP 1.5, please get the latest WTP 1.5 driver to verify the bug and reopen if the problem had not been fixed.  If this defect is not verified/reopened by end of day 06/16, I\u0027ll attempt to verify the defect by reproducing the problem as described in the defect.  However, since you know your scenario best, it would be more appropriate if you verify the fix.",
    "The problem is occurs with WTP 1.5.\nI use Eclipse 3.2 with WTP 1.5.0-200606281455, Java 1.4.2_05 and Tomcat 5.0.28.\n\nI get the same ClassNotFoundException when I refer to a class in an external project. I have to package the classes into a jar-File and integrate this in the WebService project.  \n\n",
    "Please note that if you\u0027re trying to create a Web service on bean in a Web project (WebProj) that depends on a Java project (JavaProj), you would have to either:\n\n1. Bring up project properties on WebProj and specify JavaProj as it\u0027s J2EE module dependency.\n\n2. Bring up project properties on WebProj, add JavaProj as a dependent project under Java Build Path.  Then, JAR up the classes in the JavaProj and copy it into the WebContent/WEB-INF/lib directory of the WebProj.  Without doing this last step would result in error in deploying Web service to Axis.\n\nI\u0027ve just retried the scenario with WTP 1.5.1 09220504 driver and I could create a Web service no problem with dependent project using either one of the approaches above.\n\nClosing the defect.  Please re-open this defect or open another one if this is still a problem",
    "I have been experiencing this problem with the most recent Eclispe 3.2.2 baseline and WTP 1.5. I found a strange workaround - if I try to create a Web Service only, I get the ClassNotFoundException; if I try to create a Web Service *and* a Web Service Client in the same dialog, it goes through just fine and creates both.",
    "I get the same error. When I use the wizard to create a web Service. Is the bug closed!\n\nIWAB0398E Error in generating WSDL from Java:  java.lang.ClassNotFoundException: MyService\n    java.lang.ClassNotFoundException: MyService\n    at org.eclipse.osgi.framework.internal.core.BundleLoader.findClass(Unknown Source)\n    at org.eclipse.osgi.framework.internal.core.BundleLoader.findClass(Unknown Source)\n    at org.eclipse.osgi.internal.baseadaptor.DefaultClassLoader.loadClass(Unknown Source)\n    at java.lang.ClassLoader.loadClass(Unknown Source)"
  ],
  "commentCreationDates": [
    "2005-07-26T20:51:46+02:00",
    "2005-07-28T20:41:47+02:00",
    "2005-09-01T21:35:39+02:00",
    "2005-09-22T05:09:47+02:00",
    "2005-10-17T21:04:33+02:00",
    "2005-10-19T16:04:22+02:00",
    "2005-10-26T09:15:09+02:00",
    "2005-11-03T19:26:30+01:00",
    "2005-11-03T19:28:49+01:00",
    "2005-11-07T10:45:03+01:00",
    "2005-11-07T15:44:15+01:00",
    "2005-11-09T20:30:12+01:00",
    "2006-06-15T17:08:48+02:00",
    "2006-08-31T14:52:23+02:00",
    "2006-09-25T15:57:29+02:00",
    "2007-05-11T22:50:48+02:00",
    "2007-12-14T08:49:21+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "MyService",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.osgi.internal.baseadaptor.DefaultClassLoader.loadClass",
          "source": "Unknown Source"
        },
        {
          "method": "java.lang.ClassLoader.loadClass",
          "source": "Unknown Source"
        }
      ],
      "number": 0,
      "commentIndex": 16,
      "bugId": "105207",
      "duplicateId": "107808",
      "date": "2007-12-14T08:49:21+01:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "critical"
    }
  ],
  "groupId": "107808",
  "bugId": "105207",
  "duplicateId": "107808",
  "date": "2005-07-26T20:51:46+02:00",
  "product": "Web Tools",
  "component": "jst.ws",
  "severity": "critical"
}