{
  "comments": [
    "I accidentally destroyed one of my projects (and spent a good deal of\ntime understanding what had happened) by using \"new source folder\".  I\nnaively believed that this was the way to add a new subtree of sources\nto the project.  In fact, I know now, \"new folder\" is the way.\n\nI\u0027m not sure under what scenario the \"new source folder\" option is intended\nto be useful, but it is clear that the way I was allowed to use it is\ncompletely inappropriate.   Either the option should not have been available,\nor trying to use it should have evoked dire warnings of the consequences.\nIe: \"Warning, this will make 236 current source files NO LONGER BE CONSISIDERED\n TO BE SOURCE FILES\" for this project.\"\n\nWhat \"new source folder\" did was to throw away my existing source folder,\nwhich effectively made all of my EXISTING sources no longer part of the\nproject.  Not realizing what had actually happened, I continued trying\nto edit and debug the project, greatly mystified because none of the\nclass files were found when I tried to debug.\n\n   load: class online.Root.class not found.\n   java.lang.ClassNotFoundException: online.Root.class\n\tat sun.applet.AppletClassLoader.findClass(Unknown Source)\n\n\nWhereas previously the project had been running fine.\n\nBEFORE the change, my .classpath looked like this:\n\n\u003c?xml version\u003d\"1.0\" encoding\u003d\"UTF-8\"?\u003e\n\u003cclasspath\u003e\n\t\u003cclasspathentry kind\u003d\"src\" path\u003d\"\"/\u003e\n\t\u003cclasspathentry kind\u003d\"con\" path\u003d\"org.eclipse.jdt.launching.JRE_CONTAINER\"/\u003e\n\t\u003cclasspathentry kind\u003d\"output\" path\u003d\"bin\"/\u003e\n\u003c/classpath\u003e\n\nAFTER using \"new source folder\" my .classpath looked like this:\n\n\u003c?xml version\u003d\"1.0\" encoding\u003d\"UTF-8\"?\u003e\n\u003cclasspath\u003e\n\t\u003cclasspathentry kind\u003d\"src\" path\u003d\"test\"/\u003e\n\t\u003cclasspathentry kind\u003d\"con\" path\u003d\"org.eclipse.jdt.launching.JRE_CONTAINER\"/\u003e\n\t\u003cclasspathentry kind\u003d\"output\" path\u003d\"bin\"/\u003e\n\u003c/classpath\u003e",
    "Instead of showing a message dialog we could automatically move the packages\nfrom the implicit source folder of the project to the newly created source\nfolder or exclude the new source folder from the default source folder.",
    "if that were the behavior, the name of the menu item should\nbe changed to \"move sources to new folder\".  Presumably\nyou would have to refactor all the existing sources too.\n\nThe worst aspect of the current behavior is that it turns\na working project into a nonworking one.  Anything that made\nthat less likely would be an improvement, but what is the\nanswer to the implied question \"what is new source folder\"\ninteded to be used for?   In its present form, I can\u0027t\nthink of any legitimate use in a working project.\n\nThere is lots of opportunity for confusion about packages and\nclasspaths while initially constructing a project.  I think\noperations in support of resolving that confusion deserve\na separate wizard, not items in the general menu of choices.",
    "This should be more clean in 3.2: The radio buttons on the dialog lets you choose to either replace the cufrrent project as source folder or keep it and add exclusion rules.\n\nReopen if you still find this unclear."
  ],
  "commentCreationDates": [
    "2005-09-01T01:06:02+02:00",
    "2005-09-01T16:14:04+02:00",
    "2005-09-01T18:17:21+02:00",
    "2006-06-16T21:54:04+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "online.Root.class",
      "elements": [
        {
          "method": "sun.applet.AppletClassLoader.findClass",
          "source": "Unknown Source"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "108542",
      "date": "2005-09-01T01:06:02+02:00",
      "product": "JDT",
      "component": "UI",
      "severity": "major"
    }
  ],
  "groupId": "108542",
  "bugId": "108542",
  "date": "2005-09-01T01:06:02+02:00",
  "product": "JDT",
  "component": "UI",
  "severity": "major"
}