{
  "comments": [
    "I have imported VectorTest.java from the JUnit samples that come with Eclipse, by following the TPTP Tester Guide in Help, and it works fine the first time I run it. But the second time it is run, the \u0027Launching\u0027 gets to 58% and stays there. If I exit the workbench and restart Eclipse, I can run the test once but not a second time. (The RAC is running as a Windows service)\n\nI have also got the Perl UI example working (from EclipseCon2005_Building_a_Custom_Test_Execution_Environment), after some porting to 4.0, and this does the same thing.\n\nThis is using Windows XP Home, Eclipse 3.1.1 and TPTP 4.0.1. I upgraded to TPTP 4.1 but the same happens.\n\nOn the second test run, when I terminate the launch, get:\nAn internal error occurred during: \"Vector Test\"\nwith the exception stack trace:\njava.lang.NullPointerException\nat org.eclipse.hyades.execution.harness.TestExecutionHarness$2.run(TestExecutionHarness.java:750)\nat org.eclipse.core.internal.jobs.Worker.run(Worker.java:76)\n\nLooking in the Agent Controller log (servicelog.log) the second test appears to have run, but the first test starts with a sequence:\n\"Incoming connection request on socket 204 ...\n\"Notify the client that we are ready now ...\n\"Connection accepted on socket 204\"\n\"Attempting to launch process ...\n\"Process launched: PID\u003d2364\"\n\nWhereas the second test misses out the connection request stuff and goes straight to:\n\"Attempting to launch process ...\n\"Process launched: PID\u003d2772\" \n\nThere is also a thread in the TPTP newsgroup with the title \"Cannot run TPTP tests more than once\"",
    "Initially assigned this to the wrong component (Test Execution).\n",
    "\nI just wanted to verify, the product version you find these issues with is TPTP 4.0.1?",
    "Yes Scott, the problem as reported is with TPTP 4.0.1.\nI have recently tried TPTP-4.1.0-200511230100B and with that build, all tests (JUnit, Manual, HTTP) do not work at all. Sometimes the \u0027launching\u0027 briefly says 54% then vanishes, but often nothing appears, and no results or errors appear. The agent controller is not contacted. I\u0027m running XP Home with an admin account. If you would like me to do some specific test, please let me know.\n",
    "\nI cannot reproduce this in TPTP 4.2 (200602081238) from 2-8-2006 and perhaps earlier TPTP 4.2 builds.  Could you please re-test the example you give below and also try an even simpler JUnit test to see if there is a difference.  A simple JUnit test would be create a Java project, create a JUnit TPTP test, add one test method, then run test.",
    "Since installing the 4.1 Release and changing eclipse.ini to:\n-vmargs\n-Xms256m\n-Xmx512m\n\nI have had no more problems, but because I had lost so much time re-installing different combinations of Eclipse and TPTP, I didn\u0027t dare break it again by trying the default settings. My apologies for not posting this before now.",
    "\nOkay, glad to hear you gots things working in TPTP 4.1 -- sorry to hear about all the wasted time re-installing different combinations, thanks for continuing to support TPTP.",
    "ACTION: Please verify/close this defect.",
    "Closing by default since not closed by the originator in the 7+ months since being resolved.  \n\nPlease reopen if the issue is still present in the latest TPTP release or the resolution is not correct."
  ],
  "commentCreationDates": [
    "2005-11-29T20:16:13+01:00",
    "2005-11-29T20:22:38+01:00",
    "2005-11-30T04:21:50+01:00",
    "2005-11-30T19:42:31+01:00",
    "2006-02-08T22:39:11+01:00",
    "2006-02-09T00:07:53+01:00",
    "2006-02-09T01:02:44+01:00",
    "2006-11-16T14:02:56+01:00",
    "2007-02-12T17:57:53+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.hyades.execution.harness.TestExecutionHarness$2.run",
          "source": "TestExecutionHarness.java:750"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:76"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "118501",
      "date": "2005-11-29T20:16:13+01:00",
      "product": "TPTP Testing",
      "component": "Test.UI.ConfigEditors",
      "severity": "critical"
    }
  ],
  "groupId": "118501",
  "bugId": "118501",
  "date": "2005-11-29T20:16:13+01:00",
  "product": "TPTP Testing",
  "component": "Test.UI.ConfigEditors",
  "severity": "critical"
}