{
  "comments": [
    "First, let me note I am aware of bugs 92276, 100625 and the likes, but the problem is marked as being solved, while I could not discover a solution or workaround in the comments. \n\nOn my Debian testing system, with a functioning Apache 2.0, Tomcat 5.0 and Axis 1.2.1 install, using the wtp-all-in-one-0.7.1 Eclipse install, I get error \"IWAB0514E Unable to get URL for project {0}\" when using the Web service wizard, as per the \"Bottom Up Web service tutorial\". The error occurs when attempting step 13. I have tried Sun JDK 1.4 and 1.5, as well as Axis 1.2.1 and 1.3. The results are reproducible on two different machines (I did not attempt a third).\n\nThe only difference I noted when following the tutorial is that in the screenshots after step 11, the Web service runtime is indicated as Apache Axis without a version number.",
    "Moving to wst.ws.",
    "I just tried again with a fresh install of Eclipse 3.1.1 with wtp-sdk-1.0RC4, using Sun sdk1.4 and the error persists.",
    "I just found that this problem is related to bugs 117611, 119151, 107386 and the likes.\n\nWhen using the Webservice wizard, I created a new Target Server (Tomcat 5.0 - localhost) without any problem. However, I just found that when I try to create a New Server using File -\u003e New -\u003e Other -\u003e Servers -\u003e Server, upon clicking \u0027finish\u0027 (without adding any projects to the server) I get:\n\nPublishing failed\n  Could not load the Tomcat server configuration at /Servers/Tomcat v5.0 Server @ localhost-config. The configuration may be corrupt or incomplete.\n(repeated 3 more times)\n\nI have not reached a definite conclusion yet (and am leaving for the weekend), but my current hunch is that the Eclipse user needs rw access to /var/lib/tomcat5/conf (which has standard permissions 750 tomcat5:root)",
    "Hi Tim, could you comment on the Tomcat server access issue?\n\n",
    "The Tomcat error message could not have been the original problem that caused this bug to be opened against 0.7 (code was different), but given the error message that could be the problem now. If you can reproduce a case to confirm that we\u0027re trying to write to the Tomcat directory when creating a server, please open a separate bug and route to jst.server. We can then make this bug dependant on the new one and retest this scenario once the Tomcat issue has been resolved.\n\nFWIW, the \u0027IWAB0514E Unable to get URL for project {0}\u0027 error with the missing parameter still exists. I still saw it on RC4 as well, not sure if I opened a bug.",
    "Just finished testing. I was wrong about needing w rights for the /var/lib/tomcat5/conf, but rx rights for \u0027all\u0027 are required to allow every Eclipse user to get the Webtools to create all the necessary files.\n\nStarting from a fresh Eclipse with no servers or (web)projects:\n\nWith \u0027chmod 750 /var/lib/tomcat5/conf\u0027 or \u0027chmod 754 /var/lib/tomcat5/conf\u0027:\n- New -\u003e Other -\u003e Server, Server gives an error: \"Publishing failed: Could not load the Tomcat server configuration at /Servers/Tomcat v5.0 Server @ localhost-config.\" (last message repeated 3 times). That makes sense, because the directory \u0027Servers/Tomcat v5.0 Server @ localhost-config\u0027 was created, but is empty.\n\n- When subsequently following the Bottom-up webservice tutorial, error IWAB0514E Unable to get URL for project {0} is shown as previously mentioned.\n\n\nWith \u0027chmod 755 /var/lib/tomcat5/conf\u0027:\n- New -\u003e Other -\u003e Server, Server succeeds and the configuration directory is filled with the required policy and xml files.\n\n- When following the webservice tutorial, error IWAB0514E does *not* occur and\nall the necessary files webservice files (wsdd, wsdl, etc.) are created. \n\n- Possibly unrelated: finishing the \u0027New Webservice\u0027 step is still not possible. There is a Server Startup Page with a button \u0027Start Server\u0027, which results in\n\"WAB0213E Error in starting server.\n    org.eclipse.core.runtime.CoreException: Server Tomcat v5.0 Server @ localhost failed to start\nat org.eclipse.wst.server.core.internal.Server.synchronousStart(Server.java:1506) [..]\" This is not because there is already a server running.",
    "Forgot to summarize: there seem to be three bugs.\n\n1) Creating a new server in the \u0027New Dynamic web project\u0027 wizard (as mentioned in step 5 of the \u0027Bottom-up webservice tutorial\u0027) does not give an error message, when creating a server using \u0027New Server\u0027 does (for a valid reason).\n\n2) When /var/lib/tomcat5/conf lacks rx rights for all, the \u0027New Server\u0027 wizard give an error stating that the server configuration could not be loaded. It would be clearer if the wizard signalled that it was unable to read the \u0027master\u0027 Tomcat config files and did not even that server configuration. This may be Debian specific, but if making the conf directory 750 is a valid security concern, than perhaps the wizard should try to retrieve the required information from the /etc/tomcat5 directory?\n\n3) When there is no server, the error the \u0027New Webservice\u0027 wizard throws (unable to get URL) is unclear.\n\n",
    "Please open a separate defect for problem 1 and 2 in comment #7.  Those are problems with server tooling or J2EE tooling.\n\nAs for problem #3, we had been able to create bottom-up Web service in a new workspace with no server and with just Tomcat 5.0 server runtime installed.   That is, we have not been able to reproduce the problem with:\n\nUnable to get URL for project {0}\n\nWe had seen this problem with other servers provided by extenders.\n\nCould you please give the exact steps starting with a new workspace?  Did you follow the tutorial steps to:\n\n1. Install Tomcat 5.0 server runtime.\n2. Create Web project.\n3. Create bottom-up Web service on a Java file in the Web project.\n\nThere\u0027s a more recent tutorial based on M9 (which is basically the same as for WTP 1.0 RC5).  Here\u0027s the URL:\n\nhttp://www.eclipse.org/webtools/jst/components/ws/1.0M9/tutorials/BottomUpWebService.html\n\n",
    "The condition triggering the error:\n\n\"IWAB0514E Unable to get URL for project {0}\"\n\nwill be removed in bug 124667 as we would no longer rely on getting a URL for project that early in the extension.\n\n*** This bug has been marked as a duplicate of 124667 ***",
    "As we are trying to close down WTP 1.5, please get the latest WTP 1.5 driver to verify the bug and reopen if the problem had not been fixed.  If this defect is not verified/reopened by end of day 06/16, I\u0027ll attempt to verify the defect by reproducing the problem as described in the defect.  However, since you know your scenario best, it would be more appropriate if you verify the fix.",
    "Closing since there\u0027s no response from the originator for close to 9 months.  Please re-open or open another bug if the problem is still there."
  ],
  "commentCreationDates": [
    "2005-12-14T11:28:30+01:00",
    "2005-12-14T21:32:15+01:00",
    "2005-12-16T14:04:02+01:00",
    "2005-12-16T15:43:37+01:00",
    "2005-12-16T15:48:56+01:00",
    "2005-12-19T04:44:57+01:00",
    "2005-12-19T09:03:40+01:00",
    "2005-12-19T10:03:10+01:00",
    "2005-12-21T19:15:06+01:00",
    "2006-02-13T21:31:12+01:00",
    "2006-06-15T17:08:50+02:00",
    "2006-09-25T17:03:14+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.core.runtime.CoreException",
      "message": "Server Tomcat v5.0 Server @ localhost failed to start",
      "elements": [
        {
          "method": "org.eclipse.wst.server.core.internal.Server.synchronousStart",
          "source": "Server.java:1506"
        }
      ],
      "number": 0,
      "commentIndex": 6,
      "bugId": "120844",
      "duplicateId": "124667",
      "date": "2005-12-19T09:03:40+01:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "major"
    }
  ],
  "groupId": "124667",
  "bugId": "120844",
  "duplicateId": "124667",
  "date": "2005-12-14T11:28:30+01:00",
  "product": "Web Tools",
  "component": "jst.ws",
  "severity": "major"
}