{
  "comments": [
    "I\u0027m noticing a VerifyError when building with AJDT but not on the command-line using the same version of AspectJ (current head).  \n\n1) testToString(bugs.TimedCachedItemTest)java.lang.VerifyError: (class: bugs/Tim\nedCachedItemTest$RandomToString, method: toString signature: ()Ljava/lang/String\n;) Wrong return type in function\n        at bugs.TimedCachedItemTest.testToString(TimedCachedItemTest.aj)\n\nI mash the aspectj classes into the AJDT jars, so it\u0027s not unlikely that I caused this.  The code uses around advice and I seem to remember something with this - e.g., that if I specify some continue-after-error flag it will all work out, but I\u0027m not remembering or seeing the flag at present.\n\nI will attach the source along with classes built with the command-line compiler (in aspectj-src) and with AJDT (in bin).  Normally I\u0027d isolate this a bit more, but don\u0027t have time and thought you might figure it out from the .class files.  My AJDT preferences (in the advanced and other tabs) are all deselected, except for (redundant?) no-line, so I\u0027m doing full builds.",
    "Created an attachment (id\u003d31747)\nzip with source file and two sets of class files\n\n",
    "how \"current\" is your \"current head\"? There have been quite a few changes going in over the last 24 hours to try and close things out for RC1 - so AJDT and HEAD are almost certainly different. The magic flag is -proceedOnError, but I don\u0027t think it will help in this case...",
    "I updated just before writing the bug, but I\u0027ve been seeing the VerifyError for at least a few days.",
    "Wes,\nI can\u0027t reproduce this with AJDT 1.3 RC1. Are you able to try in that environment?",
    "Seems to be working ok for me. Reopen if you see the problem with a recent AJDT."
  ],
  "commentCreationDates": [
    "2005-12-14T16:49:02+01:00",
    "2005-12-14T16:50:16+01:00",
    "2005-12-14T17:11:23+01:00",
    "2005-12-14T20:26:07+01:00",
    "2005-12-16T11:50:15+01:00",
    "2006-04-13T14:55:43+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.VerifyError",
      "message": "(class: bugs/Tim edCachedItemTest$RandomToString, method: toString signature: ()Ljava/lang/String ;) Wrong return type in function",
      "elements": [
        {
          "method": "bugs.TimedCachedItemTest.testToString",
          "source": "TimedCachedItemTest.aj"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "120903",
      "date": "2005-12-14T16:49:02+01:00",
      "product": "AJDT",
      "component": "Core",
      "severity": "normal"
    }
  ],
  "groupId": "120903",
  "bugId": "120903",
  "date": "2005-12-14T16:49:02+01:00",
  "product": "AJDT",
  "component": "Core",
  "severity": "normal"
}