{
  "comments": [
    "I guessed at the component to assign this to.\n\nI installed this weeks maintenance build and WTP no longer publishes our web project corrrectly. Our web.xml and faces.config.xml files are not published which renders the application inoperable. I tried this many times with Tomcat 5.0 and 5.5. I also noticed that the Export... War file also omits these files.\n\nTomcat startup reports that the web.xml file is missing and substitues some default descriptor.\n\nI had to back off this build and return to last week\u0027s build and that part of the publishing returned to normal.\n\nI created some trivial web apps and the web.xml file was published.",
    "This sounds like a stop-ship problem for 1.0.1. I would support a delay in the release of 1.0.1 to fix this.",
    "Jim,\n\nIf trivial web apps deploy properly, there must be something specific about your project.  Can you attach a testcase we can use to reproduce the issue?\n\nThanks,",
    "Thanks to assistance from John Lanuti, we were able to work around this problem by removing redundant information in the .compoment. I have lowered the severity to normal and will formally request that this bug be removed from the hot list.\n\nThe work around was to remove these kind of entries:\n\u003cwb-resource deploy-path\u003d  .... /\u003e\n\nthat are now handled by:\n\n\u003cdependent-module deploy-path\u003d .... /\u003e",
    "Yeah, we still do have a valid defect here, in that we used to always add these redudant maps until recently.  For example, if you map web content, there is no need to have a map for webContent/webInf because it is assumed included by the webContent map.  So, there is a workaround of cleaning up the .component so I don\u0027t think its a stop ship for 1.0.1.  But we definitely need to investigate why the code is getting confused when the redundant maps are there.",
    "We can add a cleanup function on load of .component to remove any resource mapping which is relatively equal to an existing map if the source root is also mapped.  This will simplify the .component file and keep everyone on same page.  It is too late in 1.0.1 for a risky change like this though, so we will push to 1.5.",
    "Adding this bug to the 1.0.1 hot list per Jim\u0027s request. Setting priority to P2 and setting target milestone to 1.0.1 M101.",
    "Sorry, I missed the other email from Jim about removing this bug from the hot list. I\u0027m setting the priority back to P3 and the target milestone back to 1.5 M5.",
    "*** Bug 126452 has been marked as a duplicate of this bug. ***",
    "Installed maintenance build: wtp-M200602071839.zip and performed a new migration of our large web project. It was still necessary to delete the superflous \n\u003cwb-resource deploy-path\u003d .... /\u003e entries to avoid an NPE during publishing. The NPE is a different response than when I orginally opened this bug.\n\nI was under the impression that the bogus content in the .component file that I remvoed to avoid the problem would not be present if I re-migrated the web project. That wasn\u0027t the case. The new .component file had to be manually updated as well. It\u0027s a one time activity but you might want to reconsider this for 1.0.1 so others don\u0027t experiences this.\n\nPublish error:\njava.lang.NullPointerException\n\tat org.eclipse.wst.server.core.model.ServerBehaviourDelegate.publish(ServerBehaviourDelegate.java:555)\n\tat org.eclipse.wst.server.core.internal.Server.doPublish(Server.java:800)\n\tat org.eclipse.wst.server.core.internal.Server.publish(Server.java:788)\n\tat org.eclipse.wst.server.core.internal.PublishServerJob.run(PublishServerJob.java:145)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)",
    "You raise a good point.  I have not seen others hit this yet, but if we do have a WTP 1.0.2, this would be a good candidate.  I\u0027m going to bump up the severity to indicate that.",
    "*** Bug 125711 has been marked as a duplicate of this bug. ***",
    "More and more people are experiencing this issue.  I believe this is a stop ship for WTP 1.0.1.  We either need to clean up the .component programmatically or better handle spurrious mappings.",
    "*** Bug 126361 has been marked as a duplicate of this bug. ***",
    "The .component file can quickly become hard to manage as project size increases and redudant maps are added for each file and folder.  Currently, if a folder is mapped, then all of its children are inherently mapped as well.  We do not support overlapping maps.  To this end, I have added code to check to see if redundant maps exist and then clean the file automatically on load.\n\nThis in turn will allow the publish to deploy the files correctly.\n\nThis is fixed for the 1.0.1 WTP 02/14/06 build and the WTP 1.5 stream.",
    "This bug was moved to \u0027closed\u0027 state, since it is so old its assumed fixed and no longer useful or need further attention. Feel free to re-open, or open a new bug, if this semi-automatic processing was done in error. ",
    "I\u0027ve installed the last WTP (Callisto) release a few day ago and while it worked for a day or 2 WTP no logner publishes Web Projects correctly.\n\nSo this seesm to be still a bug but I\u0027m not allowed to reopen it",
    "(In reply to comment #16)\n\u003e I\u0027ve installed the last WTP (Callisto) release a few day ago and while it\n\u003e worked for a day or 2 WTP no logner publishes Web Projects correctly.\n\u003e \n\u003e So this seesm to be still a bug but I\u0027m not allowed to reopen it\n\u003e \n\nOk, sound like a new bug might be in order then, and you can refer to this one in the new bug. \n\n\n"
  ],
  "commentCreationDates": [
    "2006-02-02T23:25:31+01:00",
    "2006-02-03T14:01:29+01:00",
    "2006-02-03T14:58:41+01:00",
    "2006-02-03T17:41:09+01:00",
    "2006-02-03T17:44:45+01:00",
    "2006-02-03T18:02:12+01:00",
    "2006-02-03T19:45:31+01:00",
    "2006-02-03T19:47:00+01:00",
    "2006-02-06T20:35:09+01:00",
    "2006-02-08T20:29:42+01:00",
    "2006-02-08T20:49:10+01:00",
    "2006-02-10T19:02:08+01:00",
    "2006-02-10T19:04:05+01:00",
    "2006-02-10T19:05:51+01:00",
    "2006-02-14T02:21:14+01:00",
    "2006-09-25T08:56:55+02:00",
    "2006-09-26T19:58:45+02:00",
    "2006-09-26T20:38:51+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.wst.server.core.model.ServerBehaviourDelegate.publish",
          "source": "ServerBehaviourDelegate.java:555"
        },
        {
          "method": "org.eclipse.wst.server.core.internal.Server.doPublish",
          "source": "Server.java:800"
        },
        {
          "method": "org.eclipse.wst.server.core.internal.Server.publish",
          "source": "Server.java:788"
        },
        {
          "method": "org.eclipse.wst.server.core.internal.PublishServerJob.run",
          "source": "PublishServerJob.java:145"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 9,
      "bugId": "126291",
      "date": "2006-02-08T20:29:42+01:00",
      "product": "Web Tools",
      "component": "jst.j2ee",
      "severity": "critical"
    }
  ],
  "groupId": "126291",
  "bugId": "126291",
  "date": "2006-02-02T23:25:31+01:00",
  "product": "Web Tools",
  "component": "jst.j2ee",
  "severity": "critical"
}