{
  "comments": [
    "The goal is to create an compartment which shows elements which are not in a semantic containment relationship to the graphical container.\n\n\nIn a child node mapping done in the gmfmap editor it is not possible to set an editfeature if no element is specified. If we specify an element we are not able to set the containment feature. \n\nIf no editfeature is set we get a BasicIndexOutOfBoundsException\n\nCaused by: org.eclipse.emf.common.util.BasicEList$BasicIndexOutOfBoundsException: index\u003d0, size\u003d0\n\tat org.eclipse.emf.common.util.BasicEList.get(BasicEList.java:511)\n\tat org.eclipse.gmf.codegen.templates.parts.ChildNodeEditPartGenerator.generate(ChildNodeEditPartGenerator.java:55)\n\t... 16 more\n\nIf an element is set we are not able to set the proper containmentfeature\n\nWhen we patch the xmi manually (add the editfeature, we do not set the element) the generation is succesfull and we can run the generated editor without any problems.",
    "Compartment content from non-containment feature should be possible (unless we fix gmfmap model) with tuning gmfgen model, TypeModelFacet.childMetaFeature.\n\nAnother part of the request is\n\u003e\u003e in the gmfmap editor it is not possible to set an editfeature if no element is specified. \n\n That\u0027s legal to my taste.\n\n\u003e\u003eIf we specify an element we are not able to set the containment feature. \n\nThat\u0027s unexpected :) Could you please share your .ecore model and point to exact element that causes problems.\n\nBesides, I\u0027m not sure which incarnation of GMF you are using. The logic to filter features had changed since M4, so checking against latest builds would be helpful.",
    "Created an attachment (id\u003d34773)\necore model and mapping files\n\nHi,\n\nwe are using M4.\nThe problem in the model is to craete a figure for \u0027Dot\u0027 with a compartment for the comments. Semantically the comments are not contained in the Dot.\nIf they would be contained everything works fine.\n\nAnother feature we have tried out for the model is to have two representations of the \u0027Line\u0027:\n1. as a connection between two dots\n2. the outgoing lines are shown in a compartement of the outgoing dot\n\nThe second  representation works even if the reference \u0027out\u0027 from the dot to the line is not a contaiment reference. But therefore we have not used a creation tool for this.\nThe creation tool for the comment does not allow us to create comments inside the compartment of Dot. \n\nThanks for your answer ;-)\n\nStefan",
    "I\u0027ve checked usecase against latest state and fixed filtering mechanism to include not only features available in domain element (e.g. Dot), but also features that target elements compatible with child (e.g. Comment).\n\nAs for \"two representations of the \u0027Line\u0027\" part of question, I\u0027m puzzled :). If it relates to gmfmap\u0027s property sheet, please reopen the request with. If it\u0027s different problem, I\u0027d better file separate request to handle it. Thank you!"
  ],
  "commentCreationDates": [
    "2006-02-15T13:04:18+01:00",
    "2006-02-15T14:09:17+01:00",
    "2006-02-15T15:01:33+01:00",
    "2006-05-19T18:04:17+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.emf.common.util.BasicEList$BasicIndexOutOfBoundsException",
      "message": "index\u003d0, size\u003d0",
      "elements": [
        {
          "method": "org.eclipse.emf.common.util.BasicEList.get",
          "source": "BasicEList.java:511"
        },
        {
          "method": "org.eclipse.gmf.codegen.templates.parts.ChildNodeEditPartGenerator.generate",
          "source": "ChildNodeEditPartGenerator.java:55"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "128013",
      "date": "2006-02-15T13:04:18+01:00",
      "product": "GMF",
      "component": "Definition",
      "severity": "normal"
    }
  ],
  "groupId": "128013",
  "bugId": "128013",
  "date": "2006-02-15T13:04:18+01:00",
  "product": "GMF",
  "component": "Definition",
  "severity": "normal"
}