{
  "comments": [
    "It would be nice to have a new query wizard similar to the one in the Bugzilla support and JIRA dashboard.",
    "Eugene, I realize that you would prefer opening a query to take you to the query selection dialog, but I\u0027d like to explore this first before doing that, since it would require a (minor) hack around our architecture.",
    "Well, maybe there is some use in opening query results as a web page. So, you could provide both options (the same also true for Bugzilla). \n\nAnother option would be to have special editor for altering query parameters like one opened for local groups. Then one of tabs could open web view.",
    "*** Bug 131064 has been marked as a duplicate of this bug. ***",
    "Created an attachment (id\u003d35968)\nCustom query support\n\nSorry, forgot to turn my brain on and search for existing issues first.  Here is a patch that adds support for custom queries.\n\nA few problems:\n- Doesn\u0027t support editing queries\n- Queries aren\u0027t persisted\n- Removes the Named filter issue wizard\n- Probably heaps more...",
    "Thanks Brock!\n\nI can\u0027t apply this in it\u0027s current form because it breaks mylar.jira.tests, and because it removes the support for existing filters from the UI.  Those turn out to be an important part of the story for making it easy for existing Web UI users to easily move to Mylar (and that\u0027s going to be prominent in the EclipseCon presentation :)\n\nIn terms of proceeding on this though, if you have time to preserve the current behavior, and to have us support the custom filters, than I should be able to add that before EclipseCon.  If not I can put it on my list, but it\u0027s not that likely that I\u0027ll be able to get to it before EclipseCon.",
    "Created an attachment (id\u003d39630)\nCustom query support\n\nReworked Brock\u0027s patch. Now support both server and custom queries. UI reworked to better use screen estate.\n\nOutstanding issues: xml serializer, editor for existing queries, some cosmetic UI glitches.",
    "Nice!!  What do you mean \"xml serializer\"?  The queries were stored and restored correctly for me.  I\u0027ve fixed up the patch to match our code conventions, fixed warnings (should be none).  The following need doing before I can apply:\n1) Fix type safety warnings in FilterSummaryPage and IssueAttributesPage\n2) Those two classes need to have a compatible copyright attribution.  I changed it to the following.\n\nBrock: you need to aggree to this before I can apply the patch.  Technically you asserted that this code was all your original code and copyright you when attaching the patch, but we need to keep the copyright notices straight.  But if you like I can look into changing the \"and others\" to you or JIRA Dashboard project since my understanding is that you retain the copyright to this code.  Let me know.\n\n * Copyright (c) 2006 - 2006 Mylar eclipse.org project and others.\n...\n * Contributors:\n *     Brock Janiczak - initial API and implementation\n\nEugene: do you want to shoot for having this in tomorrow\u0027s release?",
    "Created an attachment (id\u003d39731)\nMik\u0027s updates\n\n",
    "Created an attachment (id\u003d39732)\nFixed warnings from comment comment #7\n\n(In reply to comment #7)\n\u003e Nice!!  What do you mean \"xml serializer\"?  The queries were stored and\n\u003e restored correctly for me.  \n\nThing is that query params actually not saved right now. So, you can\u0027t edit query without it.\n\n\u003e I\u0027ve fixed up the patch to match our code\n\u003e conventions, fixed warnings (should be none).  The following need doing before\n\u003e I can apply:\n\u003e 1) Fix type safety warnings in FilterSummaryPage and IssueAttributesPage\n\nFixed that in the attached patch. \n\nBTW, can you put all the warning and other configurations on the project level?\n\n\u003e 2) Those two classes need to have a compatible copyright attribution.  I\n\u003e changed it to the following.\n\n...\n\n\u003e Eugene: do you want to shoot for having this in tomorrow\u0027s release?\n\nI\u0027d pretty much love to!\n\nActually I was doing all that only to be able to quickly change filter for fields such as due date... Then realized that those fields are not in the Brock\u0027s implementation. :-)\n\nAnyways, this is a step in the right direction.",
    "Can do what we do with Bugzilla: just store the query as its HTML representation.  If it changes, simply regenerate the HTML?  The only trick is that to re-populate the fields you need to be able to parse the HTML string you create.  But this approach is nice and flexible and all the saving would be done for you.  And as of yesterday you can click Open in External Browser on any Bugzilla query, which can be useful.  ",
    "(In reply to comment #10)\n\u003e Can do what we do with Bugzilla: just store the query as its HTML\n\u003e representation.  If it changes, simply regenerate the HTML?  The only trick is\n\u003e that to re-populate the fields you need to be able to parse the HTML string you\n\u003e create.  But this approach is nice and flexible and all the saving would be\n\u003e done for you.\n\nI have to look at this. I think Brock is doing something fancy with custom filter. It is saved under choosen name somewhere in prefs of jira core. Anyways, can we do it after you apply this patch?\n\n\u003e And as of yesterday you can click Open in External Browser on\n\u003e any Bugzilla query, which can be useful.  \n\nBTW, why external? Please make it to respect settings from General / Web browser.\n\n",
    "So I assume that you\u0027re getting query param persistence from JIRA Core Services then?  In that case it seems OK for it to go out in the current state for 0.5.1 (marked Experimental)?\n\nI should wait for Brock\u0027s answer to comment#7 before applying.",
    "wrt comment 7, i thought that as soon as a patch is added to bugzilla it became property of eclipse.org.  The headers mention jira dashboard because i copied them across without modification just to get the thing going.\n\nI have no problems with you treating this as new code and putting the standard mylar header on it.  It really doesn\u0027t need to be copyright mylar and others, but I am not a lawyer :)",
    "Yes, that\u0027s correct Brock regarding it becoming eclipse.org\u0027s, although copyright gets retained by author(s), but I\u0027m also not a lawyer :)  I just want the copyright notices to be straight, and you answered my question so we\u0027re ready to attach :)  I\u0027ll figure out what the right top of the copyright statement is for this kind of thing since I can\u0027t find an example on eclipse.org off-hand.  But great, looks like we can go ahead :)\n\nEugene, just answer comment#12 and I\u0027ll apply.\n",
    "(In reply to comment #14)\n\u003e Yes, that\u0027s correct Brock regarding it becoming eclipse.org\u0027s, although\n\u003e copyright gets retained by author(s), but I\u0027m also not a lawyer :)  I just want\n\u003e the copyright notices to be straight, and you answered my question so we\u0027re\n\u003e ready to attach :)  I\u0027ll figure out what the right top of the copyright\n\u003e statement is for this kind of thing since I can\u0027t find an example on\n\u003e eclipse.org off-hand.  But great, looks like we can go ahead :)\n\u003e \n\u003e Eugene, just answer comment#12 and I\u0027ll apply.\n\nI think that is the case. Though I haven\u0027t changed that code. Its been in Brock\u0027s original patch. So, please apply this stuff and we can work on fixes.\n\nPS: Brock, I hope you don\u0027t mind me messing with your patches. I just really wanted this in, and got seek from that dropdown thing in current integration.",
    "Will be back online in a bit... can\u0027t apply this yet becaue it\u0027s not fully functional, the following breaks (as you probably realize)\n- create query\n- synch\n- exit workbench\n- synch query (fails, no matches, no way to edit)",
    "Created an attachment (id\u003d39758)\nfix for query persistence\n\n(In reply to comment #16)\n\u003e can\u0027t apply this yet becaue it\u0027s not fully\n\u003e functional, the following breaks (as you probably realize)\n\u003e - create query\n\u003e - synch\n\u003e - exit workbench\n\u003e - synch query (fails, no matches, no way to edit)\n\nOk. I\u0027ve made a quick hack to resolve this issue (using Java serialization and storing encoded FilterDefinition). Proper fix would require changes in Jira core services - encode/decode (perhaps in form of http params)\n\nIn addition I made some tweaks in new query wizard and added editor for existoing queries.\n\nThings that not working yet:\n\n-- Open in External browser does not work (would need Jira core to expose query url somehow)\n-- Editor wizard can\u0027t go to the next page if custom filter is selected. I wasn\u0027t been able to find why.\n\nI think this can be resolved later. Though we may have incompatible data structures when Jira core will provide own encoding methods. But personally I would be ok with loosing query data if format changes.",
    "This change caused me to lose all my JIRA queries becuase the filter definition was null, so some extra exception handling needs to happen there to ensure it can\u0027t happen to users:\n\n   FilterDefinition filter \u003d decodeFilter(custom);\n\nAlso, it breaks the filter save test, and perhaps that\u0027s related to my losing queries (is it passing for you?).  If you can get that fixed we may still be able to get this in to 0.5.1 (freeze early aft PST), since this is a reasonable hack until the URL-based saving can be done.  We will have to mark Experimental since people could lose query settings after the format is changed).  \n\njunit.framework.AssertionFailedError\n\tat junit.framework.Assert.fail(Assert.java:47)\n\tat junit.framework.Assert.assertTrue(Assert.java:20)\n\tat junit.framework.Assert.assertNotNull(Assert.java:220)\n\tat junit.framework.Assert.assertNotNull(Assert.java:213)\n\tat org.eclipse.mylar.jira.tests.JiraTaskExternalizationTest.testJiraFilterHitSave(JiraTaskExternalizationTest.java:144)\n\n",
    "Created an attachment (id\u003d39794)\nfix for deserializing broken queries\n\n(In reply to comment #18)\n\u003e This change caused me to lose all my JIRA queries becuase the filter definition\n\u003e was null, so some extra exception handling needs to happen there to ensure it\n\u003e can\u0027t happen to users:\n\u003e \n\u003e    FilterDefinition filter \u003d decodeFilter(custom);\n\u003e \n\u003e Also, it breaks the filter save test, and perhaps that\u0027s related to my losing\n\u003e queries (is it passing for you?).  \n\nI\u0027ve added couple additional checks. And have verified that other tasks are staying there if custom filter can\u0027t be deserialized.\n\n\u003e If you can get that fixed we may still be\n\u003e able to get this in to 0.5.1 (freeze early aft PST), since this is a reasonable\n\u003e hack until the URL-based saving can be done.  We will have to mark Experimental\n\u003e since people could lose query settings after the format is changed).  \n\nMakes sense.",
    "Patch applied!  This is a really great contribution.  And the timing is great because soon I\u0027d like to pull a bit more common query and wizard into tasklist.\n\nPlease check out the minor UI changes I made (just to the labels) to make it more consistent with the Bugzilla connector.\n\nSo I think that this task is done.  It looks like we have two things left to do, do you want to make them seperate reports?\n- URL-based storage for custom JIRA queries\n- editing custom query properties (currently opens dialog, but can\u0027t click \"finish\")\n\nSince this isn\u0027t completely covered by unit tests I\u0027m going to add some coverage to \"tests-manual.html\" where we have the Bugzilla coverage.  I\u0027ll be making a dev build available shortly so that you can work with this support before we release.",
    "Dev build is available.",
    "Created an attachment (id\u003d39840)\nTall dialog\n\nVery nice Eugene.  The only problem i have is the excessive amount of vertical space whed when there are a lot of projects (see screenshot).  One thing that may be worth trying is moving the versions and components under the project, shortening the project list and displaying a text box (or browser) on the right displaying the description.  When there is support for getting categories from the server, there could be an option to display the projects as a tree or a list.",
    "(In reply to comment #20)\n\u003e Patch applied!  This is a really great contribution.  And the timing is great\n\u003e because soon I\u0027d like to pull a bit more common query and wizard into tasklist.\n\nThanks Mik. Current query code definetely need a good refactoring.\n\n\u003e So I think that this task is done.  It looks like we have two things left to\n\u003e do, do you want to make them seperate reports?\n\u003e - URL-based storage for custom JIRA queries\n\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d139312\n\n\u003e - editing custom query properties (currently opens dialog, but can\u0027t click\n\u003e \"finish\")\n\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d139314\n\nI\u0027ve looked at this quickly, but wasn\u0027t been able to find what the issue is. It seems like life cycle for editor and wizard dialogs are somehow different.\n\nSame about dialog size on details page Brock reported. I actually cheated and used WindowBuilder to drag components around. :-)  \nSo, I am not sure why and how, but it seems like vertical grabbing space is set to something too agressive.\n\n\u003e Since this isn\u0027t completely covered by unit tests I\u0027m going to add some\n\u003e coverage to \"tests-manual.html\" where we have the Bugzilla coverage.  I\u0027ll be\n\u003e making a dev build available shortly so that you can work with this support\n\u003e before we release.\n\nI didn\u0027t want to spend time on tests, because persistence stuff will change...",
    "(In reply to comment #22)\n\n\u003e Very nice Eugene.  The only problem i have is the excessive amount of vertical\n\u003e space whed when there are a lot of projects (see screenshot).  \n\nProblem is that dialog is resize automatically, and I can\u0027t figure out why.\n\n\u003e One thing that may be worth trying is moving the versions and \n\u003e components under the project, shortening the project list and \n\u003e displaying a text box (or browser) on the right displaying the description.  \n\nNot sure what you mean by this. Can you make a screen mockup or something?\n\n\u003e When there is support for getting categories from the server, \n\u003e there could be an option to display the projects as a tree or a list.\n\nNot sure if that would be a good idea. Right now you can jump to the project hitting first letter. So, maybe quickfilter would be better.",
    "Marking resolved since this is now functional (yay!).  There is still the formatting issues, and those can be attached to this or to another report as you see fit.  (It\u0027s funny, I never bothered to make a filter for just Mylar-related JIRA dashboard issues, but with this did it right away :)",
    "(In reply to comment #25)\n\u003e Marking resolved since this is now functional (yay!).  There is still the\n\u003e formatting issues, and those can be attached to this or to another report as\n\u003e you see fit.  \n\nWhat Eclipse build can I use with latest dev?\n\n\u003e (It\u0027s funny, I never bothered to make a filter for just\n\u003e Mylar-related JIRA dashboard issues, but with this did it right away :)\n\nOne thing probably would make sense to change for both Jira and Bugzilla editors is to allow to specify custom name. Then put that name field on top 1st wizard page for both jira and bugzilla. So, it will allow to use custom name even for server side filters.",
    "Any post-RC1 non nightly should work with the latest dev.  But I\u0027m about to put up a new dev build.",
    "(In reply to comment #27)\n\u003e Any post-RC1 non nightly should work with the latest dev.  But I\u0027m about to put\n\u003e up a new dev build.\n\nWhat are you using? Recent integration builds all red. :-(\n",
    "I know \u003csigh\u003e.  Just use the following:\n\nhttp://download.eclipse.org/eclipse/downloads/drops/I20060428-1315/index.php\n\nMylar build with 1600 will be available within minutes too."
  ],
  "commentCreationDates": [
    "2006-02-23T00:42:59+01:00",
    "2006-02-23T00:45:48+01:00",
    "2006-02-23T00:49:32+01:00",
    "2006-03-09T10:04:46+01:00",
    "2006-03-09T10:09:44+01:00",
    "2006-03-10T03:48:51+01:00",
    "2006-04-27T08:43:07+02:00",
    "2006-04-28T02:34:33+02:00",
    "2006-04-28T02:37:17+02:00",
    "2006-04-28T03:07:40+02:00",
    "2006-04-28T03:22:22+02:00",
    "2006-04-28T03:34:39+02:00",
    "2006-04-28T03:50:06+02:00",
    "2006-04-28T04:02:30+02:00",
    "2006-04-28T04:09:05+02:00",
    "2006-04-28T04:13:06+02:00",
    "2006-04-28T04:48:16+02:00",
    "2006-04-28T15:39:00+02:00",
    "2006-04-28T17:36:44+02:00",
    "2006-04-28T18:01:31+02:00",
    "2006-04-28T19:55:22+02:00",
    "2006-04-28T20:57:02+02:00",
    "2006-04-28T23:25:46+02:00",
    "2006-04-29T00:34:23+02:00",
    "2006-04-29T00:39:32+02:00",
    "2006-04-29T00:43:19+02:00",
    "2006-04-29T00:52:34+02:00",
    "2006-04-29T00:54:49+02:00",
    "2006-04-29T00:57:46+02:00",
    "2006-04-29T01:01:19+02:00"
  ],
  "traces": [
    {
      "exceptionType": "junit.framework.AssertionFailedError",
      "elements": [
        {
          "method": "junit.framework.Assert.fail",
          "source": "Assert.java:47"
        },
        {
          "method": "junit.framework.Assert.assertTrue",
          "source": "Assert.java:20"
        },
        {
          "method": "junit.framework.Assert.assertNotNull",
          "source": "Assert.java:220"
        },
        {
          "method": "junit.framework.Assert.assertNotNull",
          "source": "Assert.java:213"
        },
        {
          "method": "org.eclipse.mylar.jira.tests.JiraTaskExternalizationTest.testJiraFilterHitSave",
          "source": "JiraTaskExternalizationTest.java:144"
        }
      ],
      "number": 0,
      "commentIndex": 18,
      "bugId": "129086",
      "date": "2006-04-28T17:36:44+02:00",
      "product": "Mylyn",
      "component": "Jira",
      "severity": "enhancement"
    }
  ],
  "groupId": "129086",
  "bugId": "129086",
  "date": "2006-02-23T00:42:59+01:00",
  "product": "Mylyn",
  "component": "Jira",
  "severity": "enhancement"
}