{
  "comments": [
    "On line 201 of HttpListener, is this code:\n\tHttpThread thread \u003d configuration.pool.getThread();\n\nI get an intermittent NPE from this, especially when I try to run in debug mode. This makes me suspect some sort of (gasp!) start level dependency problem. Anyone seen anything like this or have a clue how to work around it?\n\norg.eclipse.equinox.http (1.0.0.v20060206)",
    "Paul, can you cut and paste your exception to this bug?",
    "Here is the stack trace. This is as deep as it goes.\n\nException in thread \"Thread-1\" java.lang.NullPointerException\n\tat org.eclipse.equinox.http.HttpListener.run(HttpListener.java:201)",
    "Created an attachment (id\u003d36902)\nhttplistener patch\n\nJust some ideas...\nThere\u0027s possibility for trouble during start and stop of the HttpConfiguration.\n\nIn initialize() there\u0027s a comment...\n/* Create configured listeners before thread pool\n * in case we exceed the number of threads */\n\nI think we _have to_ initialize the thread pool before-hand because the listener will try to use the pool if it get\u0027s a request. Even if there are more listeners than threads it\u0027s not optimal but also not catastrophic as the listener will just block until a thread is available.\n\nIn close() we shouldn\u0027t explicitly set the pool\u003dnull (just helps GC) as a listener may still be live. In this case the pool.getThread() will return null which is handled in the listener.\n\n",
    "Jennifer, any progress here?  Please investigate for 3.2.",
    "Created an attachment (id\u003d38827)\nproposed fix for 130028 and 130443\n\nThe proposed patch also includes fixes for HttpService build warnings (see bug #130443).",
    "Hi Jennifer,\n\nWould you mind if we did this in two separate pieces. It\u0027s hard for me to see what\u0027s changed for this particular fix. Is it just my patch?\n\nAlso, I think your global \"org.eclipse.jdt.core.compiler.problem.unqualifiedFieldAccess\" setting is over-riding the project\u0027s settings.\n\nI\u0027ve had it in my local workspace for ages, so I\u0027ll submit an updated \"warning cleanup\" patch in bug 130443 that cleans according to the project settings.",
    "ok, fair enough, I\u0027ve applied Simon\u0027s patch and will apply the warnings fixup patch separately.\n\n[contributed patch applied]",
    "adding \"contributed\" keyword to patches contributed by the community."
  ],
  "commentCreationDates": [
    "2006-03-01T20:46:37+01:00",
    "2006-03-01T20:59:04+01:00",
    "2006-03-01T21:03:08+01:00",
    "2006-03-24T18:17:52+01:00",
    "2006-04-09T23:07:58+02:00",
    "2006-04-18T20:07:43+02:00",
    "2006-04-18T21:15:41+02:00",
    "2006-04-19T01:01:36+02:00",
    "2006-08-23T21:20:30+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.equinox.http.HttpListener.run",
          "source": "HttpListener.java:201"
        }
      ],
      "number": 0,
      "commentIndex": 2,
      "bugId": "130028",
      "date": "2006-03-01T21:03:08+01:00",
      "product": "Equinox",
      "component": "Bundles",
      "severity": "normal"
    }
  ],
  "groupId": "130028",
  "bugId": "130028",
  "date": "2006-03-01T20:46:37+01:00",
  "product": "Equinox",
  "component": "Bundles",
  "severity": "normal"
}