{
  "comments": [
    "I tried to create new report. The strange thing that I couldn\u0027t find it in the place where it was supposed to be (New-\u003eOther -\u003e Mylar). Then I found this wizard in the Task list pull down menu. After filling the form and pressing Finish button I got an error message about login problem (which was certainly wrong) and call stack trace in .log:\n\njava.lang.NullPointerException\nat org.eclipse.mylar.internal.bugzilla.ui.wizard.AbstractBugzillaWizardPage.setPlatformOptions(AbstractBugzillaWizardPage.java:738)\nat org.eclipse.mylar.internal.bugzilla.ui.wizard.AbstractBugzillaWizardPage.createControl(AbstractBugzillaWizardPage.java:381)\nat org.eclipse.jface.wizard.WizardDialog.updateForPage(WizardDialog.java:1023)\nat org.eclipse.jface.wizard.WizardDialog.access$2(WizardDialog.java:1016)\nat org.eclipse.jface.wizard.WizardDialog$4.run(WizardDialog.java:1006)\nat org.eclipse.swt.custom.BusyIndicator.showWhile(BusyIndicator.java:69)\nat org.eclipse.jface.wizard.WizardDialog.showPage(WizardDialog.java:1004)\nat org.eclipse.jface.wizard.WizardDialog.nextPressed(WizardDialog.java:743)\nat org.eclipse.jface.wizard.WizardDialog.buttonPressed(WizardDialog.java:345)\nat org.eclipse.jface.dialogs.Dialog$3.widgetSelected(Dialog.java:645)\nat org.eclipse.swt.widgets.TypedListener.handleEvent(TypedListener.java:90)\nat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\nat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:925)\nat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3287)\nat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2907)\nat org.eclipse.jface.window.Window.runEventLoop(Window.java:811)\nat org.eclipse.jface.window.Window.open(Window.java:789)\nat org.eclipse.mylar.internal.tasklist.ui.actions.NewRepositoryTaskAction.run(NewRepositoryTaskAction.java:67)\nat org.eclipse.mylar.internal.tasklist.ui.actions.NewRepositoryTaskAction.run(NewRepositoryTaskAction.java:79)\nat org.eclipse.ui.internal.PluginAction.runWithEvent(PluginAction.java:251)\nat org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection(ActionContributionItem.java:530)\nat org.eclipse.jface.action.ActionContributionItem.access$2(ActionContributionItem.java:480)\nat org.eclipse.jface.action.ActionContributionItem$5.handleEvent(ActionContributionItem.java:392)\nat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\nat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:925)\nat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3287)\nat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2907)\nat org.eclipse.ui.internal.Workbench.runEventLoop(Workbench.java:1899)\nat org.eclipse.ui.internal.Workbench.runUI(Workbench.java:1863)\nat org.eclipse.ui.internal.Workbench.createAndRunWorkbench(Workbench.java:417)\nat org.eclipse.ui.PlatformUI.createAndRunWorkbench(PlatformUI.java:143)\nat org.eclipse.ui.internal.ide.IDEApplication.run(IDEApplication.java:106)\nat org.eclipse.core.internal.runtime.PlatformActivator$1.run(PlatformActivator.java:99)\nat org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.runApplication(EclipseAppLauncher.java:92)\nat org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.start(EclipseAppLauncher.java:68)\nat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:374)\nat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:169)\nat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\nat sun.reflect.NativeMethodAccessorImpl.invoke(Unknown Source)\nat sun.reflect.DelegatingMethodAccessorImpl.invoke(Unknown Source)\nat java.lang.reflect.Method.invoke(Unknown Source)\nat org.eclipse.core.launcher.Main.invokeFramework(Main.java:338)\nat org.eclipse.core.launcher.Main.basicRun(Main.java:282)\nat org.eclipse.core.launcher.Main.run(Main.java:977)\nat org.eclipse.core.launcher.Main.main(Main.java:952)",
    "The New Repository Task action is now in the New wizards as it should be (fyi that fix was part of bug 133196 which will also provide additional UI consistency).\n\nThat exception occurred because the platform could not be resolved, and I\u0027ve added a guard to prevent it.  But that exception is innocuous and shouldn\u0027t have prevented a bugzilla submission.  Are you able to submit bugs, or is the login-related error causing that to fail?  If so, what is the exact text on the login screen?",
    "Created an attachment (id\u003d37072)\nError message\n\nThis is the error message I got while creating Bugzilla report.",
    "Using the Eclipse update site, last Friday I installed the latest available version of Mylar including bugzilla repository support. I was looking for New report wizard in File-\u003eNew-\u003eother-\u003eMylar (as defined in the documentation), but didn\u0027t find it overthere. That\u0027s why I opened this wizard from the task list. I easy can submit reports via the web interface. My credentials are correct and enough to do it.",
    "The Fine-\u003eNew-\u003eOther-\u003eNew Repository Task shortcut was just added yesterday, so for now the right way to create new bugzilla reposts is via the task list.\n\nWe still have no indication of the source of the failure, assuming that your login information is correct and that you use the right path to the bugzilla server (e.g. https://bugs.eclipse.org/bugs).  Are you able to create Bugzilla queries and post comments?\n\nRob: please look into this once you have input on the above.  For starters we need to clean up the exception handling for LoginException, and consider including the stack in that failure so that we can better diagnose.",
    "I have the permission to update Eclipse Bugzilla. However this case I reported about happend when I tried to create report using our corporative Bugzilla repository, which should be the same. I just don\u0027t want to contaminate Eclipse repository with my test reports. Connection seems to be OK because I validated it when added repository. Besides that, I see bugs assigned to me in the task list.",
    "Alex, could you double check that the output for your corporate bugzilla server has not been modified (i.e. html output is different on the new bug page compared to unmodified bugzilla output). Currently we parse these pages to get the necessary bug information. This unfortunately is a very brittle solution but will have to hold us over until some form of web services api is implemented.",
    "Of course they are slightly different. Moreover, in Eclipse Bugzilla there is one more (2-nd) page in the new bug creating process. \nShould I change the status of this bug report to Resolved-Later?",
    "Could you attach a screenshot (or better yet the html) of the suspect page(s)? That would help us determine a solution.",
    "Created an attachment (id\u003d37235)\nTwo Input new Bug pages\n\nHere you go",
    "Is PRZilla an internal Bugzilla customization by qnx or an externally available product? ",
    "This is the Bugzilla customisation not a separate product",
    "Unfortunately we do not support customized bugzilla repositories. We do our best to keep the repository support within Mylar generic but changes to Bugzilla presentation layer are problematic due to the current reliance on screen scraping.  \nThis being said, you could extend Mylar to work with your particular repository. \n\nIf possible, could you post on this report what is and is not working so that we have a record to refer to when/if we start on such an extension? Thanks.",
    "I list below some discrepancies in behavior between WEB interface and Mylar client I ran into while testing Mylar.\n1)Search report - selection of Product does not affect content of Components combo.\n2) Search report - keywords search. Opens Search view, informs that several occurences was found, but view itself is empty.\n3)While connecting to Eclipse bugzilla, I provide any User ID and password, then press Validate button and always get message box \"Autentificational redentials are valid. Maybe the cause of such behavior is that my workspace already has one repository, but this looks confusing.\n4) Bug editor image looks corrupted (see next attachment). It does not happen always. I easy reproduce it if I scroll long report to the bottom, then start to scroll up. Probably, this is SWT issue.\n5) In bug report I typed new comment, then pressed Submit. The only result was this button disabling. Stil had \"*\" in the Editor tab, editor content has not changed. If I re-opened updated report, I saw there is no submitted changes.\n6)This is rather request: no search in report, I tried a big one, and it was very problematic to find something in it.\n7) A lot of fields editable throug the WEB interface are not editable in the client editor.",
    "Created an attachment (id\u003d37322)\nEditor corrupted display\n\n",
    "Great. Thanks for this feedback Alex.\n\n1)Search report - selection of Product does not affect content of Components\ncombo.\n \n  Yes.  This should be submitted as a new bug report. If you could submit this it would be great. We would like to be able to credit the individuals who bring up these bugs.\n\n\n2) Search report - keywords search. Opens Search view, informs that several\noccurences was found, but view itself is empty.\n\n  I assume this is due to the QNX Bugzilla issues. I\u0027ll investigate handling this better as part of bug# 132395.\n\n3)While connecting to Eclipse bugzilla, I provide any User ID and password,\nthen press Validate button and always get message box \"Autentificational\nredentials are valid. Maybe the cause of such behavior is that my workspace\nalready has one repository, but this looks confusing.\n\n   I\u0027m unable to reproduce this one. Can you provide more context?\n\n4) Bug editor image looks corrupted (see next attachment). It does not happen\nalways. I easy reproduce it if I scroll long report to the bottom, then start\nto scroll up. Probably, this is SWT issue.\n\n  I\u0027m in the process of fixing this at the moment. FormText widget has turned out to be problematic so will be moving to StyledText.\n\n5) In bug report I typed new comment, then pressed Submit. The only result was\nthis button disabling. Stil had \"*\" in the Editor tab, editor content has not\nchanged. If I re-opened updated report, I saw there is no submitted changes.\n\n   This again is probably the result of the problems communicating with QNX bugzilla.  We\u0027ll need handle this error properly. I\u0027ll tack this on to the previously mentioned report.\n\n6)This is rather request: no search in report, I tried a big one, and it was\nvery problematic to find something in it.\n\n  Yes. This is another candidate for a new bug report (feature request).\n\n\n7) A lot of fields editable throug the WEB interface are not editable in the\nclient editor.\n\n  We are aware of attachments and keywords. The others should be modifiable. There was a bug which was causing changes to the combo boxes to be ignored but I have fixed that as part of my recent work on the bug editor.\n",
    "\u003e\u003e3)While connecting to Eclipse bugzilla, I provide any User ID and password\nI made a mistake typing:\nhttp://bugs.eclipse.org/bugs (instead of https) and got validation  OK. I think it is still a bug.\nOK, I\u0027ll open a couple of new reports as you asked (not the bug mentioned above - it is up to you).",
    "That\u0027s such a common typo.. Rob, make sure that validation fails for that.",
    "Alex: Regarding the bug submission problems you mentioned, we are going to move to an xml/rdf based solution for gathering bug information. This may solve the problems you encountered when submitting to your corporate Bugzilla server. Watch bug# 136219 for updates on the xml/rdf conversion.",
    "Alex, \n\nThe rdf/xml conversion has been completed. Could you try the latest developer release of Mylar against your internal custom bugzilla and let us know if you have any difficulties. Thanks.\n\n\nDeveloper Release Update Site: download.eclipse.org/technology/mylar/update-site/dev",
    "Created an attachment (id\u003d41737)\nProblem illustration\n\nI updated plugins and tried to create new bug report. A sort of small browser window came up. When I clicked to it, I got the frozen IDE (see my attachment)",
    "Rob: this happened to me yesterday too, when my internet connection died on submission (browser window came up, disappeared, and Eclipse froze as in the screenshot and needed to be killed).  Seems that we recently blotched sometihng with the error handling--I just tried and you can replicate it by trying to assign a non-existant Assigned To email address.\n\nAlex: are queries and opening existing reports working?",
    "Created an attachment (id\u003d41759)\nmylar/context/zip\n\nDone. Fix is in head. Here is context for new bug submission fix.",
    "Reply to comment #21\nQuery and report opening work fine. I noticed just a few minor issues:\n- bugzilla URL in my case is quite long, everybody uses alias \"przilla\"; browser understands it well, but I couldn\u0027t use it while defining the new task repository\n- All the lists in combo boxes seem to be unsorted It was a real pain to find target milestone for example\n- in Task List there are no column titles (\"Description\" is an exception)",
    "Good to hear.  Regarding your comments:\n- We do not support these kinds of aliases because the URL is used to uniqely identify the task.\n- Rob is working on fixing this now.\n- That\u0027s correct, the first column is just icon/activation, and the next three are status columns that don\u0027t have enough room for text.  However, we do plan on adding support for configurable columns (bug 126788).\n\nWe will have a new build available for you to try submission on again today, since our goal is to have 0.5.2 (scheduled for Friday) to support custom repositories such as QNX\u0027s.",
    "Alex: could you try the latest dev build and let us know what errors you get on new bug submission if you see any?\n\n  http://www.eclipse.org/mylar/dl.php",
    "Creation of the new report still does not work. After filling the form I press Finish and get a small dialog (the same I mentioned in the previous message). There is only one button OK. I press it and just return to the same form for a new report creation. Thanks God, it does not create a new report:-). THere is nothing in Eclipse Error Log.",
    "Alex, I assume this is a browser dialog again, what is the error message?",
    "No Error. See attachment.\n",
    "Created an attachment (id\u003d41915)\nBrowser dialog\n\n",
    "From the looks of this there may be a problem with the email address. Could you confirm that your user name and password are valid in the Task Repositories view? Note that we require the User Name to be the email address used with Bugzilla.",
    "If I validate settings, I get a message \"Authentication credential is valid\". I can submit requests, I can open any particular report, but I cannot create new one or edit existing one. Of course I can do it using WEB interface. What can I check more?",
    "Is your bugzilla username your email address, or are these different in PRZilla?  Have you ever seen PRZilla give that \"Confirm Match\" message when submitting via the web UI?  We need to figure out why it\u0027s unsuccessfully trying to match an email address.",
    "Created an attachment (id\u003d42052)\nLogin screen\n\nThis is a snapshot of my login screen. I\u0027ve never seen \"Confirm Match\" message before.",
    "We still haven\u0027t narrowed this down since we can\u0027t reproduce.  However, today\u0027s 0.5.2 release fixed a problem that was related.  Please try that and let us know if anything different happens on trying to submit a new report.",
    "Now i\u0027ve got an exception while create new query:\n\nAn internal error occurred during: \"Synchronizing queries: bugzilla\".\n\njava.lang.AbstractMethodError: org.eclipse.mylar.provisional.tasklist.AbstractRepositoryConnector.getChangedSinceLastSync(Lorg/eclipse/mylar/provisional/tasklist/TaskRepository;Ljava/util/Set;Ljava/util/Date;)Ljava/util/List;\nat org.eclipse.mylar.provisional.tasklist.SynchronizeQueryJob.run(SynchronizeQueryJob.java:84)\nat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)\n\nBefore that I updated to 0.5.2, cleaned repository list and create new repository item/ While creating repository item I validated my Bugzilla credentials.",
    "It appears as though you have two conflicting versions of Mylar installed.\nMake sure you\u0027ve updated all of the features to 0.5.2. Partial updates can happen if you used \"Search for updates to the currently installed features\". For more information please see:\n\nhttp://www.eclipse.org/mylar/doc/faq.php#install",
    "Cleaning solved the last problem (I managed to get rid of 0.5.2 \u0026 0.5.1 features, but not 0.5.0 because uninstall option for these features stayed always disabled).\nHowever either update or create new report caused the same Confirm Match message. I\u0027ve no idea what\u0027s wrong. Do you have  plugin versions that provide runtime tracing?",
    "One more thing I can try tomorrow. I\u0027ll create new copy of Eclipse with new workspace and fresh install MyLar to be sure that there is no impact of any old garbage (I have some suspicions that this is a case).",
    "Runtime tracing wouldn\u0027t help us here since the only error we get is bugzilla\u0027s error page.  However I\u0027ll look into dumping the error page and what got submitted to the error log.\n\nNote that if you can\u0027t uninstall, you could always delete the old plugins and features from their respective directories. With a clean install, let us know what fails and we\u0027ll go from there. Thanks for your patience Alex!",
    "I\u0027m sorry, but clean installation RC5 + 0.5.2 didn\u0027t change anything. Error log is empty.\nAny ideas? Could it be helpful if I trace transaction under debugger to grab any data of interest?",
    "Okay, there is a new dev build available for you that will output to the log all the attributes being sent when this error occurs. Hopefully from that we can track down the problem. The dev build update site is: download.eclipse.org/technology/mylar/update-site/dev\n",
    "OK, I see now where the bug is. They stored originator\u0027s name as \"AChapiro@qnx.com\", I connected to repository as \"achapiro@qnx.com\" which is equivalent. However somewhere (in your code or in Bugzilla server) IDs are compared as a case sensitive values. When I connected to repository as \"AChapiro@qnx.com\", the update transaction completed successfully.\n\nBelow is the .log file content (after error).\n\n\n\n!SESSION 2006-05-24 17:12:54.453 -----------------------------------------------\neclipse.buildId\u003dI20060519-1206\njava.version\u003d1.5.0_06\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dwin32, ARCH\u003dx86, WS\u003dwin32, NL\u003den_US\nCommand-line arguments:  -os win32 -ws win32 -arch x86\n\n!ENTRY org.eclipse.mylar.core 1 0 2006-05-24 17:40:53.593\n!MESSAGE Mylar: bug_status\u003dNEW | resolution\u003d | bug_id\u003d27121 | rep_platform\u003dAll | product\u003dTOOLS | op_sys\u003dAll | component\u003dTOOLS-IDE | version\u003dunknown | priority\u003dMedium | bug_severity\u003dNon-critical | assigned_to\u003dAChapiro@qnx.com | target_milestone\u003dIDE 4.0 | reporter\u003dMKisel@qnx.com | dependson\u003d | blocked\u003d | bug_file_loc\u003d | newcc\u003dachapiro@qnx.com | keywords\u003d | creation_ts\u003d2005-09-02 08:55 | short_desc\u003dStacksize field in Project Properties-\u003eCompiler tab has no effect | delta_ts\u003d2005-12-07 13:27:23 | cc\u003dTools_IDE_Mgrs@qnx.com | longdesclength\u003d6 | , source: java.lang.Class",
    "I guess under certain conditions/commands Bugzilla doesn\u0027t like different capitalization of email addresses. So all is working now I take it?  ",
    "Yes, it works ok when I update existing report. I didn\u0027t try to create new one, but I believe it should work (next time I create new report, I\u0027ll try it). What I want to mension is:\n- I never input \"AChapiro\", always \"achapiro\"; this is the Bugzilla who capitalizes the first two letters;\n- It newer causes any problem while I get an access through WEB interface.",
    "Sounds like you have it working. I\u0027m going to mark this report resovled but feel free to re-open or open a new report if you discover any problems.",
    "Actually, I just have a work around :-) Speaking in general, it does not work.",
    "Rob, should we consider always treating the email address as lower case (via String.toLowerCase)?  ",
    "I can\u0027t re-produce with Bugzilla 2.22 so assume this is unique to PRZilla. This is not likely something we will be able to fix on our end.  We\u0027d like to put this information in the online FAQ. I\u0027m curious, are you able to force your email to lower case in your PRZilla email preferences? ",
    "I just don\u0027t understand what is the difference between xxxx@yyyy.com and XXXX@YYYY.com? As a mail addresses they are similar, don\u0027t they? At least, it is very confusing. Our Bugzilla administrator told me that she could enforce using small letters in ID, but in my oppinion it is barely better because for example some people could like to type e-mail address starting with capital letter(s).\nOne particular clue: our Bugzilla uses network identification service to validate  user\u0027s credentials. And it seems to work OK when I connect to the repository using MyLar, but it fails with the same ID and password while updating or creating new report. It looks starnge for me, doesn\u0027t it?\nAnyway, it\u0027s up to you how and when to treat this problem. I just step aside :-)"
  ],
  "commentCreationDates": [
    "2006-03-24T19:10:51+01:00",
    "2006-03-28T02:59:40+02:00",
    "2006-03-28T15:30:17+02:00",
    "2006-03-28T15:32:08+02:00",
    "2006-03-28T20:23:47+02:00",
    "2006-03-28T23:41:56+02:00",
    "2006-03-29T18:39:42+02:00",
    "2006-03-29T19:44:14+02:00",
    "2006-03-29T20:52:24+02:00",
    "2006-03-29T21:22:52+02:00",
    "2006-03-29T22:54:18+02:00",
    "2006-03-29T23:01:32+02:00",
    "2006-03-29T23:31:44+02:00",
    "2006-03-30T15:57:57+02:00",
    "2006-03-30T15:58:51+02:00",
    "2006-03-30T20:42:05+02:00",
    "2006-03-30T20:57:26+02:00",
    "2006-03-31T00:31:10+02:00",
    "2006-04-13T01:04:02+02:00",
    "2006-05-16T01:29:42+02:00",
    "2006-05-17T17:37:14+02:00",
    "2006-05-17T17:51:46+02:00",
    "2006-05-17T19:36:43+02:00",
    "2006-05-17T19:59:13+02:00",
    "2006-05-17T20:44:41+02:00",
    "2006-05-18T00:45:55+02:00",
    "2006-05-18T15:56:56+02:00",
    "2006-05-18T19:12:56+02:00",
    "2006-05-18T19:40:10+02:00",
    "2006-05-18T19:41:06+02:00",
    "2006-05-18T20:46:09+02:00",
    "2006-05-19T16:30:54+02:00",
    "2006-05-19T17:46:03+02:00",
    "2006-05-19T20:00:00+02:00",
    "2006-05-23T01:42:28+02:00",
    "2006-05-23T23:07:23+02:00",
    "2006-05-23T23:29:40+02:00",
    "2006-05-24T00:05:47+02:00",
    "2006-05-24T00:10:27+02:00",
    "2006-05-24T00:20:33+02:00",
    "2006-05-24T15:44:16+02:00",
    "2006-05-24T22:35:48+02:00",
    "2006-05-24T23:54:48+02:00",
    "2006-05-25T00:13:15+02:00",
    "2006-05-25T16:23:19+02:00",
    "2006-05-30T23:16:19+02:00",
    "2006-05-30T23:21:57+02:00",
    "2006-05-30T23:33:45+02:00",
    "2006-05-31T00:29:28+02:00",
    "2006-05-31T16:08:23+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.mylar.internal.bugzilla.ui.wizard.AbstractBugzillaWizardPage.setPlatformOptions",
          "source": "AbstractBugzillaWizardPage.java:738"
        },
        {
          "method": "org.eclipse.mylar.internal.bugzilla.ui.wizard.AbstractBugzillaWizardPage.createControl",
          "source": "AbstractBugzillaWizardPage.java:381"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.updateForPage",
          "source": "WizardDialog.java:1023"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.access$2",
          "source": "WizardDialog.java:1016"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog$4.run",
          "source": "WizardDialog.java:1006"
        },
        {
          "method": "org.eclipse.swt.custom.BusyIndicator.showWhile",
          "source": "BusyIndicator.java:69"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.showPage",
          "source": "WizardDialog.java:1004"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.nextPressed",
          "source": "WizardDialog.java:743"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.buttonPressed",
          "source": "WizardDialog.java:345"
        },
        {
          "method": "org.eclipse.jface.dialogs.Dialog$3.widgetSelected",
          "source": "Dialog.java:645"
        },
        {
          "method": "org.eclipse.swt.widgets.TypedListener.handleEvent",
          "source": "TypedListener.java:90"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:925"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3287"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2907"
        },
        {
          "method": "org.eclipse.jface.window.Window.runEventLoop",
          "source": "Window.java:811"
        },
        {
          "method": "org.eclipse.jface.window.Window.open",
          "source": "Window.java:789"
        },
        {
          "method": "org.eclipse.mylar.internal.tasklist.ui.actions.NewRepositoryTaskAction.run",
          "source": "NewRepositoryTaskAction.java:67"
        },
        {
          "method": "org.eclipse.mylar.internal.tasklist.ui.actions.NewRepositoryTaskAction.run",
          "source": "NewRepositoryTaskAction.java:79"
        },
        {
          "method": "org.eclipse.ui.internal.PluginAction.runWithEvent",
          "source": "PluginAction.java:251"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection",
          "source": "ActionContributionItem.java:530"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.access$2",
          "source": "ActionContributionItem.java:480"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem$5.handleEvent",
          "source": "ActionContributionItem.java:392"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:925"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3287"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2907"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runEventLoop",
          "source": "Workbench.java:1899"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runUI",
          "source": "Workbench.java:1863"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.createAndRunWorkbench",
          "source": "Workbench.java:417"
        },
        {
          "method": "org.eclipse.ui.PlatformUI.createAndRunWorkbench",
          "source": "PlatformUI.java:143"
        },
        {
          "method": "org.eclipse.ui.internal.ide.IDEApplication.run",
          "source": "IDEApplication.java:106"
        },
        {
          "method": "org.eclipse.core.internal.runtime.PlatformActivator$1.run",
          "source": "PlatformActivator.java:99"
        },
        {
          "method": "org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.runApplication",
          "source": "EclipseAppLauncher.java:92"
        },
        {
          "method": "org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.start",
          "source": "EclipseAppLauncher.java:68"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:374"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:169"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "Unknown Source"
        },
        {
          "method": "sun.reflect.DelegatingMethodAccessorImpl.invoke",
          "source": "Unknown Source"
        },
        {
          "method": "java.lang.reflect.Method.invoke",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.core.launcher.Main.invokeFramework",
          "source": "Main.java:338"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:282"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:977"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:952"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "133196",
      "date": "2006-03-24T19:10:51+01:00",
      "product": "Mylyn",
      "component": "Bugzilla",
      "severity": "normal"
    },
    {
      "exceptionType": "java.lang.AbstractMethodError",
      "message": "org.eclipse.mylar.provisional.tasklist.AbstractRepositoryConnector.getChangedSinceLastSync(Lorg/eclipse/mylar/provisional/tasklist/TaskRepository;Ljava/util/Set;Ljava/util/Date;)Ljava/util/List;",
      "elements": [
        {
          "method": "org.eclipse.mylar.provisional.tasklist.SynchronizeQueryJob.run",
          "source": "SynchronizeQueryJob.java:84"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 1,
      "commentIndex": 35,
      "bugId": "133196",
      "date": "2006-05-23T23:07:23+02:00",
      "product": "Mylyn",
      "component": "Bugzilla",
      "severity": "normal"
    }
  ],
  "groupId": "133196",
  "bugId": "133196",
  "date": "2006-03-24T19:10:51+01:00",
  "product": "Mylyn",
  "component": "Bugzilla",
  "severity": "normal"
}