{
  "comments": [
    "All the projects in my company have the JSP files in the root directory of the project. \n\n  I tried to change the defaut \"WebContent\" directory to \"\", \"/\", \".\", \"project-directory\", \"/projectdirectory\", \"/full/path/to/project/directory\" (obviously, without the quotes).\n\n  Nothing works. For example if I try to create project \"test\" and set the \"Content Directory\" to \".\", I get this error: \"Failed while installing Dynamic Web Module 2.4.; Path must include project and resource name: /test\".",
    "Sounds like a limitation. Why do you want to use the root as the Web content directory? In general it will contain development time artifacts that shouldn\u0027t be published as part of the Web application, e.g. .project, .classpath, etc.\n\nMoving this to wst.common.",
    "I want to use the root, because the development directory layout will match the deployment directory layout. This way, I can use only one directory for both development and deployment. \n\nEven better, the application server I use (Caucho Resin), reloads any changed classes and JSPs automatically, so I just have to save the files to \"deploy\" them to the test server.\n\nI don\u0027t want to introduce an additional directory as the project root and move all existing files and directories to this new directory, because the sources are stored on CVS, and this means I will lose change history for the 15 applications that used this type of directory structure for over 4 years.",
    "Neeraj, can you try out some of these scenarios?   The user might end up getting more published than intended  (project metadata files) because we don\u0027t support filters yet.   But we would need to see how a nested java source folder is handled.  We need to at least list these restrictions",
    "Can this for sure get addressed in RC3?  It\u0027s been pushed back 3 times.",
    "WebContent as   root is not supported,  i tried modifying .component to have \n \u003cwb-resource source-path\u003d\"/\" deploy-path\u003d\"/\"/\u003e,\n\nthe tooling for e.g.  creating  a servlet, doesn\u0027t write to the  deployment descriptor, and deployment doesn\u0027t work.\n\nTargeting to 2.0 since the  support will require major rewrite.\n\n",
    "Renaming WebContent (or other mapped directories like EarContent) will now (as of WTP 2.0) update the component file mapping - so, things like renaming it to \"project-directory\", \"/projectdirectory\", \"/full/path/to/project/directory\" should work.\n\nLowering priority to support just use of root dir.",
    "We have 42 web applications configured as simple Java projects in Eclise 3.2. For all of them, JSPs and static web files are located in a directory \"/Web\" in the root of the project. Likewise, the WEB-INF directory is located in the project root. This arrangement is reflected in ant scripts, the Subversion repository and all developer machines. Local execution/debug of apps is done using a sysdeo plug-in and Tomcat. \nNow we\u0027re trying to migrate all projects to Eclipse 3.3 WTP to use the Web Page Editor, faces-config editor, server management and other WTP features. Half of the web developers use JDeveloper for its JSF support but would rather use Eclipse 3.3 WTP.\n\nThe problem we\u0027re facing is that we can\u0027t set the content directory to be the root of the project, as it is in the configuration of our 42 apps. The root of the project as the Web content directory should be permitted for at least two reasons: (a) in a war file, WEB-INF is located in the root, not inside a WebContent (or other) directory; (b) to provide a more flexible solution that would allow smoother migration of projects like ours. :^)\n\nRob, I didn\u0027t quite understand your comment. I tried \"/full/path/to/project/directory\" in the wizard dialog box where I set the content directory. It created that full path under the project root. \nDo I need to change \u003cwb-resource\u003e inside .settings/org.eclipse.wst.common.component? Shall I change attributes deploy-path and/or source-path of \u003cwb-resource\u003e? \n(I\u0027m using Eclipse WTP build M20071023-1652.)\n\nThanks,\nPaulo Merson\n",
    "My comment was meant to indicate that you can rename/move the \"WebContent\" directory to some other child folder and the mapping in the component file will be automatically updated.\n\nSome clarification on root mapping support:\n\n-You certainly can map the root of your web project to the root of your WAR by manually editing the .settings/org.eclipse.wst.common.component file as follows:\n\n\u003cwb-resource deploy-path\u003d\"/\" source-path\u003d\"/\"/\u003e\n\nand, if you copy everything that had been in \"WebContent\" directly under the project root, it will all be deployed as expected to Tomcat.\n\n-HOWEVER, *everything* in the web project will be mapped into the root of the deployed WAR (the .settings directory, build/classes, src)\n\n-What WTP really needs here is good exclusion filter support for the wb-resource mappings (I think there are some enhancements out there on this already...)\n\n-You can hack around the build/classes duplication by using WEB-INF/classes as the Java output dir and you might be willing to tolerate the other content, however, I would recommend making the switch to a nested WebContent design pattern.\n\nHope this helps.",
    "Rob, I changed org.eclipse.wst.common.component as you suggested.\nIt now has the following two wb-resource entries (I only changed the first one):\n\u003cwb-resource deploy-path\u003d\"/\" source-path\u003d\"/\"/\u003e\n\u003cwb-resource deploy-path\u003d\"/WEB-INF/classes\" source-path\u003d\"/src\"/\u003e\n\nThe web page editor works for JSP/JSF files. \nHowever, when I try to open WEB-INF/faces-config.xml for my project called \"Patrimonio\" using the faces-config editor, I get the following error (here\u0027s the stack trace on .log): \n\n!MESSAGE An internal error occurred during: \"\"Loading faces-config model\"\".\n!STACK 0\njava.lang.IllegalArgumentException: Path must include project and resource name: /Patrimonio\n\tat org.eclipse.core.runtime.Assert.isLegal(Assert.java:62)\n\tat org.eclipse.core.internal.resources.Workspace.newResource(Workspace.java:1625)\n\tat org.eclipse.core.internal.resources.Container.getFolder(Container.java:137)\n\tat org.eclipse.jst.jsf.common.ui.internal.utils.WebrootUtil.getWebContentFolder(WebrootUtil.java:110)\n\tat org.eclipse.jst.jsf.facesconfig.ui.ModelLoader$ModelLoaderJob.loadModel(ModelLoader.java:163)\n\tat org.eclipse.jst.jsf.facesconfig.ui.ModelLoader$ModelLoaderJob.run(ModelLoader.java:122)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:55)\n \nAny ideas?\n",
    "Not sure... there may be some assumptions may by the JSF code \"org.eclipse.jst.jsf.common.ui.internal.utils.WebrootUtil.getWebContentFolder(WebrootUtil.java:110)\" and one of the JSF guys may be able to provide further clarification (I\u0027m not directly familiar with that logic)."
  ],
  "commentCreationDates": [
    "2006-04-04T08:30:04+02:00",
    "2006-04-07T20:18:43+02:00",
    "2006-04-10T12:20:56+02:00",
    "2006-04-20T16:42:57+02:00",
    "2006-05-09T04:27:44+02:00",
    "2006-05-09T16:59:00+02:00",
    "2007-08-30T20:22:39+02:00",
    "2007-11-21T13:40:44+01:00",
    "2007-11-21T14:44:30+01:00",
    "2007-11-22T12:18:31+01:00",
    "2007-11-23T18:09:21+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.IllegalArgumentException",
      "message": "Path must include project and resource name: /Patrimonio",
      "elements": [
        {
          "method": "org.eclipse.core.runtime.Assert.isLegal",
          "source": "Assert.java:62"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.newResource",
          "source": "Workspace.java:1625"
        },
        {
          "method": "org.eclipse.core.internal.resources.Container.getFolder",
          "source": "Container.java:137"
        },
        {
          "method": "org.eclipse.jst.jsf.common.ui.internal.utils.WebrootUtil.getWebContentFolder",
          "source": "WebrootUtil.java:110"
        },
        {
          "method": "org.eclipse.jst.jsf.facesconfig.ui.ModelLoader$ModelLoaderJob.loadModel",
          "source": "ModelLoader.java:163"
        },
        {
          "method": "org.eclipse.jst.jsf.facesconfig.ui.ModelLoader$ModelLoaderJob.run",
          "source": "ModelLoader.java:122"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:55"
        }
      ],
      "number": 0,
      "commentIndex": 9,
      "bugId": "134668",
      "date": "2007-11-22T12:18:31+01:00",
      "product": "Web Tools",
      "component": "wst.common",
      "severity": "normal"
    }
  ],
  "groupId": "134668",
  "bugId": "134668",
  "date": "2006-04-04T08:30:04+02:00",
  "product": "Web Tools",
  "component": "wst.common",
  "severity": "normal"
}