{
  "comments": [
    "Allow to create new issues from PDE Errors view would make easier to report issues about plugins. Mylar can use exception and error details to query repository for similar issues and populate issue details when nothing is found.\n\nBTW, Subversive plugin has interesting feature of similar nature. Once logged error has reference to subversive packages it is offering to send an email with error details to the plugin vendor.",
    "*** Bug 120430 has been marked as a duplicate of this bug. ***",
    "Yes, we\u0027ve wanted to do this for a some time now, and it will be very straightforward.\n\nI also wonder if we should have the bugs.eclipse.org repository added by default (or make it one-click to add) to enable easier submission of Eclipse and Mylar bugs.",
    "I think that the one click add is a great idea since that is one of the first repositories that i normally add.  It will need to include getting the user name and password from the user though since this is required to submit a bug",
    "(In reply to comment #2)\n\u003e I also wonder if we should have the bugs.eclipse.org repository added by\n\u003e default (or make it one-click to add) to enable easier submission of Eclipse\n\u003e and Mylar bugs.\n\nI think this would make sense.\n\nAs of specifying user and password Mylar should bring up a user/passwrd dialog when trying to access repository with no credential. That would be similar to what CVS/SVN plugins do.\n",
    "As part of this, we should also optionally allow the last n events of the interaction history to be submitted as an attachment, since this kind of thing can be a huge help with debugging (note Eugene\u0027s comment on bug 138756).  We can use the usual SHA-based obfuscation to ensure privacy.",
    "Jeff, here is another interesting one for your list.",
    "Any progress on this one?",
    "I\u0027ve done some experimenting with the contribution to the error log view, but I was having trouble detecting which element was selected when the action was invoked (with the ViewerContribution). I wasn\u0027t able to get an ObjectContribution to register the option in the context menu. I\u0027ll look at it again, once I have the UI issue worked out the rest should be pretty simple to put together.",
    "Check out how OpenWithBrowserAction extends BaseSelectionListenerAction and see if that approach works, since that prevents needing to get at the viewer to get the selection.  Let me know if it doesn\u0027t.",
    "Mik, the BaseSelectionListener didn\u0027t work for me since it needs to implement IViewActionDelegate (or ObjectDelegate) to be registered with another plug-in\u0027s view. However I did find a way to register a listener with the Log view when the action is initialized.\n\nThe bad news is that the object which is selected in the Log is an internal class \u0027org.eclipse.pde.internal.runtime.logview.LogEntry\u0027. The only way we can implement this feature is to use the internal class AFAIK.",
    "Why don\u0027t you make an objectContribution (e.g. refer to mylar.tasklist\u0027s) for LogEntry?  That will get you the selection for free.  It\u0027s OK for now that this is an internal class, but we should consider asking Platform/PDE to make that class (or a new interface) API before marking this report resolved.",
    "I can\u0027t get an objectContribution to show up in the Error Logs context menu, perhaps I\u0027m doing something wrong. The same action shows up with a viewerContribution to the LogView. I\u0027ve tried with and without the menubar path as well.\n\n\n\u003cobjectContribution\n\t    id\u003d\"org.eclipse.mylar.tasklist.ui.objectContribution\"\n            objectClass\u003d\"org.eclipse.pde.internal.runtime.logview.LogEntry\"\u003e\n      \t\u003caction\n\t        class\u003d\"org.eclipse.mylar.internal.tasklist.ui.actions.NewTaskFromErrorAction\"\n\t        enablesFor\u003d\"*\"\n\t        icon\u003d\"icons/etool16/task-repository-new.gif\"\n\t        id\u003d\"org.eclipse.mylar.tasklist.actions.newTaskFromErrorLog\"\n\t        label\u003d\"New Repository Task\"\n\t        menubarPath\u003d\"org.eclipse.pde.runtime.LogView\"\n\t        tooltip\u003d\"New Repository Task\"/\u003e\n      \u003c/objectContribution\u003e",
    "It is possible that the view is not accepting objectContributions, but that would be lame and warrant another bug report to Platform/PDE.  How are they adding their own popup contributions, via code?",
    "Whichever way you get it going is fine, and if I can think of a simpler way of doing it I\u0027ll comment when reviewing.  Fyi we have a mechanism for registering part activations in Mylar, but try to avoid having to use the if possible, if not ask and I\u0027ll point you at it.",
    "What should the auto-gen comment look like? Point form data or something more like natural language. Here\u0027s the info I have access to: Date, message, severity, plugin-id, and stack trace. \n\nWe could list point form info, or have a template like \"Error in plugin \u003cplugin-id\u003e on \u003cdate\u003e with severity level \u003cseverity\u003e: \u003cmessage\u003e\" etc....\n\nexample info....\nDATE:      Thu Jul 06 17:48:15 EDT 2006\nMESSAGE:   java.lang.NullPointerException\nSEVERITRY: Error\nPLUGIN ID: org.eclipse.ui\nSTACK TRACE:\njava.lang.NullPointerException\nat org.eclipse.mylar.internal.tasklist.ui.actions.NewTaskFromErrorAction.run(NewTaskFromErrorAction.java:35)\nat org.eclipse.mylar.internal.tasklist.ui.actions.NewTaskFromErrorAction.run(NewTaskFromErrorAction.java:67)\nat org.eclipse.ui.internal.PluginAction.runWithEvent(PluginAction.java:254)",
    "In addition to the above it would be really neat to optionally add some info about recent Eclipse activities captured by Mylar\u0027s monitor.",
    "Ed, that sounds like a good idea. Maybe we could auto-select the (soon to come) \"attach context\" option in the new bug editor. (bug 148903)",
    "(In reply to comment #17)\n\u003e Ed, that sounds like a good idea. \n\nIts Eugene actually. :-)",
    "(In reply to comment #18)\n\u003e (In reply to comment #17)\n\u003e \u003e Ed, that sounds like a good idea. \n\u003e \n\u003e Its Eugene actually. :-)\n\u003e \n\noops! Sorry bout that, there used to be an \"Ed\" that I chatted with on bug reports. Old habits die hard I guess... :)",
    "Jeff, regarding the context stuff, that would be a very cool feature that I\u0027ve documented some more on bug 150185.  We would need to start distributing the Mylar Monitor for it to work, so it\u0027s definitely post 0.6.1.  But it would be great if you could get both this and bug 143567 into 0.6.1 since these features really leverage our Eclipse integration.\n\nRegarding comment#15, let\u0027s keep this really simple and similar to the Error Log formatting, and I think your proposal is pretty much there.  \n  - \u003ctype\u003e: \"\u003cmessage\u003e\" in \u003cplug-in\u003e\n  - Error: \"No route to host: connect\" in org.eclipse.mylar.core\n\nThen for the Description remove the all caps and keep what you have.  But put a \"\\n-- Error Log --\" on top of it to indicate that it is automatic and to encourage people to add a note above that.",
    "Btw, when you\u0027re done with this I\u0027ll implement bug 150278 so that the user does not need to go through \"Select Product\" page as part of this wizard.",
    "I should have a patch up for this sometime today.",
    "Created an attachment (id\u003d46099)\nCreate task from error log\n\nAllows creation of new tasks from the error log entries. Includes a test case for testing access to newly created task editors.\n",
    "Created an attachment (id\u003d46101)\nmylar/context/zip\n\n",
    "Very nice Jeff, patch applied.  I noticed the following failure which you should, I think that clearing the error log caused it.  Once that\u0027s fixed I think that this task is done?  \n\njava.lang.ArrayIndexOutOfBoundsException: 0\n\tat org.eclipse.mylar.internal.tasklist.ui.actions.NewTaskFromErrorAction.selectionChanged(NewTaskFromErrorAction.java:99)\n\tat org.eclipse.jface.viewers.Viewer$2.run(Viewer.java:162)\n\tat org.eclipse.core.runtime.SafeRunner.run(SafeRunner.java:37)\n\tat org.eclipse.core.runtime.Platform.run(Platform.java:843)\n\tat org.eclipse.ui.internal.JFaceUtil$1.run(JFaceUtil.java:44)\n\tat org.eclipse.jface.util.SafeRunnable.run(SafeRunnable.java:149)\n\tat org.eclipse.jface.viewers.Viewer.fireSelectionChanged(Viewer.java:160)",
    "Created an attachment (id\u003d46146)\nFix for comment 25\n\nThis should fix the error your seeing.",
    "Done.  ",
    "Created an attachment (id\u003d46222)\nexample of the hierarchical log\n\nI think that log events for the children issues should be included to the report.",
    "Please file that as a new enhancement request.  One thing to watch out for is overpopulating the description of the bug--I\u0027ve seen an error can contain dozens of nested ones.",
    "(In reply to comment #29)\n\u003e Please file that as a new enhancement request.  One thing to watch out for is\n\u003e overpopulating the description of the bug--I\u0027ve seen an error can contain\n\u003e dozens of nested ones.\n\nI wonder if .log should be added as an attachment. Error Log view actually allows to import log file and see its structure (nested events, etc). Though navigation trough stack traces is really lousy there...",
    "Since NewTaskFromErrorAction depends on org.eclipse.pde.runtime, I moved it into mylar.ide.  Having it in mylar.tasks.ui prevents the Task List from installing in an Eclipse configuration that does not include PDE (e.g. the Callisto Platfrom runtime or an RCP app)."
  ],
  "commentCreationDates": [
    "2006-04-07T19:03:41+02:00",
    "2006-04-07T19:29:34+02:00",
    "2006-04-07T19:32:48+02:00",
    "2006-04-07T19:50:11+02:00",
    "2006-04-07T19:59:07+02:00",
    "2006-04-28T04:02:47+02:00",
    "2006-06-13T18:44:42+02:00",
    "2006-07-06T04:26:21+02:00",
    "2006-07-06T06:34:21+02:00",
    "2006-07-06T18:49:45+02:00",
    "2006-07-06T21:47:13+02:00",
    "2006-07-06T21:58:13+02:00",
    "2006-07-06T22:24:05+02:00",
    "2006-07-06T22:35:14+02:00",
    "2006-07-06T22:47:57+02:00",
    "2006-07-10T18:25:33+02:00",
    "2006-07-10T18:33:07+02:00",
    "2006-07-10T18:41:44+02:00",
    "2006-07-10T18:44:41+02:00",
    "2006-07-10T18:50:35+02:00",
    "2006-07-10T20:12:33+02:00",
    "2006-07-11T18:13:31+02:00",
    "2006-07-11T18:19:09+02:00",
    "2006-07-11T21:22:20+02:00",
    "2006-07-11T21:22:43+02:00",
    "2006-07-12T03:39:17+02:00",
    "2006-07-12T04:26:49+02:00",
    "2006-07-12T18:33:39+02:00",
    "2006-07-13T05:35:03+02:00",
    "2006-07-13T19:10:18+02:00",
    "2006-07-13T20:59:38+02:00",
    "2006-08-01T08:02:09+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.mylar.internal.tasklist.ui.actions.NewTaskFromErrorAction.run",
          "source": "NewTaskFromErrorAction.java:35"
        },
        {
          "method": "org.eclipse.mylar.internal.tasklist.ui.actions.NewTaskFromErrorAction.run",
          "source": "NewTaskFromErrorAction.java:67"
        },
        {
          "method": "org.eclipse.ui.internal.PluginAction.runWithEvent",
          "source": "PluginAction.java:254"
        }
      ],
      "number": 0,
      "commentIndex": 15,
      "bugId": "135605",
      "date": "2006-07-10T18:25:33+02:00",
      "product": "Mylyn",
      "component": "Tasks",
      "severity": "enhancement"
    },
    {
      "exceptionType": "java.lang.ArrayIndexOutOfBoundsException",
      "message": "0",
      "elements": [
        {
          "method": "org.eclipse.mylar.internal.tasklist.ui.actions.NewTaskFromErrorAction.selectionChanged",
          "source": "NewTaskFromErrorAction.java:99"
        },
        {
          "method": "org.eclipse.jface.viewers.Viewer$2.run",
          "source": "Viewer.java:162"
        },
        {
          "method": "org.eclipse.core.runtime.SafeRunner.run",
          "source": "SafeRunner.java:37"
        },
        {
          "method": "org.eclipse.core.runtime.Platform.run",
          "source": "Platform.java:843"
        },
        {
          "method": "org.eclipse.ui.internal.JFaceUtil$1.run",
          "source": "JFaceUtil.java:44"
        },
        {
          "method": "org.eclipse.jface.util.SafeRunnable.run",
          "source": "SafeRunnable.java:149"
        },
        {
          "method": "org.eclipse.jface.viewers.Viewer.fireSelectionChanged",
          "source": "Viewer.java:160"
        }
      ],
      "number": 1,
      "commentIndex": 25,
      "bugId": "135605",
      "date": "2006-07-12T03:39:17+02:00",
      "product": "Mylyn",
      "component": "Tasks",
      "severity": "enhancement"
    }
  ],
  "groupId": "135605",
  "bugId": "135605",
  "date": "2006-04-07T19:03:41+02:00",
  "product": "Mylyn",
  "component": "Tasks",
  "severity": "enhancement"
}