{
  "comments": [
    "I am using the DTP 0.9 RC1 4/27 build and the specified prereqs of eclipse 3.2M6, EMF 2.2.0M6 and GEF 3.2M6.  I have no other plugins installed.\n\nHere are the simplest steps I have found to reproduce this error: \n1. Start eclipse with a clean workspace\n2. Open the Database Development Perspective\n3. Open a new window : Window -\u003e New Window\n4. Close the new window and look in the Error Log. You\u0027ll see this exception:\norg.eclipse.swt.SWTException: Graphic is disposed\nat org.eclipse.swt.SWT.error(SWT.java:3374)\nat org.eclipse.swt.SWT.error(SWT.java:3297)\nat org.eclipse.swt.SWT.error(SWT.java:3268)\nat org.eclipse.swt.graphics.Image.getBounds(Image.java:1204)\nat org.eclipse.swt.custom.CTabItem.drawSelected(CTabItem.java:359)\nat org.eclipse.swt.custom.CTabItem.onPaint(CTabItem.java:586)\nat org.eclipse.swt.custom.CTabFolder.drawTabArea(CTabFolder.java:1070)\nat org.eclipse.swt.custom.CTabFolder.onPaint(CTabFolder.java:2215)\nat org.eclipse.swt.custom.CTabFolder$1.handleEvent(CTabFolder.java:293)\nat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\n...\n\n4. The Data Source Explorer view is now locked up and more exceptions go to the error log if you try to select that view.  The workaround is to restart eclipse.  Seems that closing the Database Development perspective (takes 2 tries) and reopening it is another workaround.",
    "verify in 3.2RC2.",
    "Can duplicate in the latest 3.2 RC2 builds for platform, EMF, GEF, and DTP. Seems to be an issue with the perspective possibly disposing of a graphic when the perspective is closed in the 2nd window and the first window is still looking for it. But haven\u0027t been able to narrow it down yet.\n\nHave posted a message to the Eclipse platform newsgroup to see if anyone else has had similar issues with their views/perspectives in 3.2.",
    "I did a little debugging.  I\u0027m not positive on a solution, but I can at least explain what I am seeing.  Maybe yourself or a platform UI person will have a solution. \n\nThe Data Source Explorer\u0027s title image is being disposed when the second window is closed. This is because the DataSourceExplorerView has dispose() called on it twice when the window is closed.  In WorkbenchPart.dispose() this is called:  JFaceResources.getResources().destroyImage(imageDescriptor);.  Since this method is being called twice, the 2 counts of the data source explorer title image(1 for each window) are used up so the image is actually destroyed.  Now when we try to display the original window, the image is disposed and that is why the exception occurs.\n\nThe CommonNavigator has a disposeListener that calls dispose() once and the Perspective also calls dispose().  It seems to me that this is actually a platform UI bug.",
    "It seems the fix would be just to remove the disposeListener that is added in CommonNavigator.  This is already handled when the perspective is closed or when just the view is closed.  dispose() is getting called twice when the view is closed as well",
    "I sent some e-mail today to a member of the Platform navigator team to see what we can do about this issue. ",
    "\nI\u0027ll take a look at this. From the details, it looks like it could very well be a problem with the default view part implementation provided with the Common Navigator framework. \n\nIs this a stop ship issue for Callisto?",
    "Michael, it\u0027s a unique use case and would be great if we could get it \nfixed for Callisto. But if there are other, more critical bugs on your navigator plate, it\u0027s probably a lower priority.\n",
    "At this point, the Platform level will only produce RC builds in support of Callisto, and only for stop ship or critical defects. The approval requires the support of at least three component leads. With the log message, does the workbench lock up or become unusable? ",
    "It sounds like it\u0027s worth investigating at least.",
    "You have to reset the perspective twice or shut down and restart the workbench.\nSo yes, I would say it puts it in an unusable state.",
    "One interesting tidbit of information. If I override the dispose method in my view class that extends CommonNavigator and don\u0027t call super.dispose(), I don\u0027t get the bizarre behavior. The bad part about this workaround is that we don\u0027t dispose the resources properly for the view in this instance. The good news is that there\u0027s a workaround. Should I let it go at that for now?",
    "The dispose listener added to the CommonViewer (treeviewer) from the CommonNavigator (view part) is the root of the problem. It was attached in order to listen for cases where the common viewer might be disposed ahead of the view part; and this snippet was left over from the version in WTP. It should be safe to remove it, since the dispose() call is properly invoked on the view part as it is closed, and the CommonViewer is disposed as the SWT widgets dispose() their children. \n\nI think this is an acceptable bug and fix for the Callisto RC builds.",
    "Created an attachment (id\u003d41546)\nRemoves the dispose listener from the CommonViewer.\n\n",
    "I\u0027m all for removing code, as long as we\u0027re certain that there is no possibility of this introducing a leak.",
    "Thanks Michael! When will the next RC become available with this patch?",
    "\nI\u0027ve confirmed that in the single window and double window case that dispose() for the CommonNavigator view part and CommonViewer treeviewer (which disposes the content service) are both called. This is all that is required to prevent leaks in the framework. \n\nWith that said, I feel that this issue is ready for a vote. ",
    "+1",
    "Martin and Michael -- could you review the patch for release to RC6? (I don\u0027t think it will make it into RC5, unless Platform/UI requests a rebuild for it). ",
    "Patch looks good. +1",
    "Tod or Martin -- can you review for release for 3.2RC6?",
    "+1",
    "+1 from me too",
    "With approvals from Mike, Martin, and Tod, I will release this patch today.",
    "\nMichael, has this been fixed/committed??\n",
    "It has indeed. Released 05/24/06."
  ],
  "commentCreationDates": [
    "2006-05-02T21:42:53+02:00",
    "2006-05-04T00:24:54+02:00",
    "2006-05-05T19:50:51+02:00",
    "2006-05-05T21:38:04+02:00",
    "2006-05-05T21:46:03+02:00",
    "2006-05-12T17:58:27+02:00",
    "2006-05-15T05:18:06+02:00",
    "2006-05-15T15:59:13+02:00",
    "2006-05-15T16:09:48+02:00",
    "2006-05-15T16:44:49+02:00",
    "2006-05-15T16:46:00+02:00",
    "2006-05-15T20:24:04+02:00",
    "2006-05-16T04:46:19+02:00",
    "2006-05-16T04:47:28+02:00",
    "2006-05-16T13:31:46+02:00",
    "2006-05-16T16:05:34+02:00",
    "2006-05-16T16:34:03+02:00",
    "2006-05-16T16:58:34+02:00",
    "2006-05-19T17:34:13+02:00",
    "2006-05-19T17:43:50+02:00",
    "2006-05-23T16:13:03+02:00",
    "2006-05-23T16:38:31+02:00",
    "2006-05-23T17:04:27+02:00",
    "2006-05-23T17:07:16+02:00",
    "2006-05-25T21:40:22+02:00",
    "2006-05-25T21:43:45+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.swt.SWTException",
      "message": "Graphic is disposed",
      "elements": [
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:3374"
        },
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:3297"
        },
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:3268"
        },
        {
          "method": "org.eclipse.swt.graphics.Image.getBounds",
          "source": "Image.java:1204"
        },
        {
          "method": "org.eclipse.swt.custom.CTabItem.drawSelected",
          "source": "CTabItem.java:359"
        },
        {
          "method": "org.eclipse.swt.custom.CTabItem.onPaint",
          "source": "CTabItem.java:586"
        },
        {
          "method": "org.eclipse.swt.custom.CTabFolder.drawTabArea",
          "source": "CTabFolder.java:1070"
        },
        {
          "method": "org.eclipse.swt.custom.CTabFolder.onPaint",
          "source": "CTabFolder.java:2215"
        },
        {
          "method": "org.eclipse.swt.custom.CTabFolder$1.handleEvent",
          "source": "CTabFolder.java:293"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "139814",
      "date": "2006-05-02T21:42:53+02:00",
      "product": "Platform",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "139814",
  "bugId": "139814",
  "date": "2006-05-02T21:42:53+02:00",
  "product": "Platform",
  "component": "UI",
  "severity": "normal"
}