{
  "comments": [
    "basic driver load and ping always work for any db ( db2, mysql, oracle) in 0.9. connections connect but never actually retrieve any data object list from any schema. ALL my other db tools ( my own, IBM\u0027s, Squirrel etc ) can always access the data objects etc on ALL databases correctly so it isn\u0027t a property configuration problem for any of the drivers.\n\ndownloaded the latest night build on dtp 0.9.rc3 but the install always hangs.\nThe tool isn\u0027t reliable but, unfortunately, everything else in eclipse is now using this tool. the find and install new features finds the latest dtp rc3 release in the local repository (like other plugins but can\u0027t load this one).\n\ngiven the problems with dtp connections, it\u0027s use everywhere (unfortunately) and the inability to update it, do I have to drop Eclipse? you can\u0027t uninstall it from the callisto release because everything uses it....\n\nhere\u0027s the detail error log .....\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n!ENTRY org.eclipse.datatools.connectivity 4 -1 2006-05-03 05:58:54.583\n!MESSAGE Error creating JDBC Connection connection to mysql_sample. (Error: Connection failed with unspecified error.)\n!STACK 0\njava.lang.Exception: Connection failed with unspecified error.\n\tat org.eclipse.datatools.connectivity.DriverConnectionBase.internalCreateConnection(DriverConnectionBase.java:108)\n\tat org.eclipse.datatools.connectivity.DriverConnectionBase.open(DriverConnectionBase.java:53)\n\tat org.eclipse.datatools.connectivity.db.generic.JDBCConnection.\u003cinit\u003e(JDBCConnection.java:47)\n\tat org.eclipse.datatools.connectivity.db.generic.JDBCConnectionFactory.createConnection(JDBCConnectionFactory.java:51)\n\nsame thing for db2 and oracle ...\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nhere\u0027s the upgrade errors in Eclipse callisto RC1 for DTP ONLY ( all other modules DO work on upgrade from local repository )...\n\n\nBootLoader constants: OS\u003dwin32, ARCH\u003dx86, WS\u003dwin32, NL\u003den_US\nCommand-line arguments:  -os win32 -ws win32 -arch x86 -clean\n\n!ENTRY org.eclipse.update.configurator 2006-05-04 10:47:45.435\n!MESSAGE Could not install bundle plugins/org.eclipse.datatools.connectivity.dbdefinition.mysql_0.7.0.200602241/   Bundle \"org.eclipse.datatools.connectivity.dbdefinition.mysql\" version \"0.7.0.200602241\" has already been installed from: update@plugins/org.eclipse.datatools.connectivity.dbdefinition.genericJDBC_0.7.0.200602241/\n\n!ENTRY org.eclipse.update.configurator 2006-05-04 10:47:45.495\n!MESSAGE Could not install bundle plugins/org.eclipse.datatools.connectivity.sqm.server.ui_0.7.0.200603081/   Bundle \"org.eclipse.datatools.connectivity.sqm.server.ui\" version \"0.7.0.2006003081\" has already been installed from: update@plugins/org.eclipse.datatools.connectivity.sqm.server.ui_0.7.0.2006003081/\n\n!ENTRY org.eclipse.osgi 2 1 2006-05-04 10:48:09.830\n!MESSAGE NLS unused message: BUNDLE in: org.eclipse.hyades.statistical.ui.messages\n\n!ENTRY org.eclipse.osgi 2 1 2006-05-04 10:48:09.840\n!MESSAGE NLS unused message: BUNDLE_LOCATION in: org.eclipse.hyades.statistical.ui.messages\n\n!ENTRY org.eclipse.osgi 2 1 2006-05-04 10:48:09.840\n!MESSAGE NLS unused message: BUNDLE_ID in: org.eclipse.hyades.statistical.ui.messages\n\n!ENTRY org.eclipse.osgi 2 1 2006-05-04 10:48:09.881\n!MESSAGE NLS missing message: UI_CONTROLS_PENDING_NAME in: org.eclipse.hyades.statistical.ui.messages\n\n!ENTRY org.eclipse.osgi 2 1 2006-05-04 10:48:09.881\n!MESSAGE NLS missing message: AGENT_NULL_EXCEPTION in: org.eclipse.hyades.statistical.ui.messages",
    "Jim,\nFar from it -- nothing else in Callisto except DTP uses the particular functionality that you mention. BIRT uses only the ODA components of DTP and some basic connectivity, but it does not touch the JDBC components in DTP. WTP still has its own \"rdb\" components, which are similar, but a different actual components from those in DTP. Other than that, no other eclipse.org project is using this functionality.\n\nThe problems you\u0027re seeing with the generic JDBC connection profile are due to expectations put on those JDBC drivers from the SQL model. Typically you\u0027d need to specialize the SQL model and connection profile framework for these particular cases, which is what we\u0027ve done for our example database -- Apache Derby -- in DTP 0.7 and 0.9. Going forward past 0.9 to 1.0, we\u0027ll be working with various communities to make specialized components built on DTP frameworks available for specific databases, so the situation should improve greatly over time. As an eclipse.org project, we concentrate on \"extensible frameworks and exemplary tools\" (Apache Derby in the present case). DTP 0.9 will have this foundation in place, and then we\u0027ll build out from it, with community support for particular data sources.",
    "For consideration in the \"enablement\" effort.",
    "DTP is used by BIRT. BIRT is used by TPTP. To UNINSTALL DTP requires uninstalling half the release.\n\nIF DTP only supports DERBY today, then I must be pretty dumb. Where is that documented???  Is there any documentation easily available on the DTP site describing what databases are planned for support and when?",
    "Jim,\nYes, you are correct about the DTP--\u003eBIRT--\u003eTPTP chain, but what you\u0027re missing is that DTP is a collection of frameworks and tools. Not all consumers use all of the tools and, as I explained earlier, none use the specific component (generic JDBC connection profile) that you are having a problem with. Actually, I think it the upcomming Callisto RC2, you should be able to just select TPTP (or BIRT) and it will only pull the components from DTP that it needs (again, which does not include the component you\u0027re having problems with). So, I really don\u0027t see the broader issue here -- the fact that DTP needs to add additional support for particular databases is not impacting other projects, since they do not rely on this functionality.\n\nRegarding Apache Derby/other database support -- there\u0027s a number of documents on the DTP:Connectivity site that explain how to connect to Derby and work with it as an example. For the others, we are currently working on a proposal for this type of support, and expect to have something in front of the community in the next couple of weeks. (BTW, that\u0027s why this bug was set to \"remind\", so we can talk about it again at that point.)",
    "For consideration in the \"enablement\" effort.",
    "Jim,\n\nYou might find the \"Getting Started Guide\":\n\nhttp://wiki.eclipse.org/index.php/Getting_Started_with_DTP\n\nand the \"Specialized Database Support\" documents:\n\nhttp://wiki.eclipse.org/index.php/Specialized_Database_Support\n\nhelpful for understanding the current position of DTP and its plans going forward.",
    "Thanks for explaining what\u0027s up with DTP, especially the fact that it only supports Derby today.\n\nIn hindsight, I think the ODA support BIRT used should have been loaded only in Callisto as a BIRT component at this point, not a DTP component. By using Callisto I saw I had DTP installed as a plugin, when it didn\u0027t work, I tried to upgrade to a newer release. Bad idea. That loaded the other stuff from DTP that wasn\u0027t going to work at all. It\u0027s hard to keep straight the fact that the database explorer view is a WTP view. The data source explorer is a DTP view. I was trying to create connections on the DTP stuff for use in WTP apps ....\n\nI\u0027d be interested in how this type of confusion could be eliminated in future Callisto releases... Thanks",
    "People following this bug might be interested in the recently proposed \"Enablement\" project for DTP:\n\nhttp://www.eclipse.org/proposals/enablement/\n\nhttp://dataplat.blogspot.com/2006/05/device-driver-problem.html",
    "DTP 1.5 now supports basic operations with a number of databases. Specific cases that remain unsupported will be handled by individual bug entries for those areas."
  ],
  "commentCreationDates": [
    "2006-05-04T17:01:09+02:00",
    "2006-05-04T17:15:25+02:00",
    "2006-05-04T17:17:25+02:00",
    "2006-05-04T17:30:46+02:00",
    "2006-05-04T17:37:29+02:00",
    "2006-05-04T17:39:24+02:00",
    "2006-05-04T18:11:04+02:00",
    "2006-05-04T19:38:17+02:00",
    "2006-05-26T22:02:56+02:00",
    "2007-09-06T21:52:08+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.Exception",
      "message": "Connection failed with unspecified error.",
      "elements": [
        {
          "method": "org.eclipse.datatools.connectivity.DriverConnectionBase.internalCreateConnection",
          "source": "DriverConnectionBase.java:108"
        },
        {
          "method": "org.eclipse.datatools.connectivity.DriverConnectionBase.open",
          "source": "DriverConnectionBase.java:53"
        },
        {
          "method": "org.eclipse.datatools.connectivity.db.generic.JDBCConnection.\u003cinit\u003e",
          "source": "JDBCConnection.java:47"
        },
        {
          "method": "org.eclipse.datatools.connectivity.db.generic.JDBCConnectionFactory.createConnection",
          "source": "JDBCConnectionFactory.java:51"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "140174",
      "date": "2006-05-04T17:01:09+02:00",
      "product": "Data Tools",
      "component": "Enablement",
      "severity": "critical"
    }
  ],
  "groupId": "140174",
  "bugId": "140174",
  "date": "2006-05-04T17:01:09+02:00",
  "product": "Data Tools",
  "component": "Enablement",
  "severity": "critical"
}