{
  "comments": [
    "If I have an EJB in which both remote and interfaces were defined, and I do a Run on server on the EJB, I am not properly prompted with the dialog to choose between the interfaces to run against. The action simply hangs. This is a regression since it was the case before that the dialog to choose the interface to use comes up in the case where there are more than one home interface defined.\n\nThe exception received in the log is:\n\nException in thread \"Server launch shortcut\" org.eclipse.swt.SWTException: Inval\nid thread access\n        at org.eclipse.swt.SWT.error(SWT.java:2942)\n        at org.eclipse.swt.SWT.error(SWT.java:2865)\n        at org.eclipse.swt.SWT.error(SWT.java:2836)\n        at org.eclipse.swt.widgets.Widget.error(Widget.java:395)\n        at org.eclipse.swt.widgets.Shell.\u003cinit\u003e(Shell.java:246)\n        at org.eclipse.swt.widgets.Shell.\u003cinit\u003e(Shell.java:332)\n        at org.eclipse.jface.window.Window.createShell(Window.java:474)\n        at org.eclipse.jface.window.Window.create(Window.java:417)\n        at org.eclipse.jface.dialogs.Dialog.create(Dialog.java:996)\n        at org.eclipse.jface.window.Window.open(Window.java:776)\n        at org.eclipse.wst.server.ui.internal.actions.RunOnServerActionDelegate$\n1.run(RunOnServerActionDelegate.java:285)",
    "Bug needs some explanation, since this is actually the second behaviour to a problem that I suggested the adopter fix internally. This is going to be a long one, so try to follow closely. ;-)\n\nThe original problem is that Run/Debug on Server gets invoked on the UI thread since it is a user action. The UI is locked while a series of option dialogs is presented (e.g. pick a server, pick which client to run on, etc.) and then one or more chained jobs are started to perform the action.\n\nIf the server hasn\u0027t been initialized (e.g. if the user does Run on Server as one of their first actions after starting WTP) then the server will be initialized during the processing of Run on Server. Initialization is supposed to block until the server state is updated and the class is ready.\n\nIf the external server happens to already be running in debug mode, intialization should include connecting the debugger to the server. During this, JDT launches a number of actions using syncExec() to make sure the debugger UI is in sync.\n\nIf you\u0027ve followed along so far, you\u0027ll realize that we\u0027ve now managed to *hang* WTP, since Run on Server is already on the UI thread!\n\nThere are possible solutions for this on the adopter side, but so far I haven\u0027t been able to come up with any that aren\u0027t hacks and involve more code. The simplest solution, and one which we only have to implement once and not in every server adapter, is just to put Run on Server on a different thread.",
    "Created an attachment (id\u003d41158)\nPatch to put Run on Server on a thread\n\nPatch puts the processing of Run on Server onto a new Thread and avoids SWT issues by calling Display.syncExec() when dialogs are required. This code has already been dropped to the 1.5 stream and tested by the adopter.",
    "+1 for WTP 1.0.3 since this a known fix and a bad problem.",
    "Tim, how long has this been working in 1.5? Is there any additional risk associated with the change in terms of timing or synchronization?\n",
    "+1 for 1.0.3",
    "In response to comment #4 - The change has been in 1.5 for about a week and a half, just got it in for RC2. It passed RC2 smoke tests, the adopter has tested, and I indirectly tested it again while coding bug 129065 for RC3.\n\nThere is very low risk of timing or synchronization issues in this case since it is a single processing stream to determine the server, client (e.g. web browser) and pop up the odd dialog for user confirmation - all the fix is really doing is switching this to another thread so that the UI is not blocked. The actual work of starting the server, publishing, etc. is done by one or more Eclipse jobs that it schedules that already have synchronization rules.",
    "+1 for 1.0.3\n",
    "Fix released to 1.0.3 stream.",
    "The fix for this bug seems to have caused another (Invalid thread access). Within the new thread, there is some UI code being executed that probably needs a Display.syncExec() around it...\n\nThe new bug is here:\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d142631",
    "Closing."
  ],
  "commentCreationDates": [
    "2006-05-11T17:03:27+02:00",
    "2006-05-11T18:48:33+02:00",
    "2006-05-11T18:50:29+02:00",
    "2006-05-11T20:36:25+02:00",
    "2006-05-12T02:08:28+02:00",
    "2006-05-12T09:43:36+02:00",
    "2006-05-12T15:15:57+02:00",
    "2006-05-16T14:44:40+02:00",
    "2006-05-16T20:56:09+02:00",
    "2006-05-22T19:40:17+02:00",
    "2006-06-27T22:58:49+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.swt.SWTException",
      "message": "Inval id thread access",
      "elements": [
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2942"
        },
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2865"
        },
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2836"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.error",
          "source": "Widget.java:395"
        },
        {
          "method": "org.eclipse.swt.widgets.Shell.\u003cinit\u003e",
          "source": "Shell.java:246"
        },
        {
          "method": "org.eclipse.swt.widgets.Shell.\u003cinit\u003e",
          "source": "Shell.java:332"
        },
        {
          "method": "org.eclipse.jface.window.Window.createShell",
          "source": "Window.java:474"
        },
        {
          "method": "org.eclipse.jface.window.Window.create",
          "source": "Window.java:417"
        },
        {
          "method": "org.eclipse.jface.dialogs.Dialog.create",
          "source": "Dialog.java:996"
        },
        {
          "method": "org.eclipse.jface.window.Window.open",
          "source": "Window.java:776"
        },
        {
          "method": "org.eclipse.wst.server.ui.internal.actions.RunOnServerActionDelegate$1.run",
          "source": "RunOnServerActionDelegate.java:285"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "141319",
      "date": "2006-05-11T17:03:27+02:00",
      "product": "Web Tools",
      "component": "wst.server",
      "severity": "critical"
    }
  ],
  "groupId": "141319",
  "bugId": "141319",
  "date": "2006-05-11T17:03:27+02:00",
  "product": "Web Tools",
  "component": "wst.server",
  "severity": "critical"
}