{
  "comments": [
    "Im using 3.2 RC1, but I also repro\u0027ed it in 3.2RC4.\n\nIn the External Tools \u003e Ant Build UI, (Main tab) I set the \"Base Directory\" to have a mix of English and Japanese. \n\nFor example,\n/English1/English2/\u003cJapaneseCharacters\u003e/English3/\n\nWhen I run the ant script, I get the following error in the console window.\n\nBUILD FAILED \nmyscript.xml:16: Basedir /English1/English2/???????t}Ce??CX???/English3 does not exist\n\nIf I replace the Japanese with its English translation, it works great (in our product, thats not an option though).\n\nEverything looks good in the Ant Launch Configuration Main tab UI. That is, the Japanese characters display correctly. Even single stepping shows the correct Japanese characters in the debugger.\n\nFurther info. Im launching in a separate JRE (1.5.0 Rel 4 on Mac). \n\nI have also set up the Mac to be completely in Japanese.\n\nI suspect this will duplicate on all platforms, and probably with just all Japanese as well.",
    "I was doing this all initially programmatically using the AntLaunchDelegate, so I resorted to using the UI to remove my code from the equation. Ultimately, Ill need to do this programmatically whatever the solution.",
    "\n\n*** This bug has been marked as a duplicate of 32206 ***",
    "Reopening.\nAlthough I didn\u0027t expect it to work, this is actually working fine for me with a hello world style build file that I created inside the project attached to bug 32206.\nAlso, this problem looks like it\u0027s related to the resolution of your basedir which would indicate that your process has been created successfully (different from bug 32206)\nCould you please attach a project containing a build file that demonstrates the problem?\n",
    "Created an attachment (id\u003d41519)\nThe launch configuration for the repro\n\nHere\u0027s the launch I used.",
    "Created an attachment (id\u003d41520)\nThe simple build.xml\n\n",
    "Side issue, but related...\n\nI noticed in some of my testing that the same Japanese characters were not happy in the \"Main\" tab \"BuildFile:\" field. I didnt get any error dialogs, but the Ant script never ran. ",
    "What build are you using to reproduce this? So far I haven\u0027t been able to make my build files fail. \n\nmy build.xml:\n\u003cproject default\u003d\"echoTarget\"\u003e\n\t\u003ctarget name\u003d\"echoTarget\"\u003e\n\t\t\u003cecho\u003ebasedir: ${basedir}\u003c/echo\u003e\n\t\t\u003cecho\u003eHello World\u003c/echo\u003e\n\t\u003c/target\u003e\n\u003c/project\u003e\n\noutput:\nBuildfile: /Users/kevinbarnes/Eclipse/buildfiles/????????????/bin/build.xml\nechoTarget:\n     [echo] basedir: /Users/kevinbarnes/Eclipse/buildfiles/????????????/bin\n     [echo] Hello World\nBUILD SUCCESSFUL\nTotal time: 454 milliseconds\n",
    "we were using 3.2 RC1, but I believe I reproed it with RC4 as well. \n\nYoure trying this on a Mac, or a PC?",
    "I\u0027m using a Mac and last night\u0027s build N20060608-0010.",
    "Ok, thx. Ill try that build out.",
    "Created an attachment (id\u003d44192)\nScreenshot of System Preferences \u003e International\n\nScreenshot of System Preferences \u003e International",
    "I was able to duplicate your success only if System Preferences \u003e International shows English as the primary language. Try changing your system over to Japanese as the primary language and restart Eclipse. In the N20060608-0010 build, the Ant script wont even run. It says the Ant script terminated, but no output will appear in the Console window. We even go one step further by changing the keyboard input over to Romanji or Katakana by clicking on that American flag in the upper right corner of the iMac. When you do both of those things and reboot your Mac, then you know youre in full Japanese mode. Makes life harder to type though. :) Usually just changing the language in System Preferences \u003e International is good enough. :)",
    "Do you have the japanese language pack installed also?",
    "The Eclipse language pack? No. As far as I know, one doesnt exist for Eclipse 3.2.",
    "Is there anything in your error log?",
    "!ENTRY org.eclipse.ant.ui 4 120 2006-06-12 14:52:27.104\n!MESSAGE Error logged from Ant UI: \n!STACK 0\njava.net.SocketTimeoutException: Accept timed out\n\tat java.net.PlainSocketImpl.socketAccept(Native Method)\n\tat java.net.PlainSocketImpl.accept(PlainSocketImpl.java:384)\n\tat java.net.ServerSocket.implAccept(ServerSocket.java:450)\n\tat java.net.ServerSocket.accept(ServerSocket.java:421)\n\tat org.eclipse.ant.internal.ui.launchConfigurations.RemoteAntBuildListener$ServerConnection.run(RemoteAntBuildListener.java:95)\n",
    "I can reproduce the timeout exception, but I can\u0027t explain it yet. For some reason the ant launch is failing and therefore it never connects back to eclipse which causes the timeout. The strange thing is I can only reproduce this in my host, and not in my target.\nFor kicks I tried this on linux and everything seems to work fine. I have to admit that testing code on a japanese OS isn\u0027t easy for me though. :D",
    "I\u0027m happy to help guinea pig any fixes you might have on our iMacs in Japanese. Its definitely not easy, but we have translators in house to help when I get stuck. :)",
    "Changing the OS language on Mac also changes the default system encoding from MacRoman to SJIS. I suspect that this is causing the problem. Ie, we\u0027re creating folders/files in MacRoman, switching the system to Japanese (and SJIS) then trying to read and launch a VM with SJIS encoding.\n\nUnforetunately I don\u0027t have the skills necessary to test this. David would it be possible to have one of your translators create a new project on a japanese machine (ie a clean, non MacRoman directory) and try running an ant build in it?\n\n",
    "OK, I should be able to try it out today and let you know how it did. ",
    "I should also note that the default encoding would not change if you were to start your workbench with -nl option, and that the default encoding on my linux box is UTF-8 regardless of whether it\u0027s running in Japanese or English. Under both these scenarios the test case works correctly.\n",
    "OK we started up Eclipse in Japanese so the file encoding was SJIS. Created a new Java project. The project name was all in Japanese. When we created the project the path was in \"Macintosh HD\"/\u003cJapanese string\u003e/. We copied the previous build.xml over to that directory, did a refresh on the project so the file would show up, and then ran the External Tools on it. Still got the same exception as above. \n\nInteresting that you mentioned the file encoding being UTF8 working on linux. I tried to force Eclipse to set the file.encoding\u003dUTF-8, but Eclipse seemed to crash. i.e. \"./eclipse -vmargs -Dfile.encoding\u003dUTF-8\" Hopefully, thats the right way to do that. Eclipse went non-linear and crashed pretty fast doing that though.\n",
    "I didn\u0027t use -Dfile.encoding to switch to UTF-8, it\u0027s the default on my linux box.  That means that Eclipse and my file system were both using the same encoding regardless of the language. The problem I think we\u0027re seeing on mac is that we\u0027re creating MacRoman files, then trying to run them as if they were SJIS. I\u0027m not sure what copy/paste does to a files encoding, but I suspect the original encoding is maintained.",
    "Yea, I had the same thought about the copy/paste preserving the file encoding on the build file. On the Mac, I did save my build.xml as SJIS though. You can verify it in Eclipse too by right clicking on the file and Properties. ",
    "I don\u0027t think this is an Eclipse bug, but probably a vm bug. Runtime.exec(..) seems to be having a problem launching ant. Similar behavior can be reproduced using a java to launch a python script. All is happy when my OS is english, however, python fails to run when the OS is set to Japanes.\n\n\nThis is my java file. \npublic static void main(String[] args) throws Exception {\n//\t\tString fileName \u003d \"/Users/kevinbarnes/temp/\\u3050\\u3060\\u3070/\";\n\t\tString fileName \u003d \"/Users/kevinbarnes/temp/english\";\n\t\tRuntime rt \u003d Runtime.getRuntime();\n\t\tFile file \u003d new File(fileName);\n\t\tSystem.out.println(\"working dir: \" + file.getAbsolutePath() + \" exists? \" + file.exists());\n\t\tProcess process \u003d rt.exec(new String[] {\"python\", \"HelloWorld.py\"}, null, file);\n\t\t\n\t\tInputStream in \u003d process.getInputStream();\n\t\tfor(;;) {\n\t\t\tint i \u003d in.read();\n\t\t\tif (i\u003c0) \n\t\t\t\tbreak;\n\t\t\tSystem.out.write(i);\n\t\t}\n\t\tin.close();\n\t\tprocess.getOutputStream().close();\n\t\tprocess.destroy();\t\n\t\tSystem.out.println(process.exitValue());\n\t}\n\nHelloWorld.py is just: print \u0027Hello World\u0027\n\nRunning this code from the command line (ie Eclipse is no way involved) works fine and the python exit code is 0. However, if you change the code to use the japanese directory instead of \"english\" python process exits with code 255 and nothing is printed to the command line.\n\nHere is my output:\n\ndyn:~/Eclipse/Workspaces/japanese/Junk kevinbarnes$ java RuntimeTest\nworking dir: /Users/kevinbarnes/temp/english exists? true\nhello world\n0\ndyn:~/Eclipse/Workspaces/japanese/Junk kevinbarnes$ java RuntimeTest\nworking dir: /Users/kevinbarnes/temp/?????? exists? true\n255\n",
    "Wow, thats interesting. Not suprising given the weird support for Java on the Mac.  \n\nDoes the same failure apply to an Ant script run from the command line?",
    "Same result running an ant build. When the OS is set to japanese, the exit code is 255, but when it\u0027s english, ant runs fine.\n\nenglish OS output:\ndyn:~/Eclipse/Workspaces/japanese/Junk kevinbarnes$ java RuntimeTest \nworking dir: /Users/kevinbarnes/temp/??? exists? true\nBuildfile: build.xml\n\nf2:\n     [echo] hi\n\nBUILD SUCCESSFUL\nTotal time: 0 seconds\nException in thread \"main\" java.lang.IllegalThreadStateException: process hasn\u0027t exited\n        at java.lang.UNIXProcess.exitValue(UNIXProcess.java:119)\n        at RuntimeTest.main(RuntimeTest.java:24)\n\n\nJapanese OS output:\ndyn:~/Eclipse/Workspaces/japanese/Junk kevinbarnes$ java RuntimeTest\nworking dir: /Users/kevinbarnes/temp/?????? exists? true\n255\n\n\n",
    "I\u0027m going to mark this as WONTFIX since it seems that this is not specific to Eclipse.",
    "Ok, thanks for looking into it. \n\nAny way IBM can file a bug with Sun to get some traction on resolving this? I imagine theyd respond quicker hearing from Eclipse people than one of the \"little\" people (i.e. me)."
  ],
  "commentCreationDates": [
    "2006-05-15T18:12:47+02:00",
    "2006-05-15T18:45:33+02:00",
    "2006-05-15T20:17:21+02:00",
    "2006-05-15T20:33:17+02:00",
    "2006-05-15T23:18:44+02:00",
    "2006-05-15T23:19:05+02:00",
    "2006-05-15T23:21:24+02:00",
    "2006-06-08T19:26:45+02:00",
    "2006-06-08T20:31:25+02:00",
    "2006-06-08T20:35:05+02:00",
    "2006-06-08T20:40:19+02:00",
    "2006-06-12T22:28:18+02:00",
    "2006-06-12T22:32:14+02:00",
    "2006-06-12T23:19:10+02:00",
    "2006-06-12T23:26:49+02:00",
    "2006-06-12T23:38:59+02:00",
    "2006-06-12T23:50:50+02:00",
    "2006-06-13T17:32:29+02:00",
    "2006-06-13T17:51:39+02:00",
    "2006-06-13T20:49:47+02:00",
    "2006-06-13T20:57:16+02:00",
    "2006-06-13T21:01:10+02:00",
    "2006-06-13T22:58:52+02:00",
    "2006-06-14T00:00:11+02:00",
    "2006-06-14T00:29:58+02:00",
    "2006-06-21T00:03:28+02:00",
    "2006-06-21T00:33:32+02:00",
    "2006-06-21T23:27:31+02:00",
    "2006-06-21T23:29:12+02:00",
    "2006-06-22T20:27:17+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.net.SocketTimeoutException",
      "message": "Accept timed out",
      "elements": [
        {
          "method": "java.net.PlainSocketImpl.socketAccept",
          "source": "Native Method"
        },
        {
          "method": "java.net.PlainSocketImpl.accept",
          "source": "PlainSocketImpl.java:384"
        },
        {
          "method": "java.net.ServerSocket.implAccept",
          "source": "ServerSocket.java:450"
        },
        {
          "method": "java.net.ServerSocket.accept",
          "source": "ServerSocket.java:421"
        },
        {
          "method": "org.eclipse.ant.internal.ui.launchConfigurations.RemoteAntBuildListener$ServerConnection.run",
          "source": "RemoteAntBuildListener.java:95"
        }
      ],
      "number": 0,
      "commentIndex": 16,
      "bugId": "141795",
      "date": "2006-06-12T23:50:50+02:00",
      "product": "Platform",
      "component": "Ant",
      "severity": "normal"
    },
    {
      "exceptionType": "java.lang.IllegalThreadStateException",
      "message": "process hasn\u0027t exited",
      "elements": [
        {
          "method": "java.lang.UNIXProcess.exitValue",
          "source": "UNIXProcess.java:119"
        },
        {
          "method": "RuntimeTest.main",
          "source": "RuntimeTest.java:24"
        }
      ],
      "number": 1,
      "commentIndex": 27,
      "bugId": "141795",
      "date": "2006-06-21T23:27:31+02:00",
      "product": "Platform",
      "component": "Ant",
      "severity": "normal"
    }
  ],
  "groupId": "141795",
  "bugId": "141795",
  "date": "2006-05-15T18:12:47+02:00",
  "product": "Platform",
  "component": "Ant",
  "severity": "normal"
}