{
  "comments": [
    "I\u0027m not able to run manual or automated GUI test suites using a secure AC.  My first attempt resulted in a CoreException being thrown.  When I exited the workbench and tried again, the launch always got stuck at 57%.",
    "I\u0027ve reproduced this, both using the 05170100 build of the new AC and with the 04120817 build of the RAC.\n\nIf I run the test through a local instance of the AC with security enabled, I get prompted quickly to accept a new security certificate, then I get prompted for my user name and password, and finally the test runs to completion.  If I connect to a remote Windows XP machine (with security enabled) I get the Core Exception message before any other prompts regarding certificate or user name.\n\nAfter further investigation, I discovered that I had left the firewall on on the remote machine and it was blocking the secure server port (10005).  When I turned off the firewall I was able to execute a manual test successfully.\n\nI also noticed that if I give the wrong password three times, causing the user logon to fail, I shortly afterward get the same Core Exception message as in the above conditions.  Since the message says this is coming from the Test Execution Harness, I am changing the component for this bug.\n\nI suspect this problem has been present for some time.  I was using the 04210100 TPTP driver as my client for this test.  \n\nIt seems like we could probably lower the severity if my findings can be confirmed.",
    "Andrew,\n\nCan you try this with a manual test that is under org.eclipse.hyades.use.cases.  Whenever I attempt to launch a test in secure mode under this plugin, the launch process always gets stuck at 57%.\n\nTry launching org.eclipse.hyades.use.cases\\manual\\Profiling_and_Logging\\Platform.Agents.JVMPI.AIX_PPC.testsuite.\n\nThe manual test launches fine when it is in a project that doesn\u0027t have as much nested directory structure as org.eclipse.hyades.use.cases.  This may also have something to do with a long classpath that is required when launching under a plugin vs a simple project.\n\nI don\u0027t agree with lowering the severity unless tests under plug-ins can be launched properly. \n\nRe-assigning back to andrew.",
    "The problem in the Platform.Agents.JVMPI.AIX_PPC.testsuite case was that a large message caused us to have to reallocate our message buffer and the part of the code that called into the secure connection layer wasn\u0027t taking into account that part of the original message had already been read.\n\nI updated the secure processing code to match the non-secure processing code, and now it seems to be working.",
    "I still can\u0027t run Platform.Agents.JVMPI.AIX_PPC.testsuite using a secure connection.  I am launching locally and I get prompted for my username and password.  When I enter my username/pass, I get a CoreException.",
    "I can\u0027t reproduce this with the 05251528 build.\n\nIn addition to having security enabled, did you have any restriction on which users could connect?",
    "The user set is \"any\".\nThe following severe message was logged to AC\u0027s log:\n\"Received command for unrecognized interface: iid\u003dorg.eclipse.tptp.eventProvider, cmd\u003dlistenerAccepted\"\n\nThe workspace error log indicated the following at of memory exception:\n\norg.eclipse.core.runtime.CoreException: IWAT4039E The Test Execution Harness reported the following problems:java.lang.OutOfMemoryError\n\tat org.eclipse.hyades.test.core.launch.delegates.AbstractLaunchConfigurationDelegate2.launch(AbstractLaunchConfigurationDelegate2.java:178)\n\tat org.eclipse.debug.internal.core.LaunchConfiguration.launch(LaunchConfiguration.java:639)\n\tat org.eclipse.debug.internal.core.LaunchConfiguration.launch(LaunchConfiguration.java:565)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch(DebugUIPlugin.java:754)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin$6.run(DebugUIPlugin.java:944)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)\n\n\nThis looks like to be a test execution issue.  I\u0027m changing the component to Test.Execution and assigning it to Kent.",
    "Ali, did you start the secure AC as root on AIX?  (See https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d144255)",
    "I\u0027m running in Windows.  The arbitrary test suite that I picked happens to be for AIX.",
    "Joe, please take a look at this one. (cc\u0027ing Scott S. since running tests on secure RAC has a long history).  It was my understanding is that after a succession of fixes this normally works now in 4.2, but obviously at least for this particular situation it fails.\n\nThis was originally targeted to 4.2i3 and fixed, but now is reopened.  After your investigation the severity and target milestone may need to be adjusted, once we understand the nature of when/why it fails.",
    "I can\u0027t reproduce this problem -- I am able to run the specified test with security enabled on windows with the i3 build.  I am closing the defect as \"worksforme\", but I will get in touch with Ali to understand what is different in his configuration, and if it\u0027s not a configuration problem, we can re-open this defect with an updated description and severity.",
    "I was encountering the problem that is already reported by Paul:  https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d144286",
    "ACTION: Please verify/close this defect.",
    "Closing..."
  ],
  "commentCreationDates": [
    "2006-05-17T23:44:57+02:00",
    "2006-05-19T01:55:09+02:00",
    "2006-05-20T22:30:30+02:00",
    "2006-05-22T20:02:32+02:00",
    "2006-05-26T20:55:41+02:00",
    "2006-05-27T01:08:59+02:00",
    "2006-05-28T22:31:21+02:00",
    "2006-05-30T16:36:53+02:00",
    "2006-05-30T16:48:58+02:00",
    "2006-05-30T17:22:17+02:00",
    "2006-05-30T20:19:01+02:00",
    "2006-05-30T20:57:28+02:00",
    "2006-11-16T14:03:12+01:00",
    "2006-11-16T14:58:05+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.OutOfMemoryError",
      "elements": [
        {
          "method": "org.eclipse.hyades.test.core.launch.delegates.AbstractLaunchConfigurationDelegate2.launch",
          "source": "AbstractLaunchConfigurationDelegate2.java:178"
        },
        {
          "method": "org.eclipse.debug.internal.core.LaunchConfiguration.launch",
          "source": "LaunchConfiguration.java:639"
        },
        {
          "method": "org.eclipse.debug.internal.core.LaunchConfiguration.launch",
          "source": "LaunchConfiguration.java:565"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch",
          "source": "DebugUIPlugin.java:754"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin$6.run",
          "source": "DebugUIPlugin.java:944"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 6,
      "bugId": "142363",
      "date": "2006-05-28T22:31:21+02:00",
      "product": "TPTP Testing",
      "component": "Test.Execution",
      "severity": "critical"
    }
  ],
  "groupId": "142363",
  "bugId": "142363",
  "date": "2006-05-17T23:44:57+02:00",
  "product": "TPTP Testing",
  "component": "Test.Execution",
  "severity": "critical"
}