{
  "comments": [
    "When I start eclipse with ibm-jdk-1.4.2.05, it works, unless I use -vmargs -Xj9\n\nwith -Xj9, or with ibm-jdk-1.5.0-SR1, Tree Widgets show only the triangle\n\nI can view the content by having a big enough list, and using cursor keys to scroll fast, but passing the mouse on top of the (then visible) items makes them turn white again.\n\nIt works well with sun embedded jdk for powerpc, too. \n\nI can provide screenshots of the effect.\n\nThis is going on since 3.1.2 up to 3.2RC5",
    "Still there in 3.2RC6, FYI",
    "Ongoing in 3.2RC7 and in all snapshots until 20060610 at least.\n\nThe empty list panes can be seen too in the \"browse...\" option of the \"select workspace\" dialog, early in the start. Only with \"-vmargs -Xj9\" in 1.4.2.05, in all cases in 1.5.0 SR2\n\nworks with Sun evaluation for embedded ppc and also with gij",
    "Exactly the same problem with stock release 3.2:\n\n- works with \"plain\" ibm-jdk-bin-1.4.2.5\n- blanked items in lists for -Xj9 1.4.2.5\n- blanked items in lists for  1.5.0-sr2\n- works with Sun 1.4.2-11 eval jdk for embedded powerpc\n- works with gij\n\nI think some sort of assignee feedback or request for information would be appropriate. I\u0027ve seen the email of the different changes, but not a single comment, request for information, etc., coming from the project. Now I have 1 assignee and two other CC in the bug, (Silenio Quarti \u003cSilenio_Quarti@ca.ibm.com\u003e, Andrew_Low@ca.ibm.com, steve_northover@ca.ibm.com) and I\u0027m starting to feel stupid being the only one to talk here for one month and a half.\n\nTIA",
    "Felipe, could you take a look at this?\n\nSantiago, what version of gtk/glib/etc are you running? RedHat?\n\nrpm -q gtk2 glib2 pango atk\n",
    "Created an attachment (id\u003d46065)\nI can already notice the problem in the \"select-workspace\" browse box\n\nproblem with IBM-jdk-1.4.2.5 -Xj9",
    "Created an attachment (id\u003d46066)\nwithout -Xj9, this is the result (expected)\n\nSame as with Sun evaluation j2se for embedded powerpc or gnu gij.",
    "(oops, this got lost)\n\nI\u0027m running gentoo on linux ppc (I\u0027m not even sure there is redhat for linux-ppc, most, likely fedora). The problem has been going on across several gtk+ , glib, pango and atk versions. Mostly recent stuff (gnome-2.14). Currently I have:\n\n- equery list -p x11-libs/gtk+\n[ Searching for package \u0027gtk+\u0027 in \u0027x11-libs\u0027 among: ]\n * installed packages\n[I--] [  ] x11-libs/gtk+-1.2.10-r11 (1)\n[I--] [ ~] x11-libs/gtk+-2.10.0 (2)\n\nBut I just tried 2.10 coming from 2.8.X(12-19) versions, and the behaviour is the same.\n\nI\u0027ve moved from glib-2.10 to 2.12, and again nothing changed\nequery list -p dev-libs/glib-2\n[ Searching for package \u0027glib\u0027 in \u0027dev-libs\u0027 among: ]\n * installed packages\n[I--] [ ~] dev-libs/glib-2.12.0 (2)\n\n\nAtk I think has been in this release for a long time.\nequery list -p dev-libs/atk\n[ Searching for package \u0027atk\u0027 in \u0027dev-libs\u0027 among: ]\n * installed packages\n[I--] [ ~] dev-libs/atk-1.11.4 (0)\n\nFor pango, I\u0027ve tried 1.10.X, 1.2.3 and currently 1.13.2:\nequery list -p x11-libs/pango\n[ Searching for package \u0027pango\u0027 in \u0027x11-libs\u0027 among: ]\n * installed packages\n[I--] [ ~] x11-libs/pango-1.13.2 (0)\n",
    "Works for me, well, sort of.\nThe system\n-sh-3.00$ uname -a\nLinux hostname-edited- 2.6.15-rc5.ydl.1g5-smp #1 SMP Tue Jan 17 18:09:27 EST 2006 ppc64 ppc64 ppc64 GNU/Linux\n-sh-3.00$ cat /etc/yellowdog-release\nYellow Dog Linux release 4.1 (Sagitta)\n-sh-3.00$ rpm -q gtk2 glib2 pango atk\ngtk2-2.8.6-3\nglib2-2.8.3-1\nglib2-2.8.4-1\npango-1.10.1-1\natk-1.9.1-1\n\nI tried with two different VM\n-sh-3.00$ ../../VM/IBMJava2-ppc-142/jre/bin/java -version\njava version \"1.4.2\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.4.2)\nClassic VM (build 1.4.2, J2RE 1.4.2 IBM build cxppc32142sr1a-20050209 (JIT enabled: jitc))\n\nWith this VM (1.4.2) it all works fine.\n-sh-3.00$ ../../VM/ibm-java2-ppc-50/jre/bin/java -version\njava version \"1.5.0\"\nJava(TM) 2 Runtime Environment, Standard Edition (build pxp32devifx-20060124)\nIBM J9 VM (build 2.3, J2RE 1.5.0 IBM J9 2.3 Linux ppc-32 j9vmxp3223ifx-20060124 (JIT enabled)\nJ9VM - 20051027_03723_bHdSMR\nJIT  - 20051027_1437_r8\nGC   - 20051020_AA)\nJCL  - 20060120\n\nEclipse crashed during start up (i\u0027ll attach the log)\n\n\n\n\n\n",
    "Created an attachment (id\u003d46084)\ngpf\n\nwell, I tried again with VM 1.5 (same everything) and this time it all worked fine.",
    "I see you\u0027re using versions more than one year old. I\u0027m using here:\n\n1.4.2-SR5: java -version\njava version \"1.4.2\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.4.2)\nClassic VM (build 1.4.2, J2RE 1.4.2 IBM build cxppc32142-20060421 (SR5) (JIT enabled: jitc))\n\nor 1.5.0-SR2\n\n/opt/ibm-jdk-bin-1.5.0/bin/java -version\njava version \"1.5.0\"\nJava(TM) 2 Runtime Environment, Standard Edition (build pxp32dev-20060511 (SR2))IBM J9 VM (build 2.3, J2RE 1.5.0 IBM J9 2.3 Linux ppc-32 j9vmxp3223-20060504 (JIT enabled)\nJ9VM - 20060501_06428_bHdSMR\nJIT  - 20060428_1800_r8\nGC   - 20060501_AA)\nJCL  - 20060511a\n\nwould you mind testing with one of those versions? for 1.4.2, you need to use -Xj9 to get the problem, without it it works well.\n\n",
    "sonia, would you know where I can get a copy of the VMs listed in comment 10 ?\n(note: PowerPC)\nThanks",
    "http://www-128.ibm.com/developerworks/java/jdk/linux/download.html\n\n32 bits iSeries/pSeries is ppc 32 (G4, etc), the one I use\n64 bits iSeries/pSeries is power 64 (G5)\n\nkeep the binary of your old versions, just in case. While I seem to recall a pointer to old versions, I can\u0027t find it right now.",
    "I got the right VMs (the exactly VMs  you listed on comment 10), works for me.",
    "I guess then it is related to \"modern\" versions of gtk+/gnome, etc., as I\u0027m using 2.14+\n\nThe funny thing, and what makes me think it is a problem in swt/jdk, is that it only happens with the j9vm, both plain ibm 1.4.2 and Sun evaluation jdk for embedded powerpc work, as well as gij.\n\nFeel free to close it, as there is no way to reproduce it nor a clue on what code could be triggering this white redrawing bug.",
    "Given that this is on PowerPC, I bet it\u0027s a precision problem in cairo or\npango.  What version of each do you have installed?  I\u0027m suspecting here\nthat, similar to on x86, the CPU has different floating point precision\nmodes, and probably the J9 JVM is using a different one for JNI calls\nthan the other JVMs.",
    "I\u0027m using \n\ncairo-1.2.0\npango-1.13.2\n\nboth compiled with gcc-4.1.1, which could be related.",
    "*** Bug 161182 has been marked as a duplicate of this bug. ***",
    "We need to provide a C example and an SWT DLL call only example that does exactly the same thing.  Don\u0027t we already have one of these around, the one used by Billy to diagnose the precision problem?",
    "I am seeing this same problem (and have for quite a while now) under gentoo on powerpc.  Azureus 2.5.0.0 shows list widgets under IBM JDK 1.4.2:\n ~ $ /opt/ibm-jdk-bin-1.4.2.6/bin/java -version\njava version \"1.4.2\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.4.2)\nClassic VM (build 1.4.2, J2RE 1.4.2 IBM build cxppc32142-20060824 (SR6) (JIT enabled: jitc))\nand the list widget text is invisible or white (if I select something then the background becomes blue and I can see the text) under IBM JDK 1.5.0:\n ~ $ /opt/ibm-jdk-bin-1.5.0.3/bin/java -version\njava version \"1.5.0\"\nJava(TM) 2 Runtime Environment, Standard Edition (build pxp32dev-20061002a (SR3) )\nIBM J9 VM (build 2.3, J2RE 1.5.0 IBM J9 2.3 Linux ppc-32 j9vmxp3223-20061001 (JIT enabled)\nJ9VM - 20060915_08260_bHdSMR\nJIT  - 20060908_1811_r8\nGC   - 20060906_AA)\nJCL  - 20061002\n\nversions:\npango-1.14.7\ncairo-1.2.4\ngtk+-2.10.6\nglib-2.12.4-r1\natk-1.12.3",
    "We need to debug this remotely using C code and SWT DLL only calls.  Bogdan, please see me or Felipe to get some code that Jimbob and Santiago can try.",
    "/me has no longer a powerpc, the motherboard died. Now I\u0027m using a similar setup with gentoo amd64 on a Core 2 Duo laptop. I\u0027m using the (still proprietary) Sun JDK 1.5.0_08, iirc.\n\nI can try to reproduce with IBM JDK in this platform, the issue seemed more related to C++ compatibility libraries used by the IBM JDK, so I might as well see it in my Dell Inspiron.\n\nRegards",
    "I can test anything that you can throw at me (to the best of my abilities) or I may be able to give someone an account on my machine, worse comes to worse.",
    "The problem can\u0027t be reproduced at all with AMD gentoo and IBM-jdk-1.5.0.3. My setup is fairly similar to the previous one, so I guess it is something PowerPC specific.",
    "Created an attachment (id\u003d54107)\nNative + Java code snippets\n\nHere is a zip containing some native code that will bring up a file dialog and the equivalent SWT code. Can you please run these and report your findings? Thanks!",
    "Well, finally got a chance to try these out.\nThe native command brought up a regular gtk \u0027open file\u0027 dialog window, everything is visible (although all files are greyed out, only directories are navigable) and I can navigate the filesystem with no difficulties.  Everything normal.\nThe java example was compiled with like so:\n/usr/lib/jvm/ibm-jdk-bin-1.5/bin/javac -classpath .:/usr/share/swt-3/lib/swt.jar PR143061.java\nand executed like so:\n/usr/lib/jvm/ibm-jdk-bin-1.5/bin/java -classpath .:/usr/share/swt-3/lib/swt.jar PR143061\nand here is what I get:\nGTK version 2.10.6\n\nUnhandled exception\nType\u003dSegmentation error vmState\u003d0x00000000\nJ9Generic_Signal_Number\u003d00000004 Signal_Number\u003d0000000b Error_Value\u003d00000000 Signal_Code\u003d00000001\nHandler1\u003d0FAA3B80 Handler2\u003d0FA059E0\nR0\u003d0E57C8B0 R1\u003d7F96E5D8 R2\u003d30028110 R3\u003d0E5A5B38\nR4\u003d0E5A5B38 R5\u003d00000000 R6\u003d00000000 R7\u003d7F7F0000\nR8\u003d00000008 R9\u003d0E5A5B38 R10\u003d0FF5D9F8 R11\u003d1048C8A8\nR12\u003d28424482 R13\u003d1006B800 R14\u003d00000000 R15\u003d43300000\nR16\u003d00000000 R17\u003d00000000 R18\u003d00000000 R19\u003d1048C8A8\nR20\u003d10490FC0 R21\u003d1048B390 R22\u003d7F96E734 R23\u003d1048B318\nR24\u003d00000001 R25\u003d0E583BBC R26\u003d00000001 R27\u003d105ACBB0\nR28\u003d7F96E668 R29\u003d0E5A5B38 R30\u003d0E5A6100 R31\u003d00000000\nNIP\u003d0FE7BC10 MSR\u003d0200D032 ORIG_GPR3\u003d104CA580 CTR\u003d0E57ADDC\nLINK\u003d0E57F100 XER\u003d00000000 CCR\u003d48424482 MQ\u003d00000000\nTRAP\u003d00000300 DAR\u003d0E5A5B38 dsisr\u003d40000000 RESULT\u003d00000000\nModule\u003d/lib/libc.so.6\nModule_base_address\u003d0FDFB000 Symbol\u003dstrlen\nSymbol_address\u003d0FE7BC04\nTarget\u003d2_30_20060915_08260_bHdSMR (Linux 2.6.19-rc5)\nCPU\u003dppc (1 logical CPUs) (0x27511000 RAM)\nJVMDUMP006I Processing Dump Event \"gpf\", detail \"\" - Please Wait.\nJVMDUMP007I JVM Requesting System Dump using \u0027/home/nathanp/src/java/PR143061/java/core.20061124.104836.28168.dmp\u0027\nJVMDUMP010I System Dump written to /home/nathanp/src/java/PR143061/java/core.20061124.104836.28168.dmp\nJVMDUMP007I JVM Requesting Snap Dump using \u0027/home/nathanp/src/java/PR143061/java/Snap0001.20061124.104836.28168.trc\u0027\nJVMDUMP010I Snap Dump written to /home/nathanp/src/java/PR143061/java/Snap0001.20061124.104836.28168.trc\nJVMDUMP007I JVM Requesting Java Dump using \u0027/home/nathanp/src/java/PR143061/java/javacore.20061124.104836.28168.txt\u0027\nJVMDUMP010I Java Dump written to /home/nathanp/src/java/PR143061/java/javacore.20061124.104836.28168.txt\nJVMDUMP013I Processed Dump Event \"gpf\", detail \"\".\n\nAzureus also produces the same result when I pull up an \u0027open file\u0027 dialog box, so something is very wrong.  Any ideas?  I will work on this problem, maybe on ##java irc.  If I switch the compile and run command lines above to use the ibm-jdk-bin-1.4 then I get the same result as the \u0027native\u0027 program, a regular gtk \u0027open file\u0027 dialog (all files greyed out) that I can use to navigate the file system.  Anyone need my core files?",
    "I\u0027d be somewhat concerned that the dump information is not quite telling the truth - since if we choose to believe it:\n\nModule\u003d/lib/libc.so.6\nModule_base_address\u003d0FDFB000 Symbol\u003dstrlen\n\nwe are crashing inside of libc performing a strlen().\n\nTwo simple things that could be tried are:\n\n1) Disable the JIT using -Xint on the java command line.  If this resolves the problem we know where to look (it may not be a JIT bug, but some interaction with this OS API and the JIT).\n\n2) Use the -Xrs flag to \u0027reduce signal usage\u0027.  If this helps resolves the problem, then the file dialog must be making an assumption about signal handling that is not true when you run with the JVM.",
    "FYI, compiling and running it with amd64 arch run, the only caveat is that I needed to change two ints by longs in the java source code.\n\n\n\u003e I\u0027d be somewhat concerned that the dump information is not quite telling the\n\u003e truth - since if we choose to believe it:\n\u003e\n\u003e Module\u003d/lib/libc.so.6\n\u003e Module_base_address\u003d0FDFB000 Symbol\u003dstrlen\n\u003e\n\u003e we are crashing inside of libc performing a strlen().\n\nNot sure about this, but I thought that strlen would cause a core dump when called with arbitrary pointers, or just non null-terminated memory close to the end of the virtual space of a process.\n\nIn fact, most of the crashes I was seeing were in fontconfig related string manipulations, strlen typically.",
    "In comment #27 it is implied that we are actually crashing in strlen() - but if this is true, why do we not crash using the native command test case?\n\nJNI code runs in the java processes address space, so things can be laid out in memory quite differently from a trivial C test program - this is another potential aspect to this problem.  Maybe there is some bogus pointer math that doesn\u0027t expect pointers in high memory to be used, and this is what happens when you run in the JVM address space.",
    "The \"new byte[0]\" line in the Java code is bogus.  It should be \"new byte [1]\".  Bogdan, please change the patch and get Santiago to try the new one.",
    "Created an attachment (id\u003d54716)\nNative + Java codesnippets\n\nCan you please give the fixed java version another try? Thanks!",
    "Well, I don\u0027t know if you want to hear from me, but here it is anyway ;)\nThe new codesnippets with \u0027byte[1]\u0027 instead of \u0027byte[0]\u0027 do not change anything for me, I still get a \u0027Unhandled exception/Segmentation error\u0027 as stated above in comment #25.\nNow, wrt comment #26:\noption 1) same error as above in comment #25\noption 2) simply produces a \u0027Segmentation fault\u0027 with no core dumps or debugging info\noption 1 \u0026 2) same as option 2.",
    "Thanks for responding to comment #25.\n\noption 1 elimintates the JIT from the equation.\noption 2 was a bit of a hail mary attempt, the loss of dump support is expected as it uses signals - which the -Xrs flag instructs the JVM to avoid using - so clearly we cannot capture dumps.\n\nIs it still true that other JVMs (not the IBM one) work fine?",
    "As I said, I no longer can test with a powerpc, as my laptop died a horrible death :(\n\nBut back then (upto one month ago) I was using Sun embedded jdk for linux-ppc to run eclipse, and it was working perfectly. It is headless (WRT awt), but being swt an independent library it worked with graphics and all :)\n\nI expect the samples you sent to run with it, given the proper java.library.path and classpath spells :)\n\nBTW, I ran all versions of your examples using linux-amd64+ibm jdk, and, except that I needed to switch int-\u003elong in a couple of places in the java code, it worked perfectly.",
    "\u003e Is it still true that other JVMs (not the IBM one) work fine?\n\nI am running Gentoo 2006.1 on PPC, so I do not have any other JVMs installed. \nDo you recommend any others?  Does Harmony (from apache project) work on PPC?",
    "Created an attachment (id\u003d54788)\nImproved Native + Java codesnippets\n\nOK, I\u0027ve simplified the java code again to eliminate any potential JNI errors. Can you please give it another whirl?\n\nAlso, Santiago + Jimbob: which locale are you using? (I think \u0027echo $LANG\u0027 in a terminal should do it).",
    "no change for the new java code snippet, i get the same result as was posted in comment #25.  works fine with jvm1.4 though (if compiled with 1.4 javac and run with 1.4 java.  if compiled with 1.5 javac, i get \u0027The java class could not be loaded. java.lang.UnsupportedClassVersionError: PR143061 (Unsupported major.minor version 49.0)\u0027)",
    "oh, and echo $LANG produces nothing on my terminal, the LANG variables is empty.",
    "ive run the code from comment# 35.  the C example has worked properly, but the Java example is failing with an unhandled exception.  can someone please explain what that means or what i might be missing?\ni can do additional testing to provide more feedback.\n\nplease see these comments on a similar bug in the gentoo bugzilla for additional details:\n\nhttp://bugs.gentoo.org/show_bug.cgi?id\u003d148999#c38\nhttp://bugs.gentoo.org/show_bug.cgi?id\u003d148999#c39",
    "I saw the same bug with ibm-jdk-1.5.0.3-r1 on my PPC.\n\nAs posted http://bugs.gentoo.org/show_bug.cgi?id\u003d148999#c41 the bug no longer exists with the IBM 1.6 SDK.\n\nThis has been verified with ibm-java-sdk-60-linux-ppc-20061219.tgz on my PPC.",
    "*** Bug 192336 has been marked as a duplicate of this bug. ***",
    "Pablo, can you please run the \"Improved Native + Java\" code snippets on your machine and post your findings.",
    "(In reply to comment #41)\n\u003e Pablo, can you please run the \"Improved Native + Java\" code snippets on your\n\u003e machine and post your findings.\n\u003e \n\nBogdan, I fetched the \"Improved Native + Java codesnippets\" and tried to run them here. I could successfully compile and run the C snippet. I see everything normal. Just a simple GTK window. I can show a screenshot if you want.\n\nThe problem was with the Java code snippet. First, I wasn\u0027t able to compile the code until I copied the following files from eclipse\u0027s \"plugins\" directory (and, of course, added them to the CLASSPATH): org.eclipse.swt_3.2.2.v3236b.jar and org.eclipse.swt.gtk.linux.ppc_3.2.2.v3236.jar\n\nAfter that, the .class file was generated and no errors were given by the compiler. However, when I try tu run the binary I get the following:\n$ javac PR143061.java \u0026\u0026 java PR143061\nException in thread \"main\" java.lang.UnsatisfiedLinkError: swt-pi-gtk-3236 (Not found in java.library.path)\n        at java.lang.ClassLoader.loadLibraryWithPath(ClassLoader.java:952)\n        at java.lang.ClassLoader.loadLibraryWithClassLoader(ClassLoader.java:921)\n        at java.lang.System.loadLibrary(System.java:452)\n        at org.eclipse.swt.internal.Library.loadLibrary(Library.java:123)\n        at org.eclipse.swt.internal.gtk.OS.\u003cclinit\u003e(OS.java:22)\n        at java.lang.J9VMInternals.initializeImpl(Native Method)\n        at java.lang.J9VMInternals.initialize(J9VMInternals.java:187)\n        at PR143061.main(PR143061.java:7)\n\nI tried with both versions of the JDK and JRE:\n$ javac -version\njavac 1.5.0\n$ java -version\njava version \"1.5.0\"\nJava(TM) 2 Runtime Environment, Standard Edition (build pxp32dev-20070201 (SR4))\nIBM J9 VM (build 2.3, J2RE 1.5.0 IBM J9 2.3 Linux ppc-32 j9vmxp3223-20070201 (JIT enabled)\nJ9VM - 20070131_11312_bHdSMR\nJIT  - 20070109_1805ifx1_r8\nGC   - 200701_09)\nJCL  - 20070126\n\nAnd...\n\n$ javac -version\njavac 1.6.0-internal\n$ java -version\njava version \"1.6.0-internal\"\nJava(TM) SE Runtime Environment (build jclxp3260-20070509_01)\nIBM J9 VM (build 2.4, J2RE 1.6.0 IBM J9 2.4 Linux ppc-32 jvmxp3260-20070508_12610 (JIT enabled)\nJ9VM - 20070508_12610_bHdSMR\nJIT  - dev_20070507_1840\nGC   - 20070427_AA)\n\nBTW, I tried to run Eclipse with the new VM (1.6.0) and I got this:\n$ java startup.jar\nException in thread \"main\" java.lang.NoClassDefFoundError: startup.jar\n\nI remember I used to run Eclipse that way and it worked with 1.5.0. Please tell me if you need anything else.",
    "There is a README text in the zip which describes how to build the java part. Assuming you are using the 3.2.2 build :\n\n1) In your Eclipse workspace, create a new Java project and import PR143061.java\n2) To add SWT to your classpath:\n\ti) Right click on the project-\u003eProperties\n\tii)Java Build Path-\u003eLibraries tab. Click on Add Variable...\n\tiii) Select ECLIPSE_HOME and click on the Extend... button\n\tiv) Expand the plugins tree and select the org.eclipse.swt.gtk.linux.ppc_3.2.2.v3236.jar file -\u003e click OK\n\tv) Click OK -\u003e good to go!\n4) To run, right click on the file Run As\u003eSWT Application  \n\nLet me know if this works for you.",
    "(In reply to comment #43)\n\u003e There is a README text in the zip which describes how to build the java part.\n\u003e Assuming you are using the 3.2.2 build :\n\nHeh. That\u0027s a bit funny, since when I reported Bug 192336 the reason was that I couldn\u0027t see anything that was displayed into a list/tree view. Anyway, I managed to do what you needed. This is what Eclipse\u0027s console showed:\n\nGTK version 2.10.6\n\nUnhandled exception\nType\u003dSegmentation error vmState\u003d0x00000000\nJ9Generic_Signal_Number\u003d00000004 Signal_Number\u003d0000000b Error_Value\u003d00000000 Signal_Code\u003d00000001\nHandler1\u003d0FAC7DE0 Handler2\u003d0FA29A60\nR0\u003d0E59F914 R1\u003d7F842A58 R2\u003d30026170 R3\u003d0E80C0E0\nR4\u003d0E80C0E0 R5\u003d00000000 R6\u003d00000000 R7\u003d7F7F0000\nR8\u003d00000008 R9\u003d0E80C0E0 R10\u003dFE8018FC R11\u003d00000064\nR12\u003d22424442 R13\u003d1007E700 R14\u003d00000000 R15\u003d7F842BA0\nR16\u003d10468398 R17\u003d7F842B98 R18\u003d10456A70 R19\u003d1045BBC0\nR20\u003d1045BB00 R21\u003d20000000 R22\u003d104684B8 R23\u003d10653D90\nR24\u003d00000000 R25\u003d104686E8 R26\u003d00000001 R27\u003d10653B78\nR28\u003d7F842AE8 R29\u003d0E80C0E0 R30\u003d0E4658C8 R31\u003d00000000\nNIP\u003d0FE8E980 MSR\u003d0200D032 ORIG_GPR3\u003d1064C8E3 CTR\u003d0E59C0E0\nLINK\u003d0E5A215C XER\u003d00000000 CCR\u003d42424442 MQ\u003d00000000\nTRAP\u003d00000300 DAR\u003d0E80C0E0 dsisr\u003d40000000 RESULT\u003d00000000\nModule\u003d/lib/libc.so.6\nModule_base_address\u003d0FE11000 Symbol\u003dstrlen\nSymbol_address\u003d0FE8E974\nTarget\u003d2_30_20070131_11312_bHdSMR (Linux 2.6.19-rc2)\nCPU\u003dppc (1 logical CPUs) (0xf8e9000 RAM)\nJVMDUMP006I Processing Dump Event \"gpf\", detail \"\" - Please Wait.\nJVMDUMP007I JVM Requesting System Dump using \u0027/home/pablo/eclipse-workspace/eclipse-fix/core.20070617.194032.10237.dmp\u0027\nJVMDUMP010I System Dump written to /home/pablo/eclipse-workspace/eclipse-fix/core.20070617.194032.10237.dmp\nJVMDUMP007I JVM Requesting Snap Dump using \u0027/home/pablo/eclipse-workspace/eclipse-fix/Snap0001.20070617.194032.10237.trc\u0027\nJVMDUMP010I Snap Dump written to /home/pablo/eclipse-workspace/eclipse-fix/Snap0001.20070617.194032.10237.trc\nJVMDUMP007I JVM Requesting Java Dump using \u0027/home/pablo/eclipse-workspace/eclipse-fix/javacore.20070617.194032.10237.txt\u0027\nJVMDUMP010I Java Dump written to /home/pablo/eclipse-workspace/eclipse-fix/javacore.20070617.194032.10237.txt\nJVMDUMP013I Processed Dump Event \"gpf\", detail \"\".\n\nLet me know if you need anything else."
  ],
  "commentCreationDates": [
    "2006-05-22T22:00:15+02:00",
    "2006-06-02T13:39:18+02:00",
    "2006-06-12T17:20:40+02:00",
    "2006-07-08T14:21:03+02:00",
    "2006-07-10T17:28:31+02:00",
    "2006-07-11T12:04:23+02:00",
    "2006-07-11T12:06:07+02:00",
    "2006-07-11T13:00:42+02:00",
    "2006-07-11T18:06:45+02:00",
    "2006-07-11T18:11:05+02:00",
    "2006-07-12T01:54:31+02:00",
    "2006-07-12T17:20:42+02:00",
    "2006-07-13T12:38:00+02:00",
    "2006-07-13T21:42:11+02:00",
    "2006-07-14T17:26:56+02:00",
    "2006-07-15T06:59:19+02:00",
    "2006-07-16T20:38:33+02:00",
    "2006-10-18T05:00:32+02:00",
    "2006-10-18T05:03:13+02:00",
    "2006-11-15T17:01:36+01:00",
    "2006-11-15T18:23:50+01:00",
    "2006-11-15T19:37:37+01:00",
    "2006-11-15T19:53:00+01:00",
    "2006-11-15T21:13:51+01:00",
    "2006-11-17T22:09:04+01:00",
    "2006-11-24T15:59:33+01:00",
    "2006-11-27T20:48:46+01:00",
    "2006-11-27T21:01:40+01:00",
    "2006-11-27T21:31:22+01:00",
    "2006-11-29T00:58:04+01:00",
    "2006-11-29T15:29:57+01:00",
    "2006-11-29T17:09:39+01:00",
    "2006-11-29T18:02:45+01:00",
    "2006-11-29T18:18:19+01:00",
    "2006-11-29T18:40:31+01:00",
    "2006-11-30T16:01:43+01:00",
    "2006-12-07T17:30:31+01:00",
    "2006-12-07T17:31:46+01:00",
    "2007-02-06T05:44:12+01:00",
    "2007-02-13T00:58:52+01:00",
    "2007-06-14T16:33:35+02:00",
    "2007-06-14T18:58:32+02:00",
    "2007-06-18T19:42:53+02:00",
    "2007-06-19T17:41:11+02:00",
    "2007-06-19T18:51:36+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.UnsatisfiedLinkError",
      "message": "swt-pi-gtk-3236 (Not found in java.library.path)",
      "elements": [
        {
          "method": "java.lang.ClassLoader.loadLibraryWithPath",
          "source": "ClassLoader.java:952"
        },
        {
          "method": "java.lang.ClassLoader.loadLibraryWithClassLoader",
          "source": "ClassLoader.java:921"
        },
        {
          "method": "java.lang.System.loadLibrary",
          "source": "System.java:452"
        },
        {
          "method": "org.eclipse.swt.internal.Library.loadLibrary",
          "source": "Library.java:123"
        },
        {
          "method": "org.eclipse.swt.internal.gtk.OS.\u003cclinit\u003e",
          "source": "OS.java:22"
        },
        {
          "method": "java.lang.J9VMInternals.initializeImpl",
          "source": "Native Method"
        },
        {
          "method": "java.lang.J9VMInternals.initialize",
          "source": "J9VMInternals.java:187"
        },
        {
          "method": "PR143061.main",
          "source": "PR143061.java:7"
        }
      ],
      "number": 0,
      "commentIndex": 42,
      "bugId": "143061",
      "date": "2007-06-18T19:42:53+02:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "blocker"
    }
  ],
  "groupId": "143061",
  "bugId": "143061",
  "date": "2006-05-22T22:00:15+02:00",
  "product": "Platform",
  "component": "SWT",
  "severity": "blocker"
}