{
  "comments": [
    "First of all, thanks for your work, it\u0027s great.\nI downloaded the RC3 of jsf tools, imported my web application that use jenia4faces component library and tryed the content assistant for the el.\nThat library will brake this function.\nIf i delete the jenia4faces jar, there are validation problems but the content assist works fine.\nI Think that the problem is about the faces-config.xml definition of jenia4faces.\nIn that library there are many parts of the faces-config.xml file \"imported\" by the \u003c!ENTITY chart SYSTEM \"????\"\u003e declaration.\nYou can download the latest version of jenia4faces at http://prdownloads.sourceforge.net/jenia4faces/jenia4faces_1.2.1.jar?download, the main sute of the library is http://www.jenia.org.\nThanks,",
    "A similar problem is reported with jsf-spring integration used in conjunction with the same component library .\nThe spring team talk about an entity resolver probelm.\n",
    "Observations:\n\nEMF2SAXRenderer.doLoad() fails to resolve the entities correctly. They are defined like this: \u003c!ENTITY popup SYSTEM \"jenia-popup-config.xml\"\u003e, but for some reason the file that is attempted to be opened is \"C:\\eclipse\\jenia-popup-config.xml\" (the eclipse installation folder is prepended). Think we have to kick this over to another WTP team, it\u0027s nothing specific that we are doing.\n\nTop of stacktrace:\n\norg.eclipse.emf.common.util.WrappedException: java.io.FileNotFoundException: C:\\eclipse\\jenia-popup-config.xml (The system cannot find the file specified)\n\tat org.eclipse.wst.common.internal.emf.resource.EMF2SAXRenderer.doLoad(EMF2SAXRenderer.java:97)\n\tat org.eclipse.wst.common.internal.emf.resource.TranslatorResourceImpl.basicDoLoad(TranslatorResourceImpl.java:141)\n\tat org.eclipse.wst.common.internal.emf.resource.CompatibilityXMIResourceImpl.doLoad(CompatibilityXMIResourceImpl.java:170)\n\tat org.eclipse.emf.ecore.resource.impl.ResourceImpl.load(ResourceImpl.java:1089)\n\tat org.eclipse.emf.ecore.resource.impl.ResourceImpl.load(ResourceImpl.java:895)\n\tat org.eclipse.wst.common.internal.emf.resource.TranslatorResourceImpl.load(TranslatorResourceImpl.java:378)\n\tat org.eclipse.jst.jsf.core.internal.provisional.jsfappconfig.JARFileJSFAppConfigProvider.getFacesConfigModel(JARFileJSFAppConfigProvider.java:87)\n\tat org.eclipse.jst.jsf.core.internal.provisional.jsfappconfig.JSFAppConfigManager.getFacesConfigModels(JSFAppConfigManager.java:404)\n---\u003csnip\u003e---",
    "Thanks for your response.\nIf i weel understand the problem, this is whath append : \n1. content assist as an \"API\" (or somthing like that) to load the faces-config.xml file from the current web project.\n2. content assist need the faces-config.xml to understand which are all beans defined and so on.\n3. that api can\u0027t load the faces-config.xml because entities are not resolved correctly.\nWell, so : \nwhich is the WTP team to submit the problem?\nwho have to submit the problem? (you or me) \n\nBye, ",
    "Andrea,\n\nYour summary is accurate. I will take care of any necessary re-assignment of this bug.\n\nThanks,\n - Ian",
    "This issue is related to entity resolution of \"included\" DTDs in JARs, and not specific to JSF.",
    "Looking at the JARFileJSFAppConfigProvider referenced in the stack trace, the renderer factory being used is the EMF2SAXRendererFactory, not the EMF2DOMSSERendererFactory.  John, does this really belong to SSE?",
    "Not sure. I guess there is 2 pieces, the content assist and the emf2saxrenderer loading.  The renderer I guess would fall upon our plate.",
    "I agree that content assist provided by the JSF Tools Project breaking is, indeed, a JSF Tools Project issue. But the root cause of the breakage is incorrect entity resolution when we call upon the EMF2SAXRenderer to load an XML file that is defined by a DTD (inside a JAR) that \"includes\" relative DTDs (inside the same JAR). If we need to be doing something within the scope of the JSF Tools Project to prevent the incorrect resolution (such as something we need to configure before we make the call to EMF2SAXRenderer), please advise.\n\nThanks,\n - Ian",
    "One thing to try, sorry for a vague suggestion, is to specify all the DTD\u0027s (in the jars) in the XML Catalog ... with a jar: scheme. I do not recall the details, but recall some problems (and partial improvelements) getting relative references to dtd\u0027s in jars. I think part of the fix was that \"native resolvers\" could not really do the work by themselves, but we did some special stuff in our xml catalog to help the process. \n\nThen, if you have success doing it \"manually\" ... we can explore ways of making it easier. \n\nCraig ... assigning to you for now, to see if my advice has any merit at all :) \nProbably should go to john or nitin next, depending on what suggesion, if any, you have. \n\n\n",
    "i have tried to add jenia4faces entry in the xml catalog, this is an example : \n\nURI:   \t\tjar:file:D:/jenia4faces/jenia4faces_1.2.1.jar!/META-INF/jenia-popup-config.xml\nKey Type:\tSystem ID\nKey:\t\tjenia-popup-config.xml\n\nThe XML catalog dialog does not report any error, so the URI specified is correct (if i set a wrong URI the dialog will flag the entry with a red icon).\nThis action does not resolve the problem.\n\nP.S.\nThe error log does not show me the wrapped exception (FileNotFound), how can i view it?\n",
    "The XML Catalog 1.0 spec does not support passing in \u0027baseNames\u0027 as keys ... the reason is that (according to the spec) locations are resolved _after_ they\u0027ve been expanded.  The Catalog pefereonce page expects you to enter a fully qualified URI for a location key.  The UI really should be giving you an error message in the case where you\u0027ve entered something that\u0027s not fully qualified.  So seems like there\u0027s a bug there.\n\nTo experiment try using a location like \"http://foo/bar.xml\" instead.  That should help you narrow down if this is an XML Catalog issue or something else.\n\nBTW, Bug 104001 has been opened to request and enhancement support for \u0027baseNames\u0027 as keys. ",
    "I tried to modify jenia4faces faces-config.xml (contained in jenia4faces.jar) specifying the entities as PUBLIC ids and not SYSTEM.\nSo i changed the doctype declaration to \n\u003c!ENTITY popup PUBLIC \"-//jenia.org//jenia4faces//popup\" \"jenia-popup-config.xml\"\u003e\nMy understand is that when the entity resolver try to resolve the entity, first search in the XML catalog the PUBLIC id \"-//jenia.org//jenia4faces//popup\" and after (if fails) go to the public URI.\nI configured my catalog with this entry \nURI:   \t\tjar:file:D:/eclipse32/workspace/Tebe/WebContent/WEB-INF/lib/jenia4faces_1.2.1.jar!/META-INF/jenia-popup-config.xml\nKey Type:\tPublic ID\nKey:\t\t-//jenia.org//jenia4faces//popup\nbut the result is always the same : \norg.xml.sax.SAXParseException: Relative URI \"jenia-popup-config.xml\"; can not be resolved without a base URI.\nSo my question is : which should be the base URI used by the entity resolver when the xml (faces-config.xml) document is inside a jar ?\nHave i missed something?\n\n\n",
    "I suspect that the code that loads the faces config model isn\u0027t hooking up the XML Catalog aware URIResolver.  At some place in the code the EMF2SAXRenderer should attach an EntityResolver to it\u0027s SAX parser to ensure resolution can be handled by the XML Catalog (or any other registered participant in the URI resolution chain).\n\nIf you eyeball the XML Validator, we set a property on the XML Reader like this...\n\nreader.setProperty(\"http://apache.org/xml/properties/internal/entity-resolver\", entityResolver); //$NON-NLS-1$\n\nChuck, assigning over to you.  Perhaps someone who\u0027s more familiar with EMF2SAXRenderer can comment?  I\u0027m happy to help write the code that hooks up the URIResolver if all agree that\u0027s the appropriate thing to do."
  ],
  "commentCreationDates": [
    "2006-06-07T21:15:56+02:00",
    "2006-06-08T00:01:25+02:00",
    "2006-06-08T22:52:57+02:00",
    "2006-06-09T09:11:33+02:00",
    "2006-06-09T23:17:33+02:00",
    "2006-06-10T01:18:22+02:00",
    "2006-06-12T20:11:13+02:00",
    "2006-06-12T23:16:16+02:00",
    "2006-06-12T23:28:21+02:00",
    "2006-06-15T07:41:58+02:00",
    "2006-06-21T09:02:28+02:00",
    "2006-06-21T18:35:04+02:00",
    "2006-06-23T17:31:02+02:00",
    "2007-03-21T06:32:38+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.io.FileNotFoundException",
      "message": "C:\\eclipse\\jenia-popup-config.xml (The system cannot find the file specified)",
      "elements": [
        {
          "method": "org.eclipse.wst.common.internal.emf.resource.EMF2SAXRenderer.doLoad",
          "source": "EMF2SAXRenderer.java:97"
        },
        {
          "method": "org.eclipse.wst.common.internal.emf.resource.TranslatorResourceImpl.basicDoLoad",
          "source": "TranslatorResourceImpl.java:141"
        },
        {
          "method": "org.eclipse.wst.common.internal.emf.resource.CompatibilityXMIResourceImpl.doLoad",
          "source": "CompatibilityXMIResourceImpl.java:170"
        },
        {
          "method": "org.eclipse.emf.ecore.resource.impl.ResourceImpl.load",
          "source": "ResourceImpl.java:1089"
        },
        {
          "method": "org.eclipse.emf.ecore.resource.impl.ResourceImpl.load",
          "source": "ResourceImpl.java:895"
        },
        {
          "method": "org.eclipse.wst.common.internal.emf.resource.TranslatorResourceImpl.load",
          "source": "TranslatorResourceImpl.java:378"
        },
        {
          "method": "org.eclipse.jst.jsf.core.internal.provisional.jsfappconfig.JARFileJSFAppConfigProvider.getFacesConfigModel",
          "source": "JARFileJSFAppConfigProvider.java:87"
        },
        {
          "method": "org.eclipse.jst.jsf.core.internal.provisional.jsfappconfig.JSFAppConfigManager.getFacesConfigModels",
          "source": "JSFAppConfigManager.java:404"
        }
      ],
      "number": 0,
      "commentIndex": 2,
      "bugId": "145849",
      "date": "2006-06-08T22:52:57+02:00",
      "product": "Web Tools",
      "component": "wst.sse",
      "severity": "normal"
    }
  ],
  "groupId": "145849",
  "bugId": "145849",
  "date": "2006-06-07T21:15:56+02:00",
  "product": "Web Tools",
  "component": "wst.sse",
  "severity": "normal"
}