{
  "comments": [
    "Using the new plugin wizard on both the Hello World and Views examples the\nfollowing behaviour is observed.\n\nOn 3.1.2 the plugins can be run/debugged as an eclipse application in a new eclipse instance. The only change made to the default installation was to the projects plugin.xml, on the runtime tab of the plugin manifest editor the exported packages had the project packages added.\n\nOn 3.2.RC6 (Eclipse SDK for Windows IA32 I20060526-0010) the plugins do not run.\nAgain, the only change was to add the exported packages.\nThe Views examples gives a classnotfound exception for the plugin class when the view is added to a perspective.\nThe HelloWorld example gives a dialog box stating that the function is not available (presumably the classnotfound was thrown and caught).\nThe interesting point is that if the project is manually exported as a plugin, and installed in the eclipse plugin directory the plugin works fine (after\nrestarting eclipse).\n\nI only have two weeks experience with eclipse and can not determine where the problem might lie. The wizard might have missed part of the setup, the build might be failing to make the jar, the runtime/debug might have the wrong classpath.\nIt should be easy to reproduce.",
    "Just tried with 3.2.RC7 and this is still an issue.",
    "The scenarios you describe are pretty basic scenarios that work just fine.\n\nDo you have reproducible steps?",
    "As mentioned earlier, I am fairly new to this, and I expect it is fairly basic stuff.\n\nAs mention earlier, these actions work on 3.1.2 out of the box, they do not work on 3.2 RC6 or RC7.\n\nDownload Eclipse SDK.\nUnzip.\nRun eclipse.exe with no parameters.\nFile \u003e New \u003e Project \nPlugin-Develpment \u003e Plugin Project \u003e Next\nProject name \u003d mb \u003e Next\nNext\nPlugin with a view \u003e Next\nTree viewer \u003e Next \u003e Finish\nThis takes me to the mb overview tab (in the manifest editor?)\nSelect runtime tab\nExported Packages \u003e Add...\nSelect both entries \u003e Ok\nSelect Run as... eclipse application\nSave mb \u003e Ok (since the changes above were not saved yet)\n\nA new eclipse launches\nWindow \u003e Show View \u003e Other...\nSample Catagory \u003e Sample View \u003e Ok\n\nOn Eclipse 3.1.2 this adds a view with the elements one, two and three.\nOn Eclipse 3.2 there is an error message and details button.\nThe error message reads:\nUnable to create view: Plug-in mb was unable to load class mb.views.SampleView\nThe details button gives:\njava.lang.ClassNotFoundException: mb.views.Sampleview\nat org.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java(Compiled Code))\n...\n\nNote: If the project is exported as a plug-in and placed in the plug-in directory and eclipse is restarted, then the plugin works. So the problem\nis specific to run and debug modes of eclipse development. Given that\nexactly the same actions on 3.1.2 work, it something new/changed in 3.2.",
    "JLB, can you reproduce?",
    "I was unable to reproduce the issue - the sample view opened up without any problems. Michael, could you attach the project that does not work for you?",
    "we could not reproduce the problem, even with the given workspace.\n\nThere is no bug here.\n\nIf you need help, I suggest asking on the newsgoups."
  ],
  "commentCreationDates": [
    "2006-06-19T10:49:27+02:00",
    "2006-06-19T11:30:53+02:00",
    "2006-06-20T21:22:17+02:00",
    "2006-06-21T14:56:51+02:00",
    "2006-06-21T15:26:02+02:00",
    "2006-06-21T15:55:05+02:00",
    "2006-08-01T21:59:02+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "mb.views.Sampleview",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java(Compiled Code)"
        }
      ],
      "number": 0,
      "commentIndex": 3,
      "bugId": "147692",
      "date": "2006-06-21T14:56:51+02:00",
      "product": "PDE",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "147692",
  "bugId": "147692",
  "date": "2006-06-19T10:49:27+02:00",
  "product": "PDE",
  "component": "UI",
  "severity": "normal"
}