{
  "comments": [
    "Background information: A TableTreeViewer is used to hold method call stack information and the call stack is retrieved by using DeferredTreeContentManager.\n\nThis exception occurred during retrieving large call stack, e.g. call stack that includes more than 10,000 invocation entries.\n\nThere are no other information available. The console outputs only:\n\njava.lang.NullPointerException\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java(Compiled Code))\n\nfor some times, say 8 times or 6 times by different tests.\n\nAfter these exceptions no more retrieving jobs can be done.\n\nTreeViewer with TreeColumn can not be used in eclipse3.0.2. Under eclipse3.2 I have tested that case. No exceptions occurred.\n\nThanks",
    "The NPE appears to be in core, so this is the wrong component.\n\nThat being said, there are no more fixes being made to the 3.0.x stream, so if this is working for you in 3.2 then there is no action required.  Closing report; if I have misunderstood something here then please follow up, thanks.\n",
    "It seems that every possible bug in 3.0-Stream would be not considered any more. I hope RSA gets upgraded soon.",
    "*** Bug 148597 has been marked as a duplicate of this bug. ***"
  ],
  "commentCreationDates": [
    "2006-06-23T17:43:49+02:00",
    "2006-06-23T22:56:06+02:00",
    "2006-06-26T08:50:13+02:00",
    "2006-06-27T17:46:09+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java(Compiled Code)"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "148403",
      "date": "2006-06-23T17:43:49+02:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "normal"
    }
  ],
  "groupId": "148403",
  "bugId": "148403",
  "date": "2006-06-23T17:43:49+02:00",
  "product": "Platform",
  "component": "SWT",
  "severity": "normal"
}