{
  "comments": [
    "Driver:  WTP 1.5 RC6\n\nCurrently, when you click \"Do not see your server?  Click here\" link in the server runtime install, only Geronimo 1.0 plugins are available.  I need to get the Geronimo 1.1 plugins to get some fixes needed for Web services.\n\nPlease re-route if this is not the right component.",
    "WTP server adapter download only supports Geronimo 1.0 from apache.org. If there is a new server adapter available that we should be adding, then please provide the details as an enhancement request; if you just want to use a new adapter then you\u0027ll need to go directly to whoever provides it.",
    "Please have WTP list both Geronimo 1.0 and 1.1 plugins.  You could work with Sachin to get the details of what links to put.  Thanks!",
    "Sachin - Do you have Geronimo 1.1 support on an update manager site? If so, can you post the installable runtime details?",
    "    \u003cinstallableServer\n      id\u003d\"org.apache.geronimo.generic.runtime.11\"\n      name\u003d\"%runtimeTypeGeronimo11Label\"\n      description\u003d\"%runtimeTypeGeronimo11Description\"\n      vendor\u003d\"%vendorApache\"\n      version\u003d\"1.1\"\n      featureId\u003d\"org.apache.geronimo.feature\"\n      featureVersion\u003d\"1.1.0\"\n      featureSite\u003d\"http://www.apache.org/dist/geronimo/eclipse/updates/\"\u003e\n    \u003c/installableServer\u003e",
    "Realized that there is no translation cycle in 1.5.1, so I can\u0027t add this... will check with PMC.",
    "Not a big deal since selecting 1.0 should install the 1.1 feature (I think).",
    "But the problem is after Sachin update the existing link to point to Geronimo 1.1 (with the label still saying Geronimo 1.0), the user would always get Geronimo 1.1 which works with WTP 1.5 but not WTP 1.0.  I think we do need a way for the user to choose which version of Geronimo plugin to install (or at least be clear on which version of the Geronimo plugin they are getting).",
    "Received approval for minor UI changes, dropped code to HEAD. Will release for next week\u0027s I-build.",
    "Using WTP 1.5 GM driver, I just tried to install the Geronimo plugin by clicking \"Do not see your server listed\" link in Preference -\u003e server -\u003e install runtime.  The message still indicated Geronimo 1.0 (I know it will be changed later) and the install failed with a message:\n \n!MESSAGE Featureorg.apache.geronimo.feature org.apache.geronimo.featurecannot be found onhttp://apache.sunsite.ualberta.ca/geronimo/eclipse/updates/\nor a newer version is already installed.\n \n!ENTRY org.eclipse.wst.server.core 4 0 2006-07-20 15:40:58.745\n!MESSAGE Error occurred installing server: Could not download and install update feature.\n!STACK 1\norg.eclipse.core.runtime.CoreException: Could not download and install update feature.\n at org.eclipse.wst.server.core.internal.InstallableServer.install(InstallableServer.java:166)\n at org.eclipse.wst.server.ui.internal.wizard.NewInstallableServerWizard$5.run(NewInstallableServerWizard.java:120)\n at org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)\n!SUBENTRY 1 org.eclipse.wst.server.core 4 0 2006-07-20 15:40:58.755\n!MESSAGE Could not download and install update feature.\n\nI can get the the URL:\nonhttp://apache.sunsite.ualberta.ca/geronimo/eclipse/updates/\nusing a browser. \n\nThis link used to be fine when I tried it in WTP 1.5 RC6 timeframe about a month ago.\n\nSachin indicated that it works ok using the update manager, so theres something wrong with either the installable server ext point in wtp, or the installable server code.\n\n\n",
    "Hi Kathy,\n\n1) You opened this bug for the adding the Geronimo 1.1 download. If you\u0027re having other problems, please open another bug.\n\n2) The error message you posted is from the Eclipse update API, same as what update manager is using. This is not a WTP bug, and the problem is probably related to the error message: \"feature cannot be found on [site listed] or a newer version is already installed.\"",
    "Actually Tim, I\u0027m thinking you don\u0027t add both 1.0 and 1.1 individually since 1.1 feature includes 1.0 support as well.  So I wonder if it would just make sense to have 1 extension point that points to the 1.1 feature but in the version attribute put \"1.x\".  Unless of course putting 1.x would cause a technical problem and not just used for display purposes.  Tim can u recall of the top of your head?\n\nAs far as the other problem, Kathy yes please open another defect and I will invesitage.  Since installing the feature using the update manager directly works fine, there must be something wrong with the installable runtime support.",
    "So you essentially have two server adapters in the same feature? Matching on when/what to show in the installable wizard is done based on the server id, so I think that I still need both installable servers (so that they both show up in the UI), but I should change the 1.0 Geronimo support to download the 1.1 feature. That way the user will see both listed, but when they download either they\u0027ll get the latest feature with both adapters, and the installable wizard will no longer list either of them.",
    "Since I went though a complete plugin rename for 1.1 and a bunch of refactoring, so yes, the 1.1 feature includes 1.0 + 1.1 support.  But based on your comments, ok, add them both.",
    "Bug 151403 opened to track the problem identified in Comment #9.  Sachin, please investigate what\u0027s wrong with using the link to download Geronimo plugin.  Thanks!",
    "Released for the next WTP 1.5.1 \u0026 2.0 builds.",
    "Verified on WTP 1.5.1 09071217 driver.",
    "Closing.",
    "This is part of a \"mass update\" where bugs showing \"fixed\" between 7/1/2006 and 9/27/2006 are assumed fixed in WTP 1.5.1. feel free to change the target milestone if you know a more accurate setting. "
  ],
  "commentCreationDates": [
    "2006-07-01T03:58:54+02:00",
    "2006-07-07T19:59:31+02:00",
    "2006-07-17T18:21:44+02:00",
    "2006-07-18T22:32:36+02:00",
    "2006-07-18T23:02:08+02:00",
    "2006-07-18T23:11:55+02:00",
    "2006-07-18T23:32:11+02:00",
    "2006-07-19T16:30:32+02:00",
    "2006-07-20T15:54:53+02:00",
    "2006-07-20T22:16:17+02:00",
    "2006-07-20T22:24:38+02:00",
    "2006-07-20T22:37:51+02:00",
    "2006-07-20T23:03:46+02:00",
    "2006-07-21T01:19:14+02:00",
    "2006-07-21T15:30:20+02:00",
    "2006-07-26T17:34:22+02:00",
    "2006-09-14T22:45:10+02:00",
    "2006-09-21T20:24:45+02:00",
    "2006-09-27T15:07:22+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.core.runtime.CoreException",
      "message": "Could not download and install update feature.",
      "elements": [
        {
          "method": "org.eclipse.wst.server.core.internal.InstallableServer.install",
          "source": "InstallableServer.java:166"
        },
        {
          "method": "org.eclipse.wst.server.ui.internal.wizard.NewInstallableServerWizard$5.run",
          "source": "NewInstallableServerWizard.java:120"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 9,
      "bugId": "149354",
      "date": "2006-07-20T22:16:17+02:00",
      "product": "Web Tools",
      "component": "wst.server",
      "severity": "enhancement"
    }
  ],
  "groupId": "149354",
  "bugId": "149354",
  "date": "2006-07-01T03:58:54+02:00",
  "product": "Web Tools",
  "component": "wst.server",
  "severity": "enhancement"
}