{
  "comments": [
    "Got this error on synchronizing some Jira queries after updating to Mylar 0.6\n\njava.lang.NullPointerException\nat org.eclipse.mylar.internal.jira.JiraRepositoryConnector.updateTaskDetails(JiraRepositoryConnector.java:264)\nat org.eclipse.mylar.internal.jira.JiraRepositoryConnector.performQuery(JiraRepositoryConnector.java:188)\nat org.eclipse.mylar.provisional.tasklist.SynchronizeQueryJob.run(SynchronizeQueryJob.java:75)\nat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)",
    "Fix should be really easy, though I don\u0027t understand why it is null there",
    "Could have been an issue with no known type (since we cache all types when the connection is first created).  Would you know if a new issue type was added to Jira?\n\nIt might be possible to turn off caching for servers \u003e 3.5 as we can more efficiently get a list of projects (although it still doesn\u0027t scale well)",
    "I guess it is possible that some types had been added and others removed. There was some reorganization on that Jira server... In any case it should not fail like this, because query won\u0027t reaturn any result in this case. Maybe core services should return special type (unknown) for artefacts that are not known...",
    "yes it could return a placeholder issue type.  I think this is already done for versions and components.\n\nThe real solution is to have a single rpc query to get all of the product configuration information at once.  At the moment (at least on my machine) it takes about 500ms per call to connect and get under 1kb of data (my ISP forces me to use a proxy, so i can\u0027t use HTTP/1.1 connection keep alives).  To get all of the info of the server you have to do this twice for each project (versions and components) plus once each for all of the other details (issue types, sub issue types, priorities, severities, project list, server info, etc).  Having a single request that is run through a GZip filter would bring this down to almost nothing.",
    "(In reply to comment #4)\n\u003e yes it could return a placeholder issue type.  I think this is already done for\n\u003e versions and components.\n\nSo, can you made this fix then?\n\nIn a mean time can you please tell me how to clear that project data?\n\n\u003e The real solution is to have a single rpc query to get all of the product\n\u003e configuration information at once.  At the moment (at least on my machine) it\n\u003e takes about 500ms per call to connect and get under 1kb of data (my ISP forces\n\u003e me to use a proxy, so i can\u0027t use HTTP/1.1 connection keep alives).  To get all\n\u003e of the info of the server you have to do this twice for each project (versions\n\u003e and components) plus once each for all of the other details (issue types, sub\n\u003e issue types, priorities, severities, project list, server info, etc).  Having a\n\u003e single request that is run through a GZip filter would bring this down to\n\u003e almost nothing.\n\nRight. But that won\u0027t work for any Jira installation... I have 3.6.2-#156 there.",
    "Fixed in jira.core http://developer.atlassian.com/jira/browse/JDB-113\n\nThere is a method offered on JiraServer to fully reload the cache, but i don\u0027t think mylar exposes this anywhere.  If you have Jira dashboard installed you just edit the server details and save.  You can also delete the server completely by removing the definition from \u003cworkspace\u003e/.metadata/.plugins/org.tigris.jira.core/serverCache but this will most likely upset Mylar.\n\nMik, do you want to close this one since it is fixed downstream?",
    "We need cross-repository dependencies ;)  For now yes, please post on this report when it is fixed.  Perhaps this and the error handling would make for a Jira Core Services 0.9.2? \n\nBut before we close this, how about we add an \"Update Repository Settings\" action to the Task Repositories view, which will trigger a manual reset to deal with problems like this?  Note that we already have them on the pages for creating/editing queries for both Bugzilla and JIRA, but that\u0027s too burried.",
    "Done, there is now an \"Update Attributes\" button that will force a reset/update of the repository settings.",
    "Created an attachment (id\u003d47053)\nmylar/context/zip\n\n"
  ],
  "commentCreationDates": [
    "2006-07-04T00:12:11+02:00",
    "2006-07-04T00:17:04+02:00",
    "2006-07-04T00:32:48+02:00",
    "2006-07-04T00:36:08+02:00",
    "2006-07-04T01:06:37+02:00",
    "2006-07-04T01:58:49+02:00",
    "2006-07-04T11:27:44+02:00",
    "2006-07-05T00:12:44+02:00",
    "2006-07-31T09:12:48+02:00",
    "2006-07-31T09:15:32+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.mylar.internal.jira.JiraRepositoryConnector.updateTaskDetails",
          "source": "JiraRepositoryConnector.java:264"
        },
        {
          "method": "org.eclipse.mylar.internal.jira.JiraRepositoryConnector.performQuery",
          "source": "JiraRepositoryConnector.java:188"
        },
        {
          "method": "org.eclipse.mylar.provisional.tasklist.SynchronizeQueryJob.run",
          "source": "SynchronizeQueryJob.java:75"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "149499",
      "date": "2006-07-04T00:12:11+02:00",
      "product": "Mylyn",
      "component": "Jira",
      "severity": "normal"
    }
  ],
  "groupId": "149499",
  "bugId": "149499",
  "date": "2006-07-04T00:12:11+02:00",
  "product": "Mylyn",
  "component": "Jira",
  "severity": "normal"
}