{
  "comments": [
    "Got this error after upgrading to Mylar 0.6 when trying to edit existing custom jira query. Strange thing is that credentials are valid according to the \"validate\" check on repository configuration wizard.\n\nJira Authentication Failed.\nPlease check your Jira username and password in the Task Repositories view\n\norg.tigris.jira.core.service.exceptions.AuthenticationException\n\tat org.tigris.jira.internal.core.service.soap.SoapJiraService.getSavedFilters(SoapJiraService.java:326)\n\tat org.tigris.jira.core.service.CachedRpcJiraServer.getNamedFilters(CachedRpcJiraServer.java:464)\n\tat org.eclipse.mylar.internal.jira.ui.wizards.JiraQueryWizardPage$3.run(JiraQueryWizardPage.java:182)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)",
    "You should only be getting authentication failures when we try to get a login token, which is done before the call to get saved filters.  It almost looks like the server forgot about your token.\n\nDoes it do this all the time?\n\nIf this doesn\u0027t happen all the time, could you tell me what the session timeout is on the Jira Server?  We currently get a new login token after 10 minutes of inactivity.  Perhaps this needs to be lowered.",
    "(In reply to comment #1)\n\u003e Does it do this all the time?\n\nIt look like it. I\u0027ve restarted Eclipse several times since then and still getting it. List of saved filters is not being populated after that.\n\n\u003e If this doesn\u0027t happen all the time, could you tell me what the session timeout\n\u003e is on the Jira Server?  We currently get a new login token after 10 minutes of\n\u003e inactivity.  Perhaps this needs to be lowered.\n\nHow do I check that?",
    "Hmm. Now this error is gone. Few restarts probably helped after all...",
    "Sheesh, that\u0027s not a good note to resolve a bug on ;)  I guess that this sounds like a credentials caching issue since the restarts \u0027solved\u0027 it.\n\nBrock: what if we flush/reset the credentials after the validation step?  Could we get a method to do that?",
    "Restarting eclipse should be enough.  We do not cache login tokens across sessions.\n\nYou would have to ask the admin to find the session timeout for you.  It will depend on which appserver or servlet container it is deployed on.\n\nValidate connection doesn\u0027t use a server instance, but the token should be reset when the username or password is changed for a server.  This is currently not being done (but this isn\u0027t the same issue you are seeing).",
    "I am seeing this again. Probably Brock is right and it is something around caching... I wonder if caching can be flushed off on such error in this place and retried second time...",
    "What would be more simple to start is to catch that exception and then pop up a dialog instructing the user to reset the server information if this happens. \n\nBrock, could you add a such a flush to JiraServer.refreshDetails(), perhaps renaming the method to JiraServer.reset()?  Then I can add it as an action to the Task Rrepositories view.",
    "(In reply to comment #7)\n\u003e Brock, could you add a such a flush to JiraServer.refreshDetails(), perhaps\n\u003e renaming the method to JiraServer.reset()?  Then I can add it as an action to\n\u003e the Task Rrepositories view.\n\u003e \n\nnot to sound rude, but no :)\n\nI will make it clear the login token whenever we get an authentication error when calling a remote function.  This way it will try to login again when you retry the operation.  No need for calling code to refresh all server details.\n\nI will also reduce the session timeout from 10 minutes to 1 minute.  This should cover most setups.\n\nEugene, does restarting Eclipse make the problem go away (for a while)?",
    "Eugene: is this still a problem?",
    "Haven\u0027t seen it for some time now.",
    "Closing as not reproduceable."
  ],
  "commentCreationDates": [
    "2006-07-04T01:57:21+02:00",
    "2006-07-04T11:40:30+02:00",
    "2006-07-04T15:43:50+02:00",
    "2006-07-04T18:24:00+02:00",
    "2006-07-04T22:36:47+02:00",
    "2006-07-04T22:52:26+02:00",
    "2006-07-05T00:25:14+02:00",
    "2006-07-05T18:54:18+02:00",
    "2006-07-06T12:37:14+02:00",
    "2006-10-20T08:48:24+02:00",
    "2006-10-20T16:26:46+02:00",
    "2006-10-22T18:50:59+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.tigris.jira.core.service.exceptions.AuthenticationException",
      "elements": [
        {
          "method": "org.tigris.jira.internal.core.service.soap.SoapJiraService.getSavedFilters",
          "source": "SoapJiraService.java:326"
        },
        {
          "method": "org.tigris.jira.core.service.CachedRpcJiraServer.getNamedFilters",
          "source": "CachedRpcJiraServer.java:464"
        },
        {
          "method": "org.eclipse.mylar.internal.jira.ui.wizards.JiraQueryWizardPage$3.run",
          "source": "JiraQueryWizardPage.java:182"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "149503",
      "date": "2006-07-04T01:57:21+02:00",
      "product": "Mylyn",
      "component": "Jira",
      "severity": "major"
    }
  ],
  "groupId": "149503",
  "bugId": "149503",
  "date": "2006-07-04T01:57:21+02:00",
  "product": "Mylyn",
  "component": "Jira",
  "severity": "major"
}