{
  "comments": [
    "On the AIX platform, consecutive exectuions of a \u0027Test\u0027 result in refused connections from the agent controller.  When using a consuming product the problem appears to be worse and the refused connections occur after a smaller number of executions.\n\nUsing the TPTP Test provided, the failure occurs after about 20-30 invocations.\nUsing Rational Peformance Tester, the failure occurs after about 5-10 invocations.\n\nThis is a critical defect because unless it is fixed, Rational Performance Tester will not be able to support the AIX platform.",
    "The same problem exists in TPTP 3.3",
    "Created an attachment (id\u003d45918)\ntest assets\n\n",
    "When the problem occurs, the workbench will display a \u0027connection refused\u0027 message and if you type netstat -a on the AIX machine and grep for \u002710002\u0027 you\u0027ll at least one connection that was established with the workbench in the \u0027CLOSE_WAIT\u0027 state.",
    "Someone from agent controller component needs to take a look it. I suspect it is related to RAC, but execution framework is still a possibity.\n\nIn response to Comment #4:\nIs the connection refused symptom transient - meaning the connection is refused initially and but is successful on reattemt after a small delay?",
    "Once the refused connection symptom occurs, it is persistent.  The agent controller must be restarted to clear the condition.",
    "Created an attachment (id\u003d46737)\nTest Suite\n\n",
    "I *sat* down with Todd and we tried to reproduce the scenario using TPTP 4.2 (0711) and a TPTP 4.2 GA RAC.  We were unable to reproduce the scenario.\n\nTodd tried on his machine and was unable to reproduce the scenario again.  Closing for now as not reproducible.  I\u0027ve attached the workspace of the tests I used in my investigation here too in Comment #6.\n\nBob please close this defect as WORKSFOREME.",
    "Closing as per Ashish\u0027s comment and with Todd\u0027s concurrence. \n\nThere is still possibly a problem with a proprietary extension of the TPTP RAC and that continues to be pursued through other channels.",
    "This defect was reproduced with the TPTP 4.2 GA AIX Agent Controller using Rational Performance Tester.\n\nHere\u0027s a section of the .log file from Eclipse when the error occurs:\n\n!STACK 0\norg.eclipse.hyades.execution.core.DaemonConnectException\n\tat org.eclipse.hyades.execution.local.NodeImpl._connect(Unknown Source)\n\tat org.eclipse.hyades.execution.local.NodeImpl.connect(Unknown Source)\n\tat org.eclipse.hyades.execution.local.HyadesTestNodeImpl.connect(Unknown Source)\n\tat org.eclipse.hyades.execution.harness.TestExecutionHarness$4.run(Unknown Source)\n\tat java.lang.Thread.run(Thread.java:816)\nCaused by: org.eclipse.hyades.internal.execution.local.control.NotConnectedException\n\tat org.eclipse.hyades.internal.execution.local.control.ProcessImpl.launch(Unknown Source)\n\tat org.eclipse.hyades.execution.local.NodeImpl._connect(Unknown Source)\n\tat org.eclipse.hyades.execution.local.NodeImpl.connect(Unknown Source)\n\tat org.eclipse.hyades.execution.local.HyadesTestNodeImpl.connect(Unknown Source)\n\tat org.eclipse.hyades.execution.harness.TestExecutionHarness$4.run(Unknown Source)\n\tat java.lang.Thread.run(Thread.java:816)\n\n!ENTRY org.eclipse.core.runtime 4 2 Jun 29, 2006 13:36:06.437\n!MESSAGE An internal error occurred during: \"j1\".\n!STACK 0\njava.lang.NullPointerException\n\tat org.eclipse.hyades.execution.harness.TestExecutionHarness$2.run(Unknown Source)\n\tat org.eclipse.core.internal.jobs.Worker.run(Unknown Source)\n\n!ENTRY org.eclipse.hyades.test.ui 4 0 Jun 29, 2006 13:36:21.421\n!MESSAGE IWAT4039E The Test Execution Harness reported the following problems: org.eclipse.core.runtime.CoreException\n!STACK 1\norg.eclipse.core.runtime.CoreException: IWAT4039E The Test Execution Harness reported the following problems: Connection refused on host aixsrv22.\n\tat org.eclipse.hyades.test.ui.launch.delegates.AbstractLaunchConfigurationDelegate2.launch(Unknown Source)\n\tat org.eclipse.debug.internal.core.LaunchConfiguration.launch(Unknown Source)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch(Unknown Source)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin$6.run(Unknown Source)\n\tat org.eclipse.core.internal.jobs.Worker.run(Unknown Source)",
    "Changed severity to critical according to decision with Todd/Kent.",
    "This is now reproducible here as well as at Todd\u0027s site and it now occurs at fairly low repetitions (\u003c5) with TPTP 4.2.1 agent controller. I am increasing the severity to Blocker as per Todd\u0027s request.",
    "Investigation shows a potential deadlock in the AIX system call shutdown(). Here is a printout from my debug trace:\n\nMUTEX: scrubAllProcesses() entering process_list lock\nDEBUG: scrubAllProcesses() current !\u003d NULL\nDEBUG: scrubAllProcesses() pid \u003d 16556\nDEBUG: scrubAllProcesses() check if process is alive\nMUTEX: scrubAllProcesses() exitng process_list lock\nMUTEX: scrubAllProcesses() entering process_list lock\nDEBUG: scrubAllProcesses() current !\u003d NULL\nDEBUG: scrubAllProcesses() pid \u003d 16556\nDEBUG: scrubAllProcesses() check if process is alive\nDEBUG: scrubAllProcesses() process is not alive\nDEBUG: scrubAllProcesses() calling scrubProcess()\nDEBUG: scrubProcess() check waiting_clients\nDEBUG: scrubProcess() sending RA_PROCESS_EXITED to detached client (2)\nDEBUG: scrubProcess() RA_PROCESS_EXITED sent\nDEBUG: scrubProcess() trying to close console socket\nDEBUG: ra_closeSocket() tries to call shutdown()\n\nThe scrubAllProcesses() function has obtained the process list lock and cannot release it since the current thread is stuck at the shutdown() call on the console socket. Removing the shutdown() call will leave those sockets in the FIN_WAIT_2 state. With the process list lock being held, subsequent operation involving the process list will fail (such as launching a process).\n",
    "Samson, good progress.   Is it possible to break out of the shutdown() call with a timer (SIGALRM signal)?  If so, what state does that leave the socket in?",
    "Created an attachment (id\u003d48402)\nPotential fix for the problem - testing required\n\nThere seems to be an uninitialized variable (in the RAC\u0027s process record) that is a problem during process cleanup. The attached RAServer fixes that problem. Initial testing here (of the RPT case with Todd\u0027s automation) is successful. Bob is doing a stress test here. If/when that is successful, we will ask Todd to do a full stress test there with theattached RAC.",
    "I\u0027ll should have some results later this evening.  I\u0027m starting a run now.",
    "Our stress test produces a \"Connection refused\" at the workbench after 65 repetitions of the RPT test using Todd\u0027s automation (was failing solidly after 4 or 5 prior to this fix).  Let\u0027s see what Todd\u0027s test shows.",
    "I experienced the \u0027connection refused\u0027 message after 34 invocations.",
    "Hi Todd. Is it possible for you to give us the following traces when it hits the \"connection refused\"?\n1. netstat -a\n2. lsof -l | grep RAServer (may need to run as root)\n3. config/servicelog.log\n\nThanks.\n",
    "I have been running tests all day.  I have yet to experience the \u0027connection refused\u0027 message again.  I\u0027ve run approx. 150 invocations today without the error.  I\u0027m OK with downgrading the severity of this defect if the fix is delivered.  I\u0027ll continue to run tests overnight.",
    "This fix has been regression tested on AIX and Linux32 without issue. It is now ready for approval request. I am attaching the approval request here and also re-assigning to Samson (with his agreement and because it is now his fix on his component).",
    "Created an attachment (id\u003d48775)\nApproval Request (according to usual template)\n\n",
    "The key to the explanation of the problem/fix is in comment #12 (and to some extent comment #14) but I admit they are buried in this saga and not necessarily complete (as per Harm\u0027s and others\u0027 concern). Here\u0027s an attempt to sum up. \n\nThe big picture is that there was an uninitialized variable that caused a hang that translated into a \"connection refused\" condition. The fix is to initialize that variable to -1. Details follow.\n\nSpecifically, the lock for the RAC\u0027s process list was obtained and held while a given process was scrubbed. The given process happened to have no console socket which should\u0027ve been signified as a value of -1 for the console socket id in the RAC\u0027s record of the process but instead was an arbitrary value because it was uninitialized by mistake. During the process scrub, a socket shutdown() call, which should\u0027ve been skipped in such a case based on console socket id being -1, was issued using the uninitialized value for the console socket id. That shutdown call hung and left that RAC thread holding the process list lock. The RAC then hung on the next process list operation needing the lock (eg: a process launch) and the \"Connection Refused\" error occurred. \n\nThe problem occurred on AIX only and only intermittently there. Presumably the shutdown call on other platforms protected against erroneous arguments better (eg: ensuring the socket id argument was in the occupied or permitted range) and/or the uninitialized socket id happened to be a \"luckier\" value there.\n\nWhether this uninitialization problem was always the cause of the \"Connection refused\" errors that were observed is not certain because the problem was so intermittent and sensitive to tracing and other things. However, it was certainly responsible for some (and maybe other intermittent mis-behaviors in the past). It has also been established by testing that this fix at least greatly reduces the frequency of the problem and may altogether eliminate it. It is on that basis that approval has been sought.\n\nThe fix is a one-line change. We propose to make it applicable to all platforms (even though the failure was only on AIX) because the existing behavior on the other platforms is so dangerous and the fix is so limited in scope. We have run full auto-test with a patched RAC on two platforms with no regressions.  ",
    "In response to comment # 22:\n\nThe summary and explanation of root cause are very helpful. It is important to know that the symptom \"Connection Refused\" is not seen after applying the proposed fix. Can you confirm if this is true?\n\n\n",
    "Comments 16 \u0026 17 indicate that the test failed after larger number of attmpets than before. Subsequently comments 19 \u0026 20 indicate that testing was successfull. Does this mean, the fix is known to fail sometimes?",
    "Sri, \n\nComments #16, 17, 19 indicate that the current fix certainly works on one source of the error but there are likely others that remain. We are retesting now to quantify the degree of improvement but it is certainly substantial and worthwhile. Todd has confirmed that it will be sufficient for them to support AIX. We continue to debug the remaining \"connection refused\" conditions.\n\nComment #20 primarily means that the fix did not cause any regression. Secondarily, it means that no \"Connection Refused\" errors occurred in the automated bucket. It does not mean that Todd\u0027s scenarios always run without that error.",
    "Bob and Samson, \n\nEarlier I asked that this bug be kept open pending furhter investigation by you. Do you have an update? If nothing more can be done for 4.2.1, then it is better to close this out to record the fix that was already committed.\n\nA new defect should be opened for any remaining failures.",
    "As the submitter of this defect, I\u0027m OK with resolving it for now.  I have tested it in a manner consistent with how end users would run our product and not observed a failure yet.  \n",
    "Marking this bug as fixed for 4.2.1. Please open a new bug for the remaining failures if any. Thanks."
  ],
  "commentCreationDates": [
    "2006-07-07T15:36:43+02:00",
    "2006-07-07T15:39:01+02:00",
    "2006-07-07T15:42:36+02:00",
    "2006-07-07T16:01:41+02:00",
    "2006-07-11T18:53:47+02:00",
    "2006-07-11T19:03:14+02:00",
    "2006-07-25T00:56:58+02:00",
    "2006-07-25T00:57:35+02:00",
    "2006-07-26T01:15:11+02:00",
    "2006-07-28T04:46:48+02:00",
    "2006-07-29T00:07:24+02:00",
    "2006-08-11T00:39:58+02:00",
    "2006-08-21T20:48:42+02:00",
    "2006-08-21T21:32:59+02:00",
    "2006-08-22T20:43:10+02:00",
    "2006-08-22T22:53:36+02:00",
    "2006-08-22T23:28:09+02:00",
    "2006-08-23T14:35:43+02:00",
    "2006-08-23T15:01:26+02:00",
    "2006-08-24T04:55:47+02:00",
    "2006-08-25T22:21:39+02:00",
    "2006-08-25T22:23:19+02:00",
    "2006-08-29T00:59:14+02:00",
    "2006-08-29T02:15:54+02:00",
    "2006-08-29T18:02:04+02:00",
    "2006-08-31T00:14:22+02:00",
    "2006-09-08T15:49:41+02:00",
    "2006-09-08T16:15:25+02:00",
    "2006-09-08T16:20:59+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.hyades.execution.core.DaemonConnectException",
      "elements": [
        {
          "method": "org.eclipse.hyades.execution.local.NodeImpl._connect",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.hyades.execution.local.NodeImpl.connect",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.hyades.execution.local.HyadesTestNodeImpl.connect",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.hyades.execution.harness.TestExecutionHarness$4.run",
          "source": "Unknown Source"
        },
        {
          "method": "java.lang.Thread.run",
          "source": "Thread.java:816"
        }
      ],
      "causedBy": {
        "exceptionType": "org.eclipse.hyades.internal.execution.local.control.NotConnectedException",
        "elements": [
          {
            "method": "org.eclipse.hyades.internal.execution.local.control.ProcessImpl.launch",
            "source": "Unknown Source"
          },
          {
            "method": "org.eclipse.hyades.execution.local.NodeImpl._connect",
            "source": "Unknown Source"
          },
          {
            "method": "org.eclipse.hyades.execution.local.NodeImpl.connect",
            "source": "Unknown Source"
          },
          {
            "method": "org.eclipse.hyades.execution.local.HyadesTestNodeImpl.connect",
            "source": "Unknown Source"
          },
          {
            "method": "org.eclipse.hyades.execution.harness.TestExecutionHarness$4.run",
            "source": "Unknown Source"
          },
          {
            "method": "java.lang.Thread.run",
            "source": "Thread.java:816"
          }
        ],
        "number": 0,
        "commentIndex": 0
      },
      "number": 0,
      "commentIndex": 9,
      "bugId": "149971",
      "date": "2006-07-28T04:46:48+02:00",
      "product": "TPTP Agent Controller",
      "component": "Platform.Communication",
      "severity": "blocker"
    },
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.hyades.execution.harness.TestExecutionHarness$2.run",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Unknown Source"
        }
      ],
      "number": 1,
      "commentIndex": 9,
      "bugId": "149971",
      "date": "2006-07-28T04:46:48+02:00",
      "product": "TPTP Agent Controller",
      "component": "Platform.Communication",
      "severity": "blocker"
    },
    {
      "exceptionType": "org.eclipse.core.runtime.CoreException",
      "message": "IWAT4039E The Test Execution Harness reported the following problems: Connection refused on host aixsrv22.",
      "elements": [
        {
          "method": "org.eclipse.hyades.test.ui.launch.delegates.AbstractLaunchConfigurationDelegate2.launch",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.debug.internal.core.LaunchConfiguration.launch",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin$6.run",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Unknown Source"
        }
      ],
      "number": 2,
      "commentIndex": 9,
      "bugId": "149971",
      "date": "2006-07-28T04:46:48+02:00",
      "product": "TPTP Agent Controller",
      "component": "Platform.Communication",
      "severity": "blocker"
    }
  ],
  "groupId": "149971",
  "bugId": "149971",
  "date": "2006-07-07T15:36:43+02:00",
  "product": "TPTP Agent Controller",
  "component": "Platform.Communication",
  "severity": "blocker"
}