{
  "comments": [
    "Scenario: Some author has created a plugin which contains a JAR. In this JAR are classes which require Java 1.5.\n\nWhen the plugin is loaded, everything seems to be OK: The menus are there, actions, etc.\n\nWhen the plugin is used for the first time, the user gets ClassNotFoundException which is confusing because the class is actually in the classpath; it\u0027s just that the classload can\u0027t load it because of a version problem.\n\nExample stacktrace:\n\njava.lang.ClassNotFoundException:\ncom.neusoft.ezingbuilder.designer.editors.HtmlFckDesignerMultiPageEditor\nat\norg.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:407)\nat\norg.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:352)\nat\norg.eclipse.osgi.internal.baseadaptor.DefaultClassLoader.loadClass(DefaultClassLoader.java:83)\nat java.lang.ClassLoader.loadClass(Unknown Source)\n\nIt would be great if Equinox could throw an IncompatibleRuntimeException instead saying \"Cannot load com.neusoft.ezingbuilder.designer.editors.HtmlFckDesignerMultiPageEditor because it requires Java 1.5 and the current JRE is only 1.4\".\n\nIf possible, implement this in such a way that it also works for older Java releases.",
    "The plugin should specify Bundle-RequiredExecutionEnvironment: J2SE-1.5 in its bundle\u0027s manifest to signify that the plugin should not be resolved unless the JRE is at least 1.5.",
    "I agree with you BJ, but unfortunately there is a bunch of plug-ins out there that have be written before we promote the usage of execution environment and therefore a better message could be good. \nCould not we create subclasses of ClassNotFoundException to be more clear about the cause of the failure?\n",
    "The class loader would have to look at the class file version number in the class file bytecodes (assuming it has them; some non-JAR formats no longer have byte codes) and then attempt to compare the class file version number against the current JRE to decide if the JRE cannot handle the class file version. Kind of ugly code.\n\nI am not sure why the VM does not complain properly about this in the exception message when ClassLoader.defineClass is asked to reify the class object (I would assume the VM would throw an Error and not an exception)? Perhaps that info is lost or nested in the thrown ClassNotFoundException.",
    "I would expect a UnsupportedClassVersionError to be thrown not a ClassNotFoundException.  The error should bubble up the stack and be used to give you some indication of what when wrong.  Please attach a testcase that we can reproduce the ClassNotFoundException when on 1.4 vs 1.5 VM.  I suspect something else is going on here. Thanks.",
    "Ok, here is what I did:\n\n- Install Suns JDK 1.4.2_08\n- Eclipse and the WTP plugings (from Callisto)\n- Get the plugin eZingBuilder from Sourceforge (http://sourceforge.net/project/showfiles.php?group_id\u003d146300)\n- Install it and try to open an empty .html-File with the new editor (use Open With...).\n\nSee also bug #150225",
    "I suspect the eZingBuilder bundle is not being successfully activated because of the UnsupportedClassVersionError that gets thrown while lazy activating it.  Can you attach the log file located at  \u003cworkspace folder\u003e/.metadata/.log to this bug report.  It should have a log entry with the UnsupportedClassVersionError in it.  Thanks.",
    "Created an attachment (id\u003d46290)\nLog file\n\nAs you can see, during plugin activation, there is a java.lang.UnsupportedClassVersionError: com/neusoft/ezingbuilder/designer/EZingDesignerPlugin\n\nBut the plugin is still installed! It would be better if the menus/actions/etc. just wouldn\u0027t be there when such an error happens.",
    "If eZingBuilder really needs J2SE-1.5 then it must state that in its Bundle-RequiredExecutionEnvironment header.  The platform could inspect every class at install time, but this would add a large amount of overhead.\n\nI\u0027m duping the ClassNotFoundException issue to bug 87859 because that bug addresses giving more information for the real cause of the class loading error.\n\n*** This bug has been marked as a duplicate of 87859 ***",
    "\u003e If eZingBuilder really needs J2SE-1.5 then it must state that\n\u003e in its Bundle-RequiredExecutionEnvironment header.\n\nThe reason for this report is that it took three people two days to figure out what\u0027s wrong.\n\nEquinox should either completely refuse to activate a plugins when it has errors during class instantiation or it should store the errors somewhere and display them when an action from the plugin is invoked.\n\nHaving half-activated plugins around is not good :-)"
  ],
  "commentCreationDates": [
    "2006-07-11T23:08:17+02:00",
    "2006-07-12T06:18:24+02:00",
    "2006-07-12T15:30:24+02:00",
    "2006-07-12T15:54:45+02:00",
    "2006-07-12T19:58:32+02:00",
    "2006-07-12T20:18:32+02:00",
    "2006-07-13T00:14:51+02:00",
    "2006-07-14T15:20:31+02:00",
    "2006-07-14T15:48:54+02:00",
    "2006-07-14T21:33:15+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "com.neusoft.ezingbuilder.designer.editors.HtmlFckDesignerMultiPageEditor",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:407"
        },
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:352"
        },
        {
          "method": "org.eclipse.osgi.internal.baseadaptor.DefaultClassLoader.loadClass",
          "source": "DefaultClassLoader.java:83"
        },
        {
          "method": "java.lang.ClassLoader.loadClass",
          "source": "Unknown Source"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "150318",
      "duplicateId": "87859",
      "date": "2006-07-11T23:08:17+02:00",
      "product": "Equinox",
      "component": "Framework",
      "severity": "normal"
    }
  ],
  "groupId": "87859",
  "bugId": "150318",
  "duplicateId": "87859",
  "date": "2006-07-11T23:08:17+02:00",
  "product": "Equinox",
  "component": "Framework",
  "severity": "normal"
}