{
  "comments": [
    "I tried to run the 3.2 swt tests on SLE_D 10 (SUSE Linux Enterprise Desktop).  Grant advised me to set \nMOZILLA_FIVE_HOME\u003d/usr/lib/xulrunner-1.8.0.1\n\nThe vm crashes when the test suite reaches the browser tests.  I will attach the stack trace.\n\nHere\u0027s some information about the versions of gtk etc on the machine.\n\nkmoir@relengbuildwin5:~\u003e rpm -qa | grep gtk-\ngtk-1.2.10-907.2\ndbus-1-gtk-0.60-33.2\ngtk-sharp-gapi-1.0.10-30.2\ngtk-sharp2-2.8.2-15.3\npython-gtk-2.8.2-21.2\ngtk-qt-engine-0.7cvs20060209-22.2\ngtk-sharp2-gapi-2.8.2-15.3\ngtk-engines-0.12-982.2\ngtk-sharp-1.0.10-30.2\nkmoir@relengbuildwin5:~\u003e rpm -qa | grep Mozilla\nMozillaFirefox-1.5.0.4-1.9\nMozillaFirefox-translations-1.5.0.4-1.9\nkmoir@relengbuildwin5:~\u003e rpm -qa | grep mozilla\nmozilla-nss-3.11-21.2\nmozilla-xulrunner-1.8.0.1-32.2\nmozilla-nspr-4.6.1-22.2\nkmoir@relengbuildwin5:~\u003e ls -l /usr/lib/xulrunner-1.8.0.1/\ntotal 14388\ndrwxr-xr-x 3 root root      416 2006-07-18 13:15 chrome\ndrwxr-xr-x 2 root root     5208 2006-07-18 13:15 components\ndrwxr-xr-x 5 root root      128 2006-07-18 13:15 defaults\n-rw-r--r-- 1 root root       57 2006-06-27 13:22 dependentlibs.list\ndrwxr-xr-x 2 root root       48 2006-06-27 13:22 extensions\n-rwxr-xr-x 1 root root    21852 2006-06-27 13:23 GenerateJavaInterfaces\n-rw-r--r-- 1 root root       18 2006-07-18 13:15 global.reginfo\ndrwxr-xr-x 2 root root      144 2006-07-18 13:15 greprefs\ndrwxr-xr-x 2 root root      144 2006-07-18 13:15 icons\n-rw-r--r-- 1 root root     4818 2006-06-27 13:22 javaxpcom.jar\n-rwxr-xr-x 1 root root   109532 2006-06-27 13:23 libgtkembedmoz.so\n-rwxr-xr-x 1 root root    41808 2006-06-27 13:23 libjavaxpcomglue.so\n-rwxr-xr-x 1 root root   548932 2006-06-27 13:23 libmozjs.so\n-rwxr-xr-x 1 root root     9204 2006-06-27 13:23 libxpcom.so\n-rwxr-xr-x 1 root root 13730708 2006-06-27 13:23 libxul.so\n-rwxr-xr-x 1 root root    30869 2006-06-27 13:22 LICENSE\n-rwxr-xr-x 1 root root    10744 2006-06-27 13:23 mozilla-xremote-client\ndrwxr-xr-x 2 root root      120 2006-07-18 13:15 plugins\n-rwxr-xr-x 1 root root     9542 2006-06-27 13:22 README.txt\ndrwxr-xr-x 6 root root     1808 2006-07-18 13:15 res\n-rwxr-xr-x 1 root root    10492 2006-06-27 13:22 run-mozilla.sh\ndrwxr-xr-x 5 root root      160 2006-07-18 13:15 simple\n-rwxr-xr-x 1 root root    62552 2006-06-27 13:23 updater\n-rwxr-xr-x 1 root root    23144 2006-06-27 13:23 xpicleanup\n-rwxr-xr-x 1 root root     8050 2006-06-27 13:22 xulrunner\n-rwxr-xr-x 1 root root    18832 2006-06-27 13:23 xulrunner-bin\n-rwxr-xr-x 1 root root    27424 2006-06-27 13:23 xulrunner-stub\nkmoir@relengbuildwin5:~\u003e\n\nI guess we would have install an older version of mozilla for the swt browser tests from 3.2 to work on this machine.",
    "Created an attachment (id\u003d46650)\nstack trace\n\n",
    "Also, I reran the browswer on this machine with the I20060718-0800 build and had the same issue.",
    "Suggest 3.2.1 as a target for this, per conversation with Steve.  But, because I am not the submitter nor a \"sufficiently empowered user\", I am unable to make this change.",
    "*** Bug 131098 has been marked as a duplicate of this bug. ***",
    "To update, though our unit tests fail, the Browser still works generally well on this platform.  The crash seems to happen as a result of disposing the browser\u0027s parent in its changed or changing callback.\n",
    "*** Bug 160392 has been marked as a duplicate of this bug. ***",
    "Has a bug against xulrunner been filed so that this gets fixed eventually?\n\nIt would be good to be able to run the swt tests on SLES 10 and RHEL 5, both of which contain xulrunner 1.8.0.1.",
    "This may be fixable in the Browser, as I\u0027ve found four more mozilla interfaces that have changed as of the mozilla 1.8 stream.  There\u0027s a reasonable chance that updating these will fix this problem (a similar fix was needed for bug 155404).  I\u0027ll look into this.\n",
    "Great ... can\u0027t wait.",
    "To update, it\u0027s not an interfaces issue (though the exercise did help me find another crash that is interfaces-related).\n\nCrashing as a result of disposing inside of a callback often indicates a bug in the event dispatcher (xulrunner).  But it\u0027s also possible that Browser shutdown is not being done fully/correctly; I\u0027ll investigate this next.\n",
    "Will this be fixed in 3.2.2?  We need support for SLED 10 on that code base.",
    "Will the fix in 3.2.x? \n",
    "We don\u0027t have a fix at this time.  Grant to investigate this for 3.2.x and HEAD.",
    "On further investigation there appears to be a binary incompatibility.  I see the tests crash when using the xulrunner that comes with SLED10, but the tests do not crash on SLED10 when I use a xulrunner (exact same version) that I compiled on RHEL4.\n\nI\u0027m waiting on a SLED10 CD from infra so that I can install the dev packages needed to try building swt\u0027s libraries on SLED10 instead of RHEL4, to see if this helps.\n",
    "The only thing I can think of is that SLED modified xulrunner or uses different compiler options.  When we have their exact source, we\u0027ll have something to test.",
    "Please keep me posted on the status of this.",
    "We have been working hard on this and getting nowhere.  Odds are low we will fix this for 3.2.2 as we don\u0027t yet have a fix for HEAD.\n\nGrant, what happens when you ldd both libraries?",
    "ldd\u0027ing the working and non-working libraries give the same set of referenced libraries.\n\nI believe that xulrunner\u0027s changed linking strategy necessitates that the Browser libs be linked differently.  I found a blog yesterday by Benjamin Smedberg indicating that library lookup can go wrong otherwise (http://benjamin.smedbergs.us/blog/2006-02-22/debian-versioning-of-mozilla-libraries-harmful/).  I tried using the suggested approach and it did not help, but I\u0027m continuing to investigate down this path.  I\u0027ll also be invoking SSQ if this is not resolved by the end of the week.\n\nReverting the milestone since this is not fixed in this morning\u0027s 3.2.2 build.\n",
    "One difference between the case that fails (SLED) and the case that works (compiled by us) is that notification comes in directly rather than getting posted for later in the event loop.\n\nFor example, invoking nsiWebNavigation.LoadURI() results in SetStatus() getting called back right away on XULRunner SLED, while on XULRunner \"compiled by us\" these callbacks only come in when we call g_main_context_iteration().  When either XULRunner or the GTK widget hierachy where XULRunner lives is disposed within a callback that is called right away, we crash.  This is what the SWT JUnit test cases are doing.\n\nSince Eclipse does not dispose of the browser control inside of SetStatus() or in other XULRunner call-in\u0027s, Eclipse does not crash.\n\nI propose that we don\u0027t need this fixed for 3.2.x.",
    "Our product which is based on Eclipse 3.2.2 will need this fix. Please consider fixing this problem",
    "It sure sounds to me like you\u0027re not dealing with exactly the same source that\nwas  used to build SLED 10.\n\nIs there some way you can check it?",
    "Cory, we are pretty sure.  We tried a binary from Mozilla and compiled the same source and the binary fails but our compiled one works.",
    "B. Chen, can you tell me where you are crashing?",
    "Any progress on this issue?\n\nI\u0027m wondering if possibly a different toolchain was used to build Mozilla before it was shipped.  Maybe a different rev of gcc/g++?",
    "Steve,\n\n  Could you please tell me what compiler and what options you use ?",
    "Grant has this information.",
    "Grant, could you please share that information with us ?",
    "The compiler options that the swt library are compiled with are (from make_linux.mak):\n\nMOZILLACFLAGS \u003d -O \\\n\t-DSWT_VERSION\u003d$(SWT_VERSION) \\\n\t-DMOZILLA_STRICT_API\u003d1 \\\n\t-fno-rtti \\\n\t-fno-exceptions \\\n\t-Wall \\\n\t-Wno-non-virtual-dtor \\\n\t-fPIC \\\n\t-I. \\\n\t-I$(JAVA_HOME)/include \\\n\t-I$(JAVA_HOME)/include/linux\nMOZILLALIBS \u003d -shared -Wl,--version-script\u003dmozilla_exports -Bsymbolic\n\nThe libs get compiled on RH3 and RH4 (hence the two swt-mozilla libs, one with gcc3 in its name) as a result of a binary incompatibility between the two.  The compilers on these setups are:\nRH3: gcc 3.2.3\nRH4: gcc 3.4.3\n\nIt was previously thought that the .mozconfig file used to compile the xulrunner that swt\u0027s libs are linked with could be relevant, but this does not seem to be the case anymore.  swt\u0027s libs are now linked against the xulrunner sdk, so swt no longer influence these libs at all since they come pre-compiled.\n",
    "Grant, does it mean that the swt libs in eclipse (3.2.2) distribution aren\u0027t correct ? ",
    "Not correct?  They have the behaviour that this report is tracking, if that\u0027s what you mean.\n",
    "You claim that I have to recompile swt libs in order to swt browser tests pass.\nCould you please upload these libraries.",
    "No, the tests do not crash if one of the following are true:\n1. the GRE being used at runtime is mozilla \u003c 1.8 (so pre-xulrunner), or\n2. the GRE being used at runtime is a xulrunner that has been compiled locally; to clarify the \"linking\" in the last paragraph of comment 28, I was referring to static linking that happens when swt\u0027s libraries are compiled, not runtime linking.\n\nTwo .mozconfigs have been used to compile xulrunners in scenario #2 above:\n\nmk_add_options MOZ_OBJDIR\u003d\u003clocation\u003e\nac_add_options --disable-optimize\nac_add_options --disable-debug\nac_add_options --disable-profilelocking\nac_add_options --enable-default-toolkit\u003dgtk2\nac_add_options --disable-freetype2\nac_add_options --disable-javaxpcom\nac_add_options --enable-application\u003dxulrunner\nmk_add_options MOZ_CO_PROJECT\u003dxulrunner\n\nand secondly, to match what official xulrunner builds use:\nexport MOZILLA_OFFICIAL\u003d1\nmk_add_options MOZILLA_OFFICIAL\u003d1\nmk_add_options MOZ_CO_PROJECT\u003dxulrunner\nmk_add_options MOZ_MAKE_FLAGS\u003d\"-j8\"\nac_add_options --enable-application\u003dxulrunner\nac_add_options --enable-svg\nac_add_options --enable-canvas\nmk_add_options MOZ_OBJDIR\u003d\u003clocation\u003e\n",
    "I have compiled cvs tag FIREFOX_2_0_0_1_RELEASE and it crashs\nUbuntu 6.06 , gcc 4.0.3\n\nbuildconfig\n\n--enable-application\u003dxulrunner --enable-default-toolkit\u003dgtk2 --disable-freetype2 --disable-otpimize --disable-profilelocking\n--disable-debug --disable-tests --disable-javaxpcom --enable-application\u003dxulrunner --enable-svg --enable-canvas\n\nI unpack swt.gtk and referenced libraries are correct (from my build).\nI will check with gcc-3.4, but I don\u0027t believe that it\u0027s compiler issue.\nGrant, could you please send buildconfig of your xulrunner build and tag version which you compile (you can got buildconfig with URL about:buildconfig) or if you have ready build.\n\nQ: is --disable-javaxpcom option important ? I have to use javaxpcom (atf).\n\n\n\n\n",
    "Both are XULRunner 1.8.0.1\n\n#1, compiled on RHEL4:\n\nCompiler  \tVersion  \tCompiler flags\ngcc \tgcc version 3.4.3 20041212 (Red Hat 3.4.3-9.EL4) \t-Wall -W -Wno-unused -Wpointer-arith -Wcast-align -Wno-long-long -pedantic -pthread -pipe\nc++ \tgcc version 3.4.3 20041212 (Red Hat 3.4.3-9.EL4) \t-fno-rtti -fno-exceptions -Wall -Wconversion -Wpointer-arith -Wcast-align -Woverloaded-virtual -Wsynth -Wno-ctor-dtor-privacy -Wno-non-virtual-dtor -Wno-long-long -pedantic -fshort-wchar -pthread -pipe -I/usr/X11R6/include\n\nConfigure arguments\n--disable-optimize --disable-debug --disable-profilelocking --enable-default-toolkit\u003dgtk2 --disable-freetype2 --disable-javaxpcom --enable-application\u003dxulrunner\n\n\n#2, compiled on SLED10:\n\nCompiler  \tVersion  \tCompiler flags\ngcc \tgcc version 4.1.0 (SUSE Linux) \t-Wall -W -Wno-unused -Wpointer-arith -Wcast-align -Wno-long-long -pedantic -pthread -pipe\nc++ \tgcc version 4.1.0 (SUSE Linux) \t-fno-rtti -fno-exceptions -Wall -Wconversion -Wpointer-arith -Wcast-align -Woverloaded-virtual -Wsynth -Wno-ctor-dtor-privacy -Wno-non-virtual-dtor -Wno-long-long -pedantic -fshort-wchar -pthread -pipe -I/usr/X11R6/include\n\nConfigure arguments\n--enable-application\u003dxulrunner --enable-svg --enable-canvas --disable-javaxpcom\n\n\nre: --disable-javaxpcom\nThat\u0027s a difference I had not considered.  I just tried a xulrunner 1.8.x built from source with javaxpcom enabled, and it crashed in the test.  So I\u0027ll build a 1.8.0.1 xulrunner with javaxpcom enabled to see whether javaxpcom or the newer xulrunner made the difference.\n",
    "The tests did not crash with xulrunner 1.8.0.1 compiled with javaxpcom enabled, so --disable-javaxpcom is not relevant.\n",
    "I have tried next :\n\n- firefox libraries from Ubuntu 6.06 installation (firefox 1.5.0.3, rv 1.8.0.3) and it crashs\n\n- download XULRUNNER_1_8_0_1_RELEASE from cvs and compile with Grant\u0027s .mozconfig\n(plus --enable-javaxpcom --enable-system-cairo, latest is obligate or xulrunner will not compile) and browser tests don\u0027t crash, but I have got 2 failures.\nThis is output :\n..F.....\n(SWT:18384): GLib-GObject-WARNING **: invalid uninstantiatable type `(null)\u0027 in cast to `GtkWidget\u0027\n\n(SWT:18384): Gdk-CRITICAL **: gdk_window_set_cursor: assertion `GDK_IS_WINDOW (window)\u0027 failed\n\n(SWT:18384): GLib-GObject-WARNING **: invalid uninstantiatable type `(null)\u0027 in cast to `GtkWidget\u0027\n\n(SWT:18384): Gtk-CRITICAL **: gtk_widget_hide: assertion `GTK_IS_WIDGET (widget)\u0027 failed\n\n(SWT:18384): GLib-GObject-WARNING **: invalid uninstantiatable type `(null)\u0027 in cast to `GtkWidget\u0027\n\n(SWT:18384): Gtk-CRITICAL **: gtk_widget_destroy: assertion `GTK_IS_WIDGET (widget)\u0027 failed\n.F.\nTime: 205.319\nThere were 2 failures:\n1) Browser2(org.eclipse.swt.tests.junit.browser.Test_BrowserSuite)junit.framework.AssertionFailedError\n\tat org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.Browser2(Test_BrowserSuite.java:49)\n\tat org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.runTest(Test_BrowserSuite.java:129)\n\tat org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.main(Test_BrowserSuite.java:31)\n2) Browser8(org.eclipse.swt.tests.junit.browser.Test_BrowserSuite)junit.framework.AssertionFailedError\n\tat org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.Browser8(Test_BrowserSuite.java:85)\n\tat org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.runTest(Test_BrowserSuite.java:135)\n\tat org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.main(Test_BrowserSuite.java:31)\n\nFAILURES!!!\nTests run: 9,  Failures: 2,  Errors: 0\n\n\nIt looks that browser only works with \u003c\u003d xulrunner 1.8.0.1 version.",
    "B. Chen, can you provide more information about the crash you are seeing?  The crash does not happen in the normal use of the Browser in Eclipse.  If we cannot fix it for 3.3, perhaps we can work around it in your code but we\u0027ll need more information.",
    "Steve N.,  B. Chen and I do not meet crash in the SLED10 with SWT3.3 GTK code. ",
    "Then this bug report does not capture the crash you were seeing because this problem still exists in 3.3.  It is very important to have a bug report that captures your failure.  That way, we know what we should be working on and we know when it\u0027s fixed.\n\nFrankly, I\u0027m quite angry.  We spent a lot of time (my time, Grant\u0027s time) working on this bug when we could have actually been addressing the failure you were seeing.  Who knows if it\u0027s really fixed.",
    "There is some disconnection here. We decided to use SWT3.3 in our product after we investigated swt3.2/3.3 browser implementations on Jan.2007. And from swt3.3M5, the swt.browser has major changes and now it supports Xulrunner/Firefox library well on both SLED10 \u0026 RedHat linux. \n\nThis bugzilla is opened and still under 3.2 stream, and is created by Kim Moir in other team,  so we think this bug report is to track the fix in swt 3.2 stream.\n\nSorry for any misunderstanding here!",
    "I still have not seen any bug reports that track the crashes you were seeing from your investigation of the \"swt3.2/3.3 browser implementations on Jan.2007\".  If you had entered some reports (rather than focusing in this bug report, that doesn\u0027t captuer the failure) we might have been able to roll the fixes into 3.2.",
    "We don\u0027t have a fix for this and are unlikely to have one for 3.3.  The problem happens because the browser is disposed in call-in (ie. when processing certain listeners).  If you do not have this pattern in your code, then you will not crash.  If you have this pattern, you can use Display.asyncExec() to dispose of the browser after the call-in has finished.\n\nI don\u0027t want to mark this as WONTIFIX because it is still a problem and we might find a creative solution one day, or figure out the compiler options that make it not run in call-in or ...\n\nUnless you have a specific case where you are crashing that we can investigate and help you with, then this bug should not stop you from shipping.",
    "My concern about this one is that it is causing a all of the swt tests to fail and it may be masking some other underlying problems.\n\nIs there some work-around that could be provided that disables the disposing of the browser, perhaps triggered by an environment variable setting, that would allow us to get through the swt tests?",
    "re: comment 43\n\nTo update, I made a fix about a week ago that makes all of the browser test suites run and pass on SLED10 except for #6 (of the 10 suites).  #6 could probably be changed to not crash; while this would be hiding the original problem, it would ensure that the tests all had a chance to run.\n",
    "(In reply to comment #44)\n\nGreat!\n\nWill that be in the next milestone build?",
    "The fix that lets all tests run and pass except for #6 is in 3.3M6.  Test #6 should be addressed before 3.3M7, hopefully with a fix rather than a test change.\n",
    "re: comment #46\n\nThanks for the info, Grant.\n\nI ran the entire test suite on 3.3M6 last night and am still seeing an empty resulting XML file for the swt suite.  Would you expect this behavior on M6 because #6 is failing?\n",
    "I believe so.  I\u0027m not sure how you\u0027re running the tests, here are my steps:\n\n- retrieve org.eclipse.swt, org.eclipse.swt.gtk.linux.\u003carch\u003e and org.eclipse.swt.tests from cvs and rename the .classpath_gtk file ( http://www.eclipse.org/swt/cvs.php )\n- comment out the line in Test_BrowserSuite.methodNames() that adds Browser6\n- select class AllBrowserTests, Run As -\u003e JUnit Test\n\nThis actually runs more Browser tests than the suites, but they should all pass for you once Browser suite #6 is commented out.\n",
    "Grant : could you pls attach the M7 patch (diff from M6) to this bug; and assess risk for backporting it back to M6 ?",
    "There isn\u0027t a fix that makes suite #6 work yet.  When this is done then I\u0027ll update here.  The fix that made the other suites work is in M6 already.\n",
    "To update, test #6 has been changed in HEAD to asyncExec its dispose, to ensure that it does not block the other tests from having a chance to run and pass/fail.\n"
  ],
  "commentCreationDates": [
    "2006-07-21T19:28:39+02:00",
    "2006-07-21T19:29:07+02:00",
    "2006-07-21T19:39:04+02:00",
    "2006-07-26T22:01:48+02:00",
    "2006-08-10T21:35:31+02:00",
    "2006-08-14T20:54:06+02:00",
    "2006-10-11T17:41:58+02:00",
    "2006-11-13T20:34:42+01:00",
    "2006-11-14T18:01:41+01:00",
    "2006-11-14T19:29:31+01:00",
    "2006-11-15T22:07:12+01:00",
    "2006-11-28T03:45:41+01:00",
    "2006-11-28T08:21:03+01:00",
    "2006-12-12T19:39:27+01:00",
    "2006-12-15T19:41:56+01:00",
    "2006-12-15T20:17:11+01:00",
    "2006-12-18T15:23:46+01:00",
    "2007-01-10T00:30:10+01:00",
    "2007-01-10T15:15:35+01:00",
    "2007-01-10T21:28:49+01:00",
    "2007-01-10T21:59:45+01:00",
    "2007-01-10T22:01:05+01:00",
    "2007-01-10T22:28:00+01:00",
    "2007-01-10T22:28:16+01:00",
    "2007-02-05T05:46:43+01:00",
    "2007-02-16T22:28:26+01:00",
    "2007-02-19T18:21:05+01:00",
    "2007-02-20T13:49:13+01:00",
    "2007-02-20T14:21:38+01:00",
    "2007-02-20T15:56:16+01:00",
    "2007-02-20T16:06:36+01:00",
    "2007-02-20T16:27:23+01:00",
    "2007-02-20T17:02:40+01:00",
    "2007-02-20T21:54:44+01:00",
    "2007-02-21T15:47:07+01:00",
    "2007-02-21T22:37:34+01:00",
    "2007-02-22T04:25:30+01:00",
    "2007-03-13T22:59:31+01:00",
    "2007-03-14T09:11:10+01:00",
    "2007-03-14T13:43:56+01:00",
    "2007-03-14T14:55:20+01:00",
    "2007-03-14T15:10:11+01:00",
    "2007-03-23T17:45:29+01:00",
    "2007-03-26T00:55:26+02:00",
    "2007-03-26T15:57:07+02:00",
    "2007-03-26T18:09:41+02:00",
    "2007-03-26T18:32:37+02:00",
    "2007-03-27T19:29:33+02:00",
    "2007-03-27T20:06:23+02:00",
    "2007-03-28T11:52:50+02:00",
    "2007-03-28T15:02:27+02:00",
    "2007-03-30T21:10:22+02:00"
  ],
  "traces": [
    {
      "exceptionType": "junit.framework.AssertionFailedError",
      "elements": [
        {
          "method": "org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.Browser2",
          "source": "Test_BrowserSuite.java:49"
        },
        {
          "method": "org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.runTest",
          "source": "Test_BrowserSuite.java:129"
        },
        {
          "method": "org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.main",
          "source": "Test_BrowserSuite.java:31"
        }
      ],
      "number": 0,
      "commentIndex": 36,
      "bugId": "151439",
      "date": "2007-02-22T04:25:30+01:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "major"
    },
    {
      "exceptionType": "junit.framework.AssertionFailedError",
      "elements": [
        {
          "method": "org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.Browser8",
          "source": "Test_BrowserSuite.java:85"
        },
        {
          "method": "org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.runTest",
          "source": "Test_BrowserSuite.java:135"
        },
        {
          "method": "org.eclipse.swt.tests.junit.browser.Test_BrowserSuite.main",
          "source": "Test_BrowserSuite.java:31"
        }
      ],
      "number": 1,
      "commentIndex": 36,
      "bugId": "151439",
      "date": "2007-02-22T04:25:30+01:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "major"
    }
  ],
  "groupId": "151439",
  "bugId": "151439",
  "date": "2006-07-21T19:28:39+02:00",
  "product": "Platform",
  "component": "SWT",
  "severity": "major"
}