{
  "comments": [
    "For example querying a private phpBB or vBulletin forum is not possible because authentication is not implemented.\n\nTo support adding login implementation to templates, maybe the extension point could optionally include a reference to a class that implements a certain interface. I imagine that making this very generic is quite a task, but it would be good to support at least the typical login scenario that asks for username \u0026 password and uses cookies for state -- at least phpBB and vBulletin usually work this way.\n\nI am willing to help with this, but I will be unavailable for the next 7 or 8 days. A working HttpClient cookie-based login implementation for phpBB and vBulletin can be found here: http://bbapi.tigris.org/source/browse/bbapi/trunk/ , in the org.tigris.bbapi.phpbb and org.tigris.bbapi.vbulletin plugins. vBulletin ( look in PHPBB.login(IBBCredentials) and the same method in the VBulletin class )",
    "Doesn\u0027t entering the credentials via the web browser work for the duration of the Eclipse session?  That has been my experience using Bugzilla and Jira in the web mode.\n\nNote that we\u0027re starting to upt some support for HttpClient connections in mylar.internal.tasks.core.WebClientUtil",
    "(In reply to comment #1)\n\u003e Doesn\u0027t entering the credentials via the web browser work for the duration of\n\u003e the Eclipse session?  That has been my experience using Bugzilla and Jira in\n\u003e the web mode.\n\nYes, but those are not used when fetching query results.",
    "(In reply to comment #2)\n\u003e (In reply to comment #1)\n\u003e \u003e Doesn\u0027t entering the credentials via the web browser work for the duration of\n\u003e \u003e the Eclipse session?  That has been my experience using Bugzilla and Jira in\n\u003e \u003e the web mode.\n\u003e \n\u003e Yes, but those are not used when fetching query results.\n\u003e \n\nentering credentials for sourceforge does not work for me, linux firefox 1.5. but that might be a linux browser problem, as it sometimes causes Eclipse to crash!\n",
    "(In reply to comment #3)\n\u003e entering credentials for sourceforge does not work for me, linux firefox 1.5.\n\u003e but that might be a linux browser problem, as it sometimes causes Eclipse to\n\u003e crash!\n\nCan you please clarify where you entering credentials? \n\nUser and password from repository dialog are not used right now, but Mylar does not allow to remove these fields from there for repository connector.\n\nHowever, browser could ask for credentials when entering some pages and is completely in the browser. Though as far as I recall, SF is using form-based auth, which is not needed to run queries, only when adding or editing issues.",
    "Ok, I finally have actual need for this and I\u0027m thinking it could be done like this: allow to specify via UI\n1) a login URL\n2) OPTIONAL: whether it should be a GET or POST request (just doing a POST is probably enough for all cases in reality)\n3) specify all GET/POST parameters as name/value pairs (the values could use string replace to replace %username% and %password% or something like that)\n4) OPTIONAL: specify separately which parameter name is used for username and password\n\nThen just remember the cookies.\n\nI could use this to experiment using Mylar with ChangeLogic manually for about two weeks with another developer. The information we gather this way should be shared with the ChangeLogic developers and hopefully we will help them decide to create a ChangeLogic integration :)\n\nAdding Karel Kravik to cc. -- Karel, is the above list enough to login to ChangeLogic? Or maybe logging in with an activation key is possible?\n(explanation: after the login request, another request would be made to query the task list and parse it with regular expressions).",
    "Created an attachment (id\u003d52731)\nNaive patch that just adds a loginUrl\n\nThis patch just adds a loginUrl. I wasn\u0027t able to test this yet due to the issue with PDE and mylar.context.core, but I\u0027ll create a proper self-hosting workspace for mylar and test it then.",
    "Created an attachment (id\u003d52732)\nmylar/context/zip\n\n",
    "Actually, this was not enough for ChangeLogic. The login form uses some kind of security token, so the possible generic steps to log in using GET is:\n\n--------\nIf (tokenPattern) {\n  html \u003d get(loginPageURL);\n  token \u003d parsePageForToken(html, tokenPattern);\n  loginURL \u003d loginURL.replace(\"%TOKEN%\", token);\n}\nloginURL \u003d loginURL.replace(\"%USERNAME%\", username);\nloginURL \u003d loginURL.replace(\"%PASSWORD%\", password);\nget(loginURL);\n... continue as usual ...\n--------\n\nIn the UI, this would add \"Login page URL\", \"Login page token regexp\", \"Login URL\", and the loginURL would contain variables TOKEN, USERNAME, PASSWORD.\n\nWhat do you think, Eugene?\nI will update the patch to reflect this soon.",
    "Created an attachment (id\u003d52749)\nNew patch, according to the logic that allows for parsing login token\n\nThis is the new patch that adds login page url, login token regexp. It currently seems to work fine with changelogic.\n\nSorry, but the context is not updated atm.",
    "Eugene: since this bug belongs to you please request for me to apply any patch that you would like applied and I will review.  ",
    "Created an attachment (id\u003d52821)\nPath with fixed wizard page initialization\n\nThe previous patch didn\u0027t initialize the new fields in the wizard page if you were editing an existing query.",
    "Created an attachment (id\u003d52824)\nPatch with fixed externalization\n\nFixed externalization, previously the value of Login URL was externalized instead of Login Page URL\u0027s value.",
    "(In reply to comment #10)\n\u003e Eugene: since this bug belongs to you please request for me to apply any patch\n\u003e that you would like applied and I will review.  \n\nWill look at it next week.\n",
    "I\u0027m thinking that putting the password in the URL is a bad security blooper, so the POST parameters mentioned in comment #5 really should be added to this model.",
    "Created an attachment (id\u003d52838)\nThis patch adds template support\n\nThis patch adds the possibility to specifiy the login url and login token regexp in the templates. But I didn\u0027t add the \"Login page url\" as a template attribute, but used the Repository URL to fill that field.",
    "Erkki, why do you have login parameters at the query level? Shouldn\u0027t all these params be in the repository settings?",
    "Hmm, now that I think of it, you are right. Should be at the repo level. I think my logic was that nothing besides the query requires that kind of login.",
    "Eugene, I really like the new UI for the web repositories. How do you think the login parameters could be added to that?\n\nIf just replacing the username/password in the URL, that would be easier, but I don\u0027t think it should be done like that -- it was just a temporary solution for me.\n\nSo another parameter table is probably necessary for a POST login. I suggest to add \n\noption 1) to the hidden advanced section:\n\nLogin token pattern (that would be read from the main repository page, but maybe in some rare cases where both public and privileged access is possible there is a need to read that token from a different page... that case should probably not dealt with prematurely though, as I did in the original patch)\nLogin URL\nA table with POST parameters for the login.\n\noption 2) add the same items in a new section \"Login configuration\" below the \"Advanced configuration\" that is also hidden by default\n\noption 3) add a button to open a new dialog with the login options.\n\nI personally like option #2 the most.",
    "Or actually, as it seems the ParametersEditor would work better on a different page, why not have an\n\n\"Anonymous Access\" checkbox checked by default as in the Bugzilla and Trac repository settings and in case it is unchecked, make the Next button go to a new advanced login settings page?\nHmm... on the other hand, the advanced page should not be shown at all in the most common cases. I think in that case both \"Next\" and \"Finish\" could be visible and \"Next\" would go to the advanced login configuration page while Finish would finish immediately.",
    "Created an attachment (id\u003d54090)\nRough preview of the proposed UI additions\n\nThis is roughly how the new Web Repository settings page would look after adding the login configuration.",
    "Created an attachment (id\u003d54115)\nThis patch adds all the login section to the new UI\n\nThis patch is definitely not final, but I\u0027d like to get feedback before I start refining it, if possible.",
    "Created an attachment (id\u003d54116)\nmylar/context/zip\n\n",
    "Created an attachment (id\u003d54122)\nmylar/context/zip\n\nI seem to have accidentally corrupted the previously attached context",
    "Created an attachment (id\u003d54124)\nPatch to improve the UI of the expert login configuration section\n\nThis also creates two Sections inside the login configuration because the login token stuff is probably not needed for most of the repositories out there (I think).\n\nNotes about the UI:\n\n1) there are some layout issues remaining (the sections are too wide)\n2) CCombo should be used instead of Combo, but that needs a CComboViewer\n3) the parameter entry is done directly in the table instead of a popup dialog as in the ParametersEditor; it has no validation yet",
    "Created an attachment (id\u003d54125)\nmylar/context/zip\n\n",
    "Created an attachment (id\u003d54126)\nBugfixes and new ChangeLogic templates to the previous patch\n\n1) several bugs fixed that the previous patch created\n2) there are now 2 ChangeLogic templates:\n2a) anonymous (default server changelogic.araneaframework.org) -- this allows to view public tasks anonymously. The query pattern is not perfect -- for some tasks the status is retrieved instead of the description\n2b) with POST login (default server also changelogic.araneaframework.org -- it allows users to sign up) -- this worked for me with 3 different changelogic instances.",
    "Created an attachment (id\u003d54128)\nUpdated screensot of the Login Configuration UI\n\n",
    "This looks great Erkki.  I think that it just needs a bit of UI simplification and we can apply the patch.  Where is the \"Login Tken Pattern\" coming from?  Should it be part of the template? Eugene, could you take a look and verify it?  \n\n1) Remove the folding sections, because they add UI complexity, and if a user is looking at this they should see it all.  Replace them with check boxes that cause the items below them to enable.  As an example take a look at the Proxy Settings section of the Bugzilla repository properties page, just checked into CVS a moment ago.\n2) Put URL on the same line as Method to save a line, with Method going first. \n3) \"Advanced Configuration\" -\u003e \"Template Configuration (Advanced)\"\n4) \"Login Configuration (Expert)\" -\u003e \"Login Configuration (Advanced)\" \n5) To get rid of the white call setBackground on the composite with the container\u0027s background.\n",
    "(In reply to comment #28)\n\u003e Should it be part of the template? Eugene, could you take a look and verify it? \n\nYes, it is definitely should be coming from template.\n\nI haven\u0027t look at the code yet, but have few comments in regards to UI and some implementation details.\n\nFirst of all this folding idea (even for original advanced section) is becoming a real mess. The size of expanded UI is too large to sit under the fold. I think it all should be moved to the separate page (or a popup edit dialog in worst case).\n\nAlso, we don\u0027t need two property tables. There should be only one!\n\n\u003e ...As an example take a look at the Proxy\n\u003e Settings section of the Bugzilla repository properties page, just checked into\n\u003e CVS a moment ago.\n\nHmm. Why it only appear for Bugzilla and not for other connectors? \n\nIt is also very disappointing that you used folded sections instead of multiple pages. :-(\n\n\u003e 2) Put URL on the same line as Method to save a line, with Method going first.\n\u003e 3) \"Advanced Configuration\" -\u003e \"Template Configuration (Advanced)\"\n\u003e 4) \"Login Configuration (Expert)\" -\u003e \"Login Configuration (Advanced)\" \n\nActually, I believe there should be just one \"advanced\" section. There is no point to separate this stuff. For example, login token can be used in other urls. So, they are quite related.\n\n\u003e 5) To get rid of the white call setBackground on the composite with the\n\u003e container\u0027s background.\n\nThat one I actually left white intentionally, to separate from the other UI.\n\nEither way, I\u0027d like to take my own pass to the UI. Ie remove all the borders and align the widgets properly",
    "(In reply to comment #29)\n\u003e Yes, it is definitely should be coming from template.\nYes, and an example is present in the ChangeLogic templates also included in this patch.\n\n\u003e a real mess. The size of expanded UI is too large to sit under the fold. I\n\u003e think it all should be moved to the separate page (or a popup edit dialog in\n\u003e worst case).\n\nI agree that a separate page would be good. But should it be accessible by the \"Next\" button or in some other way?\n\n\u003e Also, we don\u0027t need two property tables. There should be only one!\n\nDo you mean that there should be only one table where you enter properties (1) or that there should be only one implementation of a table where you enter key/value pairs (2).\n\nIf it is 1) then I disagree -- the login request parameters should be hidden by default unlike the template parameters.\nIf it\u0027s 2) then I agree -- the whole restui package could probably be replaced with something better, I did it the way it is because it was easy to develop a prototype that way in Visual Editor. Also, I think to enter the parameters directly in the table is better than a pop-up dialog (but maybe harder to do validation? -- haven\u0027t tried that in a table yet).\n\n\u003e \u003e 2) Put URL on the same line as Method to save a line, with Method going first.\n\nMoving the method and URL to one line sounds good.\n\n\u003e Either way, I\u0027d like to take my own pass to the UI. Ie remove all the borders\n\u003e and align the widgets properly\n\nOk.",
    "(In reply to comment #30)\n\u003e I agree that a separate page would be good. But should it be accessible by the\n\u003e \"Next\" button or in some other way?\n\nTechnically you not suppose to have \"Next\" buttons on properties dialogs. Those buttons are used for wizards. See Team/CVS repository properties.\n\n\u003e \u003e Also, we don\u0027t need two property tables. There should be only one!\n\u003e \n\u003e Do you mean that there should be only one table where you enter properties (1)\n\u003e or that there should be only one implementation of a table where you enter\n\u003e key/value pairs (2).\n\u003e\n\u003e If it is 1) then I disagree -- the login request parameters should be hidden by\n\u003e default unlike the template parameters.\n\nYou don\u0027t have anything to hide. More over, there is no point to map username to just ${userId} variable, so as other remappings you have used.\n\nRegardless, two property tables on the same dialog are really confusing and really make no sense.",
    "(In reply to comment #31)\n\u003e Technically you not suppose to have \"Next\" buttons on properties dialogs. Those\n\u003e buttons are used for wizards. See Team/CVS repository properties.\n\nOk, I see what you mean.\n\n\u003e \u003e If it is 1) then I disagree -- the login request parameters should be hidden by\n\u003e \u003e default unlike the template parameters.\n\u003e \n\u003e You don\u0027t have anything to hide. More over, there is no point to map username\n\u003e to just ${userId} variable, so as other remappings you have used.\n\n\u003e Regardless, two property tables on the same dialog are really confusing and\n\u003e really make no sense.\n\nBut I don\u0027t really see how you could present any differently the info that needs to be sent with the POST login request. You could call them repository parameters, but they aren\u0027t -- they won\u0027t be used as variables, they are used only in that login HTTP request and nowhere else. And you can\u0027t send the other parameters with the login request, so to put them in one table, you\u0027d have to somehow separate them with a prefix or add another column where you select which kind of parameter it is.\n\nIn ChangeLogic\u0027s case, I could actually use a GET method and put the whole POST Parameters table in the query, but that would be a more insecure way to send them.\n\nThe mapping for ${userId} etc. is very much necessary if you want to use the standard repository username/password parameters to send with the login request and not enter them twice.\n\nAll this works exactly the same way as what you did with introducing the parameters/variables -- you enter somewhat human-readable parameters in one table and the other more advanced fields make use of those variables.",
    "(In reply to comment #32)\n\u003e But I don\u0027t really see how you could present any differently the info that\n\u003e needs to be sent with the POST login request. \n\nWhy exactly you need to present them differently? Can\u0027t you just put them into the post url?\n\n\u003e You could call them repository\n\u003e parameters, but they aren\u0027t -- they won\u0027t be used as variables, they are used\n\u003e only in that login HTTP request and nowhere else. And you can\u0027t send the other\n\u003e parameters with the login request, so to put them in one table, you\u0027d have to\n\u003e somehow separate them with a prefix or add another column where you select\n\u003e which kind of parameter it is.\n\nParameters only sent somewhere if they are actually used in the urls. I see what you meant them for now, but if passing those in the url works for you, it would make UI less cluttered, especially with currently used folding...\n\nOr even better, parse that login url and convert params from the url into post parameters. This way it is even easier to store in templates.\n\n\u003e In ChangeLogic\u0027s case, I could actually use a GET method and put the whole POST\n\u003e Parameters table in the query, but that would be a more insecure way to send\n\u003e them.\n\nDon\u0027t be silly. There is nothing secure about post. :-)\nIf you really care about security, use https.\n\n\u003e The mapping for ${userId} etc. is very much necessary if you want to use the\n\u003e standard repository username/password parameters to send with the login request\n\u003e and not enter them twice.\n\nI know. That is why I added ${userId} variable in first place.\n",
    "Yes, POST is not secure by itself, but are you sure that in HTTPS there is no difference between how the body of a request and the URL are treated? POST parameters are sent in the request body, not in the URL.\nHmm... maybe this difference between URL / body is a misconception I have... I\u0027m forgetting that this is not used in a browser where a URL is more insecure because it\u0027s usually always visible. But what about caching, proxies etc. Do they not make a difference between POST/GET (or URL and body).\nI must admit that I\u0027m no expert on this and I\u0027m not 100% sure on any of it.\n\nParsing the URL into post parameters is one possibility, but there might be some cases that expect some parameters in the URL and some as POST parameters (If I\u0027m not mistaken, phpBB or vBulletin did that somewhere).",
    "Actually, I checked phpBB \u0026 vBulletin login impl. in BBAPI and neither require any URL parameters besides POST parameters. The probability of some application requiring that should be quite low. So I think parsing the URL into post parameters would be ok and the table could be dropped.",
    "Great. Parsing login url it is. :-)",
    "Created an attachment (id\u003d54277)\nUpdated patch with simplified UI\n\n1) The login request now fits on one line. Maybe the \u0027restui\u0027 package should be removed now and the code embedded in the settings page compilation unit?\n2) no more special parameters -- as discussed, for POST method the URL query is now parsed into the POST method parameters. The parsing is not perfect, though. For example, the parameters are evaluated before the URL parsing so if the password/username contains \u0026, it will be seen as separator. Not entirely sure yet how it\u0027s best to keep this URL parsing simple while allowing special characters.\n3) synchronized with latest CVS changes -- mostly it was that there seemed to be some differently formatted code in CVS\n\nNote: since for the parameter evaluation, the fetchResource method now needs the repository as a parameter, maybe some other parameters from the method could be dropped.",
    "I can\u0027t apply patch because of conflicts in WebQueryWizardPage and WebRepositoryConnector classes. Are you sure you have latest code?\n\nPS: when substituting parameters we need to use http encoder. There is one in Mylar core classes...",
    "Created an attachment (id\u003d54288)\nFixed patch, now fetchResource() has less parameters\n\nConflicts resolved, had to manually update the files and paste over the modified contents.\n\nIn WebRepositoryConnector:\n1) the fetchResource() now doesn\u0027t take as many parameters, as the TaskRepository is given as a parameter.\n2) did an extract method refactoring: refreshIfNeeded()\n\nWhich class is that HTTP encoder you were talking about? Maybe you could do that part yourself?\n",
    "FYI. With this patch applied I got an NPE for existing query:\n\njava.lang.NullPointerException\nat org.eclipse.mylar.internal.tasks.web.WebRepositoryConnector.evaluateParams(WebRepositoryConnector.java:432)\nat org.eclipse.mylar.internal.tasks.web.WebRepositoryConnector.evaluateParams(WebRepositoryConnector.java:415)\nat org.eclipse.mylar.internal.tasks.web.WebRepositoryConnector.performQuery(WebRepositoryConnector.java:177)\nat org.eclipse.mylar.tasks.ui.SynchronizeQueryJob.run(SynchronizeQueryJob.java:74)\nat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)\n",
    "(In reply to comment #40)\n\u003e FYI. With this patch applied I got an NPE for existing query:\n\nThat seems to be because of null login form URL. Not sure why I haven\u0027t seen this error. I think perhaps somewhere null parameters got replaced with empty strings, but maybe your existing query still had null? Were you expecting that evaluateParams(String, Map) would never be called for a null value? I wasn\u0027t aware of that.\n\nPS. I don\u0027t want to create yet another patch in this bug, but on line 317, the refreshIfNeeded() call should assign to get, like this:\nget \u003d refreshIfNeeded(loginFormUrl, client, get);",
    "Created an attachment (id\u003d54299)\nRedesigned UI layout\n\nThis is my take on this UI. \n\nDamn it. It is getting more obscured then I initially thought. I now wonder if this ChangeLogic is the only issue tracker that require this token thing...",
    "I think it would really be better on a separate properties page and in Groups. But then the whole properties dialog should be redesigned in every Mylar connector, I think? Currently it\u0027s designed like a Wizard, but functions more like those CVS/SVN properties pages, like you mentioned somewhere above. I personally think doing this would be good, but probably too much work for you guys right now?",
    "Yes, redesigning the Repository Properties page to one of the other options (tabbed, or multi-page properties) can not happen for 1.0.  There are tricky problems such as having the \"Validate Settings\" button in a sensible place where you can see all the relevant settings.  Also, the folding approach provides a good forcing function for making the UI dense, as Eugene seems to have done a very good job of in his last iteration.  \n\nEugene: Let me know when you guys have the patch in a state where you want me to apply it.\n\nAlso, is ChangeLogic really the only tracker that this will support? That\u0027s not great, bug I guess it\u0027s OK if we\u0027re reasonably confident that this mechanism could be useful for other web based repositories that we will support down the road.",
    "(In reply to comment #44)\n\u003e Eugene: Let me know when you guys have the patch in a state where you want me\n\u003e to apply it.\n\nOk then, I\u0027ll finish UI changes I started and will cleanup Erkki\u0027s code (ie remove printStackTrace() and some other stuff).\n\n\u003e Also, is ChangeLogic really the only tracker that this will support? That\u0027s not\n\u003e great, bug I guess it\u0027s OK if we\u0027re reasonably confident that this mechanism\n\u003e could be useful for other web based repositories that we will support down the\n\u003e road.\n\nSorry, I meant that that logging in should work on others repositories. Though I yet have to check how Erkki implemented passing session between requests. What is specific to ChangeLogic is that login token id and hence an extra request to the server to fetch it. As I said, I don\u0027t recall anyone else doing something like that, but I can be wrong.",
    "Session is currently not persisted between requests (would this be useful? personally I didn\u0027t consider that to be important). To persist the session, the HttpClient or it\u0027s cookie state should be cached.\nI guess there is even some kind of possibility of sharing the session with the internal browser?\n\nI have seen this token usage in other web applications, but I\u0027m not sure if any issue repositories use that. vBulletin or phpBB I think uses something similar during posting messages, but as I remember it isn\u0027t mandatory.",
    "Created an attachment (id\u003d54456)\nReworked patch with login support and new templates\n\nHere we are. I am sorry to say that there is very little code left from the original patch because I rewrote most of the resource fetching code.\n\nSince there is no public CodeLogic repo with auth, I\u0027ve used OTRS as a driver for this. Mik, can you please review and apply this patch. WebRepositoryConnectorTest may flicker on OTRS repository, because tasks are up and down.\n\nSo, this patch adds 3 new templates: OTRS, CodeLogic and CodeBeamer.\n\nErkki, I used one template for both repositories. Please check if it work for you once Mik will apply this patch. Then, if you need additional fixes, please make sure that WebRepositoryConnectorTest is working. Thanks.\n",
    "Created an attachment (id\u003d54457)\nmylar/context/zip\n\n",
    "Folks, if this patch (finally) gets applied on the next hours, is it possible to release a dev-build to try this feature?\n\nI have not external CVS access here, but I\u0027d like to experiment with it.",
    "Also, is it complicated to add Mantis login support out of the box too, Eugene?",
    "Patch applied.  I did a quick review but did not validate.  Got this into dev build 0.9.0.v20061124-0730 which is now uploading so it should be available in 15-30 minutes.  Check it out and post any updates.\n\nNote that we messed up the Task Repositories page for you some and will clean that up today.  I think for now we\u0027ll make the Character encoding fold since most people don\u0027t need to see that.",
    "I was just going to make encoding a single dorp down, or checkbox (Default Encoding) and dropdown...",
    "\u003e Here we are. I am sorry to say that there is very little code left from the\n\u003e original patch because I rewrote most of the resource fetching code.\n\nI don\u0027t mind :)\n\n\u003eErkki, I used one template for both repositories. Please check if it work for\n\u003eyou once Mik will apply this patch. Then, if you need additional fixes, please\n\u003emake sure that WebRepositoryConnectorTest is working. Thanks.\n\nIt doesn\u0027t work for me at the moment (with the private repo), I will take a look at it (and the new code) later when I get home.",
    "Eugene: the single drop down sounds good, and if you end up doing this just try to put \"Default (UTF-8)\" as the first entry because that list is soooo huge and if someone clicks this accidentally they will never find the default again.  It\u0027s OK if it\u0027s duplicated and shows up as (UTF-8) later.",
    "(In reply to comment #53)\n\u003e It doesn\u0027t work for me at the moment (with the private repo), I will take a\n\u003e look at it (and the new code) later when I get home.\n\nNote that there is a bug with POST method authentication and redirect handling in the applied patch. See bug#165852.",
    " (In reply to comment #47)\n\u003e Erkki, I used one template for both repositories. Please check if it work for you once Mik will apply this patch. \nThen, if you need additional fixes, please make sure that WebRepositoryConnectorTest is working. Thanks.\n\nMerging the patterns doesn\u0027t work well because the private task list page differs from the public one. Perhaps the private template should not be part of Mylar (unless you accept having two Changelogic templates), and I could contribute it as a patch or separate jarred plugin attached to the Changelogic enh. request (bug 159346)?",
    "Sorry, my bad, it seems you succesfully managed to make the pattern support both pages, but what was causing me trouble was the problem mentioned by Willian.\n\nAlso, another thing: not only HTTP 302 should indicate that the new URL be read from the Location header, but also:\n301,302,303,307\nAlso, with 300, \"user agents MAY use the Location field value for automatic redirection\"\nThis is for HTTP 1.1, don\u0027t know about 1.0\n\nI specifically need it to work with 301, because my server redirects the login page from something like cvs.lan/changelogic to cvs.lan/changelogic/ with \"301 Moved Permanently\"",
    " (In reply to comment #57)\n\u003e Also, another thing: not only HTTP 302 should indicate that the new URL be read from the Location header, but also:\n\u003e 301,302,303,307\n\u003e Also, with 300, \"user agents MAY use the Location field value for automatic redirection\"\n\u003e This is for HTTP 1.1, don\u0027t know about 1.0\n\nBut actually, why do this manually and set method.setFollowRedirects(false), when this could be done by HttpClient  instead? It looks like this is how HttpClient does it internally:\n\n        switch (method.getStatusCode()) {\n            case HttpStatus.SC_MOVED_TEMPORARILY:\n            case HttpStatus.SC_MOVED_PERMANENTLY:\n            case HttpStatus.SC_SEE_OTHER:\n            case HttpStatus.SC_TEMPORARY_REDIRECT:\n                LOG.debug(\"Redirect required\");\n                if (method.getFollowRedirects()) {\n                    return true;\n                } else {\n                    LOG.info(\"Redirect requested but followRedirects is \"\n                            + \"disabled\");\n                    return false;\n                }\n            default:\n                return false;\n        } //end of switch\n",
    "(In reply to comment #58)\n\u003e But actually, why do this manually and set method.setFollowRedirects(false),\n\u003e when this could be done by HttpClient  instead? It looks like this is how\n\u003e HttpClient does it internally:\n\nI originally tried that, but was getting circular redirect error from http client. No idea why.",
    "(In reply to comment #59)\n\u003e (In reply to comment #58)\n\u003e \u003e But actually, why do this manually and set method.setFollowRedirects(false),\n\u003e \u003e when this could be done by HttpClient  instead? It looks like this is how\n\u003e \u003e HttpClient does it internally:\n\u003e \n\u003e I originally tried that, but was getting circular redirect error from http\n\u003e client. No idea why.\n\u003e \n\nAlso, the setFollowRedirects(...) does not work with POST method.",
    "Erkki, I updated the patch on bug#165852 regarding the error codes.",
    "Anything left for me to apply before 1.0 here?",
    "(In reply to comment #62)\n\u003e Anything left for me to apply before 1.0 here?\n\u003e \n\nI think this is ok.\n\nThe patch in bug#165852 was applied too, so it is working with POST authentication (Erkki, is this working for you now?).",
    "(In reply to comment #62)\n\u003e Anything left for me to apply before 1.0 here?\n\nI don\u0027t have anything right now. We should track further issues in a separate reports.\n",
    "Sounds right to me."
  ],
  "commentCreationDates": [
    "2006-07-24T18:22:07+02:00",
    "2006-07-28T03:21:43+02:00",
    "2006-07-28T13:08:07+02:00",
    "2006-10-09T18:44:22+02:00",
    "2006-10-09T22:03:40+02:00",
    "2006-10-26T11:51:21+02:00",
    "2006-10-26T12:45:28+02:00",
    "2006-10-26T12:45:30+02:00",
    "2006-10-26T14:47:36+02:00",
    "2006-10-26T16:06:13+02:00",
    "2006-10-27T00:46:16+02:00",
    "2006-10-27T09:46:09+02:00",
    "2006-10-27T10:19:57+02:00",
    "2006-10-27T12:56:09+02:00",
    "2006-10-27T14:29:14+02:00",
    "2006-10-27T15:49:50+02:00",
    "2006-10-31T23:52:11+01:00",
    "2006-11-01T06:45:48+01:00",
    "2006-11-05T10:46:47+01:00",
    "2006-11-05T11:08:11+01:00",
    "2006-11-17T19:40:22+01:00",
    "2006-11-18T00:48:29+01:00",
    "2006-11-18T00:48:31+01:00",
    "2006-11-18T13:35:59+01:00",
    "2006-11-18T14:55:42+01:00",
    "2006-11-18T14:55:44+01:00",
    "2006-11-18T16:21:15+01:00",
    "2006-11-18T17:22:39+01:00",
    "2006-11-20T18:44:21+01:00",
    "2006-11-20T19:14:29+01:00",
    "2006-11-20T19:47:14+01:00",
    "2006-11-20T20:01:55+01:00",
    "2006-11-20T20:20:53+01:00",
    "2006-11-20T20:35:14+01:00",
    "2006-11-20T21:00:57+01:00",
    "2006-11-20T21:31:57+01:00",
    "2006-11-20T21:45:23+01:00",
    "2006-11-21T18:50:54+01:00",
    "2006-11-21T19:22:59+01:00",
    "2006-11-21T20:48:11+01:00",
    "2006-11-21T21:57:31+01:00",
    "2006-11-21T22:13:03+01:00",
    "2006-11-21T23:09:35+01:00",
    "2006-11-21T23:43:49+01:00",
    "2006-11-22T00:45:30+01:00",
    "2006-11-22T01:04:07+01:00",
    "2006-11-22T17:27:40+01:00",
    "2006-11-24T05:17:19+01:00",
    "2006-11-24T05:17:21+01:00",
    "2006-11-24T14:24:05+01:00",
    "2006-11-24T14:58:07+01:00",
    "2006-11-24T16:06:27+01:00",
    "2006-11-24T16:54:28+01:00",
    "2006-11-24T17:15:27+01:00",
    "2006-11-24T18:53:49+01:00",
    "2006-11-26T01:44:37+01:00",
    "2006-11-26T14:12:03+01:00",
    "2006-11-26T15:01:21+01:00",
    "2006-11-26T15:07:57+01:00",
    "2006-11-26T17:30:44+01:00",
    "2006-11-26T18:47:16+01:00",
    "2006-11-26T18:59:11+01:00",
    "2006-12-05T20:56:36+01:00",
    "2006-12-05T21:04:00+01:00",
    "2006-12-05T21:07:06+01:00",
    "2006-12-05T23:49:17+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.mylar.internal.tasks.web.WebRepositoryConnector.evaluateParams",
          "source": "WebRepositoryConnector.java:432"
        },
        {
          "method": "org.eclipse.mylar.internal.tasks.web.WebRepositoryConnector.evaluateParams",
          "source": "WebRepositoryConnector.java:415"
        },
        {
          "method": "org.eclipse.mylar.internal.tasks.web.WebRepositoryConnector.performQuery",
          "source": "WebRepositoryConnector.java:177"
        },
        {
          "method": "org.eclipse.mylar.tasks.ui.SynchronizeQueryJob.run",
          "source": "SynchronizeQueryJob.java:74"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 40,
      "bugId": "151602",
      "date": "2006-11-21T21:57:31+01:00",
      "product": "Mylyn",
      "component": "Core",
      "severity": "enhancement"
    }
  ],
  "groupId": "151602",
  "bugId": "151602",
  "date": "2006-07-24T18:22:07+02:00",
  "product": "Mylyn",
  "component": "Core",
  "severity": "enhancement"
}