{
  "comments": [
    "First of all: I am using the (ancient) Mylar version 0.5.2 with some custom modifications. Unfortunately, I don\u0027t have the time right now to update Mylar to CVS head or adapt my patches to a newer version. Nevertheless, there are some parts of my work that may be useful to others so I filed this bug. Maybe this issue is resolved in a newer version already.\n\nI wanted to be able to transfer a Mylar context (possibly even stored in the repository) to another task. See the attached files for an implementation.\n\nPlease note that the files attached will not work out of the box even with 0.5.2: \n+ TransferContextAction should be registered in plugin.xml (see plugin_fragment.xml). \n+ Furthermore I had to modify the AbstractRepositoryConnector API and did neither adapt the Bugzilla nor the Jira connector as the API changed very much since 0.5.2 so it would be wasted work anyway. Depending on the fix for Bug 146017 this change may be not necessary any more.\n\nThe test cases contain some references to ExpTask2Task/~Job etc. which are only my implementations of an AbstractRepositoryTask.\n\nI hope that my patch does not assume anything that does not hold true for Mylar (relying on implementation details which are specific for my implementation). \n\nIf the target task has a context, this is overwritten. Merging is currently not supported.\n\nFinally, there are two additional things which would be nice for the implementation of this feature:\n1. The TaskListContentProvider should be much less coupled to the TaskListView so it could be reused for the target task selection.\n2. In the AbstractRepositoryConnector getAvailableContexts should not return a Set but a List ordered by date.",
    "Created an attachment (id\u003d47440)\nsome preparational work\n\n",
    "Created an attachment (id\u003d47441)\nthe real work (+ test cases)\n\n",
    "Created an attachment (id\u003d47442)\nscreenshot: activating the action\n\n",
    "Created an attachment (id\u003d47443)\nscreenshot: choosing the exact context to transfer\n\n",
    "Created an attachment (id\u003d47444)\nscreenshot: choosing the target task\n\n",
    "See also related bugs: bug#152211 and bug#126237.",
    "Thanks Felix. We would really like to have this functionality in Mylar and this looks like a good start. Mik will look over this when he gets back online (~ August 18th).",
    "Nice!  Note related bug 126237, but this approach could be a better and more flexible UI.\n\nCould you make the full contribution a patch to org.eclipse.mylar.context.ui?  If so we may be able to get this applied in time for Friday\u0027s 0.6.2.",
    "Hmm. I am not sure if such UI will scale well.\n\nShould this use \"Open Task\" dialog and don\u0027t depend on repository tasks? Purely local transfer, that can be later submitted to repository on next step.\n\nStill, the simplest interaction would be to allow following scenarious:\n\n-- Ctrl-C/Ctrl-V to copy context from one task to another one, \n-- use drag-n-drop from one task to another \n-- use drag-n-drop from task to the opened editor that has another task opened\n\nHowever there is still issues with merging/comparing contexts...",
    "@Mik: Sorry, I have so little spare time in the moment. Making a patch against org.eclipse.mylar.context.ui is a bit more complicated because I\u0027m using the IRemoteContextDelegate which is gone since 0.5.3. However, I will have some time after the end of November: if you like my approach and still need some bits at that time, I\u0027ll get back to it.\n\n@Eugene: While I think that my work can be improved for sure, I don\u0027t like the dnd/c\u0026p idea because the \"object\" you are manipulating is the task, not the context. I would expect that Ctrl+C/Ctrl+V will copy the whole task (including title etc). drag\u0026drop should (IMHO) influence the ordering of the tasks (if it is dropped between some task) or should add a task as a subtask (if drop on another task).\n\nYou are right, merging/comparing tasks is still to be done and would be a great  addition.\n\nBtw: If first wanted to use the tasklist view/its content provider for the task selection so that it has exactely the same styling as the the TaskListView. Unfortunately, the ContentProvider is too specific to TaskListView. It would be nice if the tasks presented are exactely the same as in TaskListView (completed tasks hidden if preference in TaskListView selected etc.).",
    "I think user integaction could be greatly simplified eliminating a wizard. We already have open task dialog, so you can use this and implement \"Copy context to...\" action, that will bring up the same dialog (titled \"Select Task\") and then copy the context.\n\nWe may also have special actions for copy paste, not necessary mapped to Ctrl-C/Ctrl-V and those could be also invoked from a popup menu.\n\nAs for drag\u0027n\u0027drop, it may just as what user wanted to do: copy as a subtask or copy/merge task context into...\n\nBTW, you can\u0027t use drag\u0027n\u0027drop for ordering because list is sorted alphabetically.",
    "*** Bug 126237 has been marked as a duplicate of this bug. ***",
    "Sorry for the slowness on this one, will look at applying/reusing the patch after 0.7.0 goes out.",
    " (In reply to comment #11)\n\u003e I think user integaction could be greatly simplified eliminating a wizard. We already have open task dialog, so you can use this and implement \"Copy context to...\" action, that will bring up the same dialog (titled \"Select Task\") and then copy the context.\n\nEugene\u0027s suggestion here seems like the most streamlined and simple way of getting the core functionality, so that\u0027s what I implemented.  Felix, your UI could still be useful and offers flexibility that we might need down the road, so we may yet integrate it.  I appreciate your contribution here and will credit it in the New \u0026 Noteworthy even though we did not use the patch itself.",
    "Created an attachment (id\u003d54451)\nmylar/context/zip\n\n",
    "Got this upon trying to transfer from a task without context I believe.  I guess the option in the context menu should be disabled if there is no context.\n\njava.io.FileNotFoundException: C:\\dev\\bootstrap\\.mylar\\contexts\\https%3A%2F%2Fbugs.eclipse.org%2Fbugs-154726.xml.zip (The system cannot find the file specified)\n\tat java.io.FileInputStream.open(Native Method)\n\tat java.io.FileInputStream.\u003cinit\u003e(FileInputStream.java:106)\n\tat org.eclipse.mylar.internal.context.core.MylarContextManager.copy(MylarContextManager.java:841)\n\tat org.eclipse.mylar.internal.context.core.MylarContextManager.transferContextAndActivate(MylarContextManager.java:834)\n\tat org.eclipse.mylar.internal.context.ui.actions.CopyContextToAction.run(CopyContextToAction.java:90)",
    "Fixed, message dialog now shows.",
    "Mik, the icon you used looks exactly like icon for task activation. This small dot is invisible.",
    "This is always a challenge with screens having very different gamma settings.  I\u0027ll saturate it a bit more.",
    "(In reply to comment #19)\n\u003e This is always a challenge with screens having very different gamma settings. \n\u003e I\u0027ll saturate it a bit more.\n\nCan\u0027t you just use two balls of the same size? Similarly to common copy icon..."
  ],
  "commentCreationDates": [
    "2006-08-05T20:53:36+02:00",
    "2006-08-05T20:54:25+02:00",
    "2006-08-05T20:56:22+02:00",
    "2006-08-05T20:58:39+02:00",
    "2006-08-05T20:59:26+02:00",
    "2006-08-05T21:00:06+02:00",
    "2006-08-07T17:27:13+02:00",
    "2006-08-09T19:15:32+02:00",
    "2006-08-24T20:19:53+02:00",
    "2006-08-24T20:31:05+02:00",
    "2006-08-25T09:32:29+02:00",
    "2006-08-25T19:53:55+02:00",
    "2006-09-16T03:26:21+02:00",
    "2006-09-26T00:28:28+02:00",
    "2006-11-24T03:09:52+01:00",
    "2006-11-24T03:09:54+01:00",
    "2006-11-24T19:06:23+01:00",
    "2006-11-24T19:27:19+01:00",
    "2006-11-24T19:59:29+01:00",
    "2006-11-24T21:39:53+01:00",
    "2006-11-24T23:20:58+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.io.FileNotFoundException",
      "message": "C:\\dev\\bootstrap\\.mylar\\contexts\\https%3A%2F%2Fbugs.eclipse.org%2Fbugs-154726.xml.zip (The system cannot find the file specified)",
      "elements": [
        {
          "method": "java.io.FileInputStream.open",
          "source": "Native Method"
        },
        {
          "method": "java.io.FileInputStream.\u003cinit\u003e",
          "source": "FileInputStream.java:106"
        },
        {
          "method": "org.eclipse.mylar.internal.context.core.MylarContextManager.copy",
          "source": "MylarContextManager.java:841"
        },
        {
          "method": "org.eclipse.mylar.internal.context.core.MylarContextManager.transferContextAndActivate",
          "source": "MylarContextManager.java:834"
        },
        {
          "method": "org.eclipse.mylar.internal.context.ui.actions.CopyContextToAction.run",
          "source": "CopyContextToAction.java:90"
        }
      ],
      "number": 0,
      "commentIndex": 16,
      "bugId": "152902",
      "date": "2006-11-24T19:06:23+01:00",
      "product": "Mylyn",
      "component": "Tasks",
      "severity": "enhancement"
    }
  ],
  "groupId": "152902",
  "bugId": "152902",
  "date": "2006-08-05T20:53:36+02:00",
  "product": "Mylyn",
  "component": "Tasks",
  "severity": "enhancement"
}