{
  "comments": [
    "Set up a dstore connection to Linux (e.g. Redhat Enterprise WS4), using the REXEC server launcher. The default JVM on Redhat machines is based on gcj, and gcj is unable to run the dstore server. Therefore, when trying to start the server from an rexec commandline, the following traceback is seen:\n\n$ rexec parser \"cd /folk/mober/RSETest/latest/server ; perl ./server.pl\"\nName (parser.takefive.co.at:mober):\nPassword (parser.takefive.co.at:mober):\nDstore Server Starting...\nException in thread \"main\" java.lang.NoClassDefFoundError: while resolving class\n: org.eclipse.dstore.core.server.ConnectionEstablisher\n   at java.lang.VMClassLoader.resolveClass(java.lang.Class) (/usr/lib/libgcj.so.\n5.0.0)\n   ...\n\nThe problem is, that when the REXEC launcher is set up in RSE, no useful error message is shown.\n  * Choose Connect... and enter username / password. Message:\n    \"Unable to connect to REXEC host service on port 512 of host PARSER\"\n\n\nSuggested enhancements:\nIn case the REXEC launcher could authenticate successfully and run \"something\" on the remote side, the output from the remote side should be part of the error message.\n\nAs an optional additonal enhancement, gcj could be detected and proper error reporting made for the user (since this may be a common setup problem -- REXEC uses the default PATH, which will point to gcj even if a Sun or IBM jvm is installed).",
    "The interesting point is, that in DStoreConnectorService:line 1056,\n    throw new SystemMessageException(msg);\n\"msg\" is a correct SystemMessage which DOES contain the original server error message as LevelTwoText. \n\nThe problem is, that in the RSE UI this LevelTwoText is nowhere visible.\n- In the PDE Error Log it\u0027s invisible (could perhaps be added as \"caused by\" exception)\n- In the popup window it\u0027s also invisible\n- If, instead of choosing contextmenu \u003e connect, a filter is expanded (in order to do an implicit connect) no error message is shown at all.\n\nWORKAROUND for the original problem with gcj: Instead of just \n   perl ./server.pl\nThe Server Launch command should be set to something like\n   sh -c \"PATH\u003d/opt/j2sdk1.4.2_11/bin:$PATH perl ./server.pl\"\n",
    "I believe this is fixed by RC2.",
    "To be reviewed again with RC1 since this is not urgent."
  ],
  "commentCreationDates": [
    "2006-08-09T10:36:04+02:00",
    "2006-08-09T10:51:15+02:00",
    "2006-10-24T21:00:29+02:00",
    "2007-05-11T19:03:55+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NoClassDefFoundError",
      "message": "while resolving class : org.eclipse.dstore.core.server.ConnectionEstablisher",
      "elements": [
        {
          "method": "java.lang.VMClassLoader.resolveClass",
          "source": "java.lang.Class"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "153246",
      "date": "2006-08-09T10:36:04+02:00",
      "product": "Target Management",
      "component": "RSE",
      "severity": "minor"
    }
  ],
  "groupId": "153246",
  "bugId": "153246",
  "date": "2006-08-09T10:36:04+02:00",
  "product": "Target Management",
  "component": "RSE",
  "severity": "minor"
}