{
  "comments": [
    "When using forwarded ports through SSH, with a configured Task Repository URL such as bugzilla:http://localhost:8889/bugs, the Bugzilla pane reports:\n\n\"Could not download task data, possibly due to timeout or connectivity problem.\nPlease check connection and try again.\"\n\nNote that querying this repository w/ the above URL works.",
    "Tony, am I correct in saying that queries from Mylar (for example Search \u003e Repository Task) work but you are unable to load the resulting hits?\nCan you confirm that urlbase is set on your repository?",
    "Hey Robert - yes, you are correct in saying that.  What exactly are you referring to when you say urlbase?  Is this something I can set inside of Task Repository Settings, or is this set somewhere else?",
    "urlbase is a property set in the bugzilla server settings. If the repository isn\u0027t your own you probably will not have access to this. One way of checking is to point your browser to \u003cyour-repository-url\u003e/config.cgi?ctype\u003drdf (then view the page source) and check that the rdf:about attribute is not blank (ie. \u003cbz:installation rdf:about\u003d\"AddressOfRepositoryHere?\"\u003e).\n\nIf there is a proper repository url there then we will need to investigate further.\n",
    "\u003cbz:installation rdf:about\u003d\"http://bugs.tuvox.com/\"\u003e is what\u0027s there.\n\nThis machine is behind the company firewall, so I\u0027m using SSH and the above URL to access this repo.  Should this be a problem?",
    "One more note - if I VPN in and use http://bugs.tuvox.com, I don\u0027t encounter this issue.",
    "A few thoughts:\n- Have you tired redirection using something like http://localhost:8889/bugs:sshtunnelportnumberhere or is this not how your ssh client works?\n- Try adding the trailing / to the url you enter in the task repository config\n\nSorry but I haven\u0027t tried a port forwarding configuration so am just throughing ideas out there. :) Let me know if either of these ideas work and if not, perhaps you can let me know what ssh product you are using and I can try to reproduce the environment here?\n",
    "The trailing / is automatically removed once I close the Task Repository Settings Dialog.\n\nI\u0027m using SSH Secure Shell 3.2.9.",
    "I\u0027ll have to set up a similar environment here and test. I\u0027ll get back to you asap.",
    "I\u0027ve tested port forwarding here using both SecureCRT and SSH Secure Shell 3.2.9 and can\u0027t reproduce the error with either. \nAre there any hints in the error log?\n",
    "Could you give me some details about the Bugzilla repository itself such as:\n-Is it customized?\n-What version is it?\n-Are you able to retrieve bugs as xml? (I\u0027ve added an entry about this to the faq http://wiki.eclipse.org/index.php/Mylar_FAQ#Bugzilla_Connector_troubleshooting)",
    "- Is the repository using LDAP authentication?\n",
    "No to both anything useful in the error log and LDAP auth.  Did you use a similar url when you tested the port forwarding w/ SSH?",
    "I tried http://localhost:8889/myrepository with 8889 redirected to 80 on the remote host without problems. I also tried with https without failure.",
    "Do you have a test SSH account in your environment so I can try connecting to it?  It would be interesting to see if the problem is with the setup of my company\u0027s repo.",
    "There is now a guest account on mylar.eclipse.org for you to test against. I\u0027ll send you the password and details over email.\n\n",
    "I have no issues when using this test environment that you\u0027ve setup.  The Bugzilla Pane/View is working as expected.  This really only leaves the Bugzilla instance/config at fault.  Any other ideas?  If I get access to this Bugzilla instance, are there any logs or settings that I should check?",
    "I must admit I\u0027m running out of ideas here. The only observation I can make is that if it works over VPN but not over an ssh tunnel then the trouble must be the tunnel, no? As far as the bugzilla config goes you could check that:\n- it is version 2.18 or higher\n- check to ensure that the parameter regarding use of ssl is in fact set to \u0027never\u0027\n\nBut I\u0027m still convinced this is something to do with the tunnelling. :)",
    "So here\u0027s the setup.  This machine\u0027s Internet addressable IP is 64.221.252.202 / dev02.tuvox.com.  Inside the firewall/intranet, the machine is aliased as bugs.tuvox.com with IP 10.232.10.10.  The url for bugzilla is http://bugs.tuvox.com/bugs.\n\nI\u0027ve tried all the combinations in terms of specifying machine name/url in the tunneling and ssh options.  I think this is the difference in your environment.  The IP/Machine Name that I SSH to is not (and cannot) be the same as the IP/Machine Name specified in the tunneling.  Can you confirm that both those are the same in your test env?",
    "Yes, the test server (mylar.eclipse.org) you are connecting to over ssh is the same (virtual) server that hosts the bugzilla server.\n\nSo when tunneled, can you query and download bug reports via the web ui without failure?",
    "I can\u0027t help but wonder if apache is doing name based virtual hosting, but that doesn\u0027t make sense because you said you can retrieve query results...",
    "I actually did set both settings to dev02.tuvox.com (both for the destination host for SSH and then the destination host for the tunnelling), and it still doesn\u0027t work.  What\u0027s so frustrating is that I don\u0027t get any more detail then just: \"Could not download task data, possibly due to timeout or connectivity problem.  Please check connection and try  again.\"  I guess if I grabbed the source and set some breakpoints...\n\nDoes mylar.eclipse.org have other aliases?  Is this host name specified in the Bugzilla install?  My suspicion is still with the multiple names (whether configured via Apache or the OS) this machine is serving Bugzilla through.\n\n\n\n",
    "I\u0027ll try adding some more debug output and then ask Mik to cut a dev build for you to try out - perhaps then we\u0027ll be able to track this down.",
    "I just noticed that in comment#18 you mention that the url for bugzilla is http://bugs.tuvox.com/bugs but in comment#4 the config you provide is pointing to http://bugs.tuvox.com/.  This could be the problem, could you double check these?",
    "This is the problem I think.  When VPN\u0027d in, both of the above urls will get to the start page in the browser.  However, when tunnelling, only http://localhost:8889/bugs will work.  But the Bugzilla url base is set to http://bugs.tuvox.com.  Not sure what\u0027s the best way to resolve this one",
    "I think the only resolution is to get the sysadmin to set the urlbase on the bugzilla server to the correct url http://bugs.tuvox.com/bugs. My guess is that there is some redirect happening for http://bugs.tuvox.com/ that isn\u0027t happening when you are tunnelled in. ",
    "Were you able to get the urlbase updated Tony? ",
    "The change request was put in last week, and I\u0027m looking forward to testing this sometime today.  Will keep you posted.",
    "Any luck Tony?",
    "If you guys come up with any additional steps or caveats with connecting in tunneled mode please put them here:\n\nhttp://wiki.eclipse.org/index.php/Mylar_FAQ#Network_and_proxy_server_troubleshooting\n\nRob: you should also make sure that the misconfigured hostname problem is listed in the troubleshooting:\n\nhttp://wiki.eclipse.org/index.php/Mylar_FAQ#Bugzilla_Connector_troubleshooting",
    "We didn\u0027t change the urlbase, but we did change the apache virtual mapping so that the virtual root now points to the bugzilla instance.  So now I can access from my browser (when ssh\u0027d/tunneled) to http://localhost:8889/ instead of the old http://localhost:8889/bugs.  However, the problem is still there.  I\u0027m not sure what the next step is...",
    "A version of today\u0027s dev build with additional logging info is now available from:\n\n  download.eclipse.org/technology/mylar/update-site/test\n\nYou may need to give it up to 30 minutes to replicate.  Version is:0.6.2.v20060922-1830\n\nNote that this is an Eclipse 3.3M2 build, but everyting other than the automatic context test suite should work fine.",
    "Using the dev build, here are excerpts from .log:\n\nVPN\u0027d AND SSH\u0027d (works!):\n\n!ENTRY org.eclipse.mylar.core 1 0 2006-09-22 23:40:23.940\n!MESSAGE Mylar: Retrieving task data from: http://localhost:8889, source: java.lang.Class\n\nVPN\u0027d and NOT SSH\u0027d (still doesn\u0027t work):\n\n!ENTRY org.eclipse.mylar.bugzilla 4 0 2006-09-22 23:40:12.486\n!MESSAGE Report download from http://localhost:8889 failed, please see details.\n!STACK 0\njava.net.ConnectException: Connection refused: connect\n\tat java.net.PlainSocketImpl.socketConnect(Native Method)\n\tat java.net.PlainSocketImpl.doConnect(Unknown Source)\n\tat java.net.PlainSocketImpl.connectToAddress(Unknown Source)\n\tat java.net.PlainSocketImpl.connect(Unknown Source)\n\tat java.net.Socket.connect(Unknown Source)\n\tat sun.net.NetworkClient.doConnect(Unknown Source)\n\tat sun.net.www.http.HttpClient.openServer(Unknown Source)\n\tat sun.net.www.http.HttpClient.openServer(Unknown Source)\n\tat sun.net.www.http.HttpClient.parseHTTP(Unknown Source)\n\tat sun.net.www.protocol.http.HttpURLConnection.getInputStream(Unknown Source)\n\tat java.net.HttpURLConnection.getResponseCode(Unknown Source)\n\tat org.eclipse.mylar.internal.bugzilla.core.AbstractReportFactory.collectResults(AbstractReportFactory.java:57)\n\tat org.eclipse.mylar.internal.bugzilla.core.RepositoryReportFactory.populateReport(RepositoryReportFactory.java:44)\n\tat org.eclipse.mylar.internal.bugzilla.core.BugzillaServerFacade.getBug(BugzillaServerFacade.java:97)\n\tat org.eclipse.mylar.internal.bugzilla.core.BugzillaOfflineTaskHandler.downloadTaskData(BugzillaOfflineTaskHandler.java:80)\n\tat org.eclipse.mylar.tasks.ui.SynchronizeTaskJob.run(SynchronizeTaskJob.java:101)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)",
    "Just to clarify, that second scenario above \"VPN\u0027d and NOT SSH\u0027d (still doesn\u0027t work)\" did you mean \"SSH\u0027d and NOT VPN\u0027d\"?",
    "Sorry about the confusion - you are right.  It should be SSH\u0027d and NOT VPN\u0027d",
    "The exception posted in comment#32 indicates that the host isn\u0027t listening on port 8889. This is very strange since you are able to query the server. I\u0027m going to look into this further and will get back to you asap. In the mean time, could you try opening a report with your repository configured for anonymous access and see if this has some effect? Thanks.  ",
    "I\u0027ll see if the admin guys will be willing to allow anon access temporarily.",
    "Also, in the Eclipse toolbar menu go to Search \u003e Search... \u003e Task Search, select the repository in question and press Update Attributes from Repository.  Let me know if the fields populate with values or if it remains blank.",
    "Task Search works when I\u0027m SSH\u0027d and using http://localhost:8889",
    "I spent more time on this yesterday to see if perhaps some invalid url construction was causing this upon task retrieval but again I couldn\u0027t re-produce. The only time I came remotely close to reproducing was when the web host was doing redirection which would cause a problem but you aren\u0027t seeing html \u0027move\u0027 related exceptions so I\u0027ve hit a dead end again. You mentioned you might be willing to download the source and set a few break points, perhaps that is our next best option?",
    "I\u0027d be happy to do that.  We can coordinate over IM?",
    "Tony: the workspace setup instructions are here http://wiki.eclipse.org/index.php/Mylar_Contributor_Reference#Workspace_setup\n\nIf you have any problems getting set up it would be good if you could update those.  Feel free to post questions about that on this bug report in case Rob is more responsive on Bugzilla than on IM, since it\u0027s our practice to assist with debugging/configuration stuff on Bugzilla whenever possible (so that the conversations are captured for others to reuse if needed).",
    "Tony, have you had a chance to look at this?",
    "I have my environment all set.  Want to give me the breakpoints I should set?",
    "It looks like an exception is being thrown around line 57 in AbstractReportFactory because connection is refused. So just set a break point at line 55 where the WebClientUtil.openUrlConnection(url, proxySettings, false) call is and check that the url is sound....then we can go from there. Set the break point and then just right click on a hit and select synchronize which should exercise this code.",
    "here\u0027s what i found.  line 115 returns and we get to the finally pretyt much right away when i get a task from a repository that works (like the bugs.eclipse.org), but it takes a long time using my example, but it still gets to the finally clause...\n\n...and then after the finally, the ConnectionExcpetion is caught inside downloadTaskData of BugzillaOfflineTaskHandler",
    "Great. Lets just confirm that we\u0027re getting data by adding the line: System.err.println(characters); just after line 71 in the SaxBugReportContentHandler.characters(..) method. This will spit out the data (if any) we\u0027re getting back in each xml element.",
    "I can\u0027t figure out what\u0027s going on - there are some inconsistencies in tracing through.  Without ever vpn\u0027ing in (only tunneled), I was once able to retrieve a task.  I was tracing deep through the call stack, and the only thing I can figure out is that this \"run\" had enough time to complete the task, whereas normally, it times out.",
    "Okay thanks Tony! I\u0027ve had one other user mention similar behavior so will investigate the possibility of timeouts causing this problem.",
    "Hey Rob - any updates?",
    "There were some changes to task data retrieval that made it into 0.8 release. Could you give this release a shot.  I still haven\u0027t been able to reproduce and therefore solve out-right though. Some more major changes are ahead for 0.9 as I\u0027ll be moving to apache\u0027s HttpClient library exclusively.  ",
    "Tony, I\u0027ve made some major changes in task data retrieval (switched to Apache HttpClient from java\u0027s URLConnection). I\u0027ve also added http authentication to the mix. Mik will be cutting a dev build that includes these changes this afternoon. It would be great if you could test with it. I\u0027ll post the version number so you\u0027re sure to have the correct build. ",
    "There were some encoding issues in last nights build. We\u0027ll be cutting another dev build Friday evening that fixes these issues and others (targets M3).",
    "Hi Tony, any chance you could test with the latest release (0.9)?",
    "It\u0027s now working!  And it only took 54 comments ;)",
    "Great! Thanks for the confirmation Tony.",
    "Wow, talk about persistence guys, nice work on all sides :)  Marking this as a \"greatbug\" due to the trickiness (problems with java.net.URL failures), and the amount of collaboration needed to figure out that we had had to go as far as changing our authentication/connection architecture to resolve it."
  ],
  "commentCreationDates": [
    "2006-08-22T20:22:12+02:00",
    "2006-08-22T21:31:42+02:00",
    "2006-08-22T21:40:29+02:00",
    "2006-08-22T21:48:57+02:00",
    "2006-08-22T21:58:21+02:00",
    "2006-08-22T21:59:31+02:00",
    "2006-08-22T22:09:21+02:00",
    "2006-08-22T22:40:33+02:00",
    "2006-08-22T23:06:22+02:00",
    "2006-08-23T00:21:41+02:00",
    "2006-08-23T01:03:57+02:00",
    "2006-08-23T18:52:30+02:00",
    "2006-08-23T23:57:47+02:00",
    "2006-08-24T00:20:02+02:00",
    "2006-08-25T19:12:37+02:00",
    "2006-08-25T23:33:48+02:00",
    "2006-08-28T22:38:12+02:00",
    "2006-08-29T19:45:19+02:00",
    "2006-08-29T21:13:22+02:00",
    "2006-08-29T21:33:30+02:00",
    "2006-08-29T21:48:50+02:00",
    "2006-08-29T21:57:22+02:00",
    "2006-08-29T22:08:29+02:00",
    "2006-08-29T22:14:59+02:00",
    "2006-08-29T23:47:19+02:00",
    "2006-08-30T00:07:47+02:00",
    "2006-09-06T18:40:54+02:00",
    "2006-09-06T18:50:25+02:00",
    "2006-09-15T00:57:17+02:00",
    "2006-09-15T18:16:19+02:00",
    "2006-09-15T23:55:23+02:00",
    "2006-09-23T03:50:03+02:00",
    "2006-09-23T08:43:01+02:00",
    "2006-09-25T19:58:29+02:00",
    "2006-09-25T20:33:26+02:00",
    "2006-09-27T21:53:48+02:00",
    "2006-09-27T22:39:25+02:00",
    "2006-09-28T00:32:47+02:00",
    "2006-09-28T07:24:17+02:00",
    "2006-09-29T00:49:23+02:00",
    "2006-09-29T18:31:08+02:00",
    "2006-09-29T19:46:17+02:00",
    "2006-10-10T18:38:20+02:00",
    "2006-10-11T07:12:34+02:00",
    "2006-10-11T18:40:05+02:00",
    "2006-10-11T19:29:24+02:00",
    "2006-10-11T19:37:47+02:00",
    "2006-10-16T21:26:22+02:00",
    "2006-10-16T21:33:01+02:00",
    "2006-10-24T18:40:35+02:00",
    "2006-10-24T18:49:19+02:00",
    "2006-11-01T18:07:15+01:00",
    "2006-11-03T05:02:35+01:00",
    "2006-11-14T17:39:19+01:00",
    "2006-11-14T20:22:46+01:00",
    "2006-11-14T20:40:12+01:00",
    "2006-11-15T04:04:50+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.net.ConnectException",
      "message": "Connection refused: connect",
      "elements": [
        {
          "method": "java.net.PlainSocketImpl.socketConnect",
          "source": "Native Method"
        },
        {
          "method": "java.net.PlainSocketImpl.doConnect",
          "source": "Unknown Source"
        },
        {
          "method": "java.net.PlainSocketImpl.connectToAddress",
          "source": "Unknown Source"
        },
        {
          "method": "java.net.PlainSocketImpl.connect",
          "source": "Unknown Source"
        },
        {
          "method": "java.net.Socket.connect",
          "source": "Unknown Source"
        },
        {
          "method": "sun.net.NetworkClient.doConnect",
          "source": "Unknown Source"
        },
        {
          "method": "sun.net.www.http.HttpClient.openServer",
          "source": "Unknown Source"
        },
        {
          "method": "sun.net.www.http.HttpClient.openServer",
          "source": "Unknown Source"
        },
        {
          "method": "sun.net.www.http.HttpClient.parseHTTP",
          "source": "Unknown Source"
        },
        {
          "method": "sun.net.www.protocol.http.HttpURLConnection.getInputStream",
          "source": "Unknown Source"
        },
        {
          "method": "java.net.HttpURLConnection.getResponseCode",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.AbstractReportFactory.collectResults",
          "source": "AbstractReportFactory.java:57"
        },
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.RepositoryReportFactory.populateReport",
          "source": "RepositoryReportFactory.java:44"
        },
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.BugzillaServerFacade.getBug",
          "source": "BugzillaServerFacade.java:97"
        },
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.BugzillaOfflineTaskHandler.downloadTaskData",
          "source": "BugzillaOfflineTaskHandler.java:80"
        },
        {
          "method": "org.eclipse.mylar.tasks.ui.SynchronizeTaskJob.run",
          "source": "SynchronizeTaskJob.java:101"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 32,
      "bugId": "154729",
      "date": "2006-09-23T08:43:01+02:00",
      "product": "Mylyn",
      "component": "Bugzilla",
      "severity": "normal"
    }
  ],
  "groupId": "154729",
  "bugId": "154729",
  "date": "2006-08-22T20:22:12+02:00",
  "product": "Mylyn",
  "component": "Bugzilla",
  "severity": "normal"
}