{
  "comments": [
    "Hello,\n\nI\u0027m a committer on the squirre-sql project on SourceForge and I recently \nstarted having difficulty committing files using the Team Synchronization\nperspective.  When I select a file in the outgoing changes list and access\n\"Commit\" from the context menu, I receive an internal error in a dialog \nwith the same text as what I see in the log:\n\n!SESSION 2006-09-02 11:12:29.470 -----------------------------------------------\neclipse.buildId\u003dM20060629-1905\njava.version\u003d1.5.0_06\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dlinux, ARCH\u003dx86, WS\u003dgtk, NL\u003den_US\nCommand-line arguments:  -os linux -ws gtk -arch x86 -data /home/manningr/workspace\n\n!ENTRY org.eclipse.team.ui 4 0 2006-09-02 11:16:56.296\n!MESSAGE Internal error occurred.\n!STACK 0\njava.lang.NullPointerException\n        at org.eclipse.team.internal.ui.mapping.ResourceModelParticipantAction.getTraversals(ResourceModelParticipantAction.java:116)\n        at org.eclipse.team.internal.ui.mapping.ResourceModelParticipantAction.getResourceTraversals(ResourceModelParticipantAction.java:51)\n        at org.eclipse.team.internal.ccvs.ui.mappings.CommitAction.access$0(CommitAction.java:1)\n        at org.eclipse.team.internal.ccvs.ui.mappings.CommitAction$1.run(CommitAction.java:78)\n        at org.eclipse.jface.operation.ModalContext$ModalContextThread.run(ModalContext.java:113)\n\n\nThis functionality worked perfectly up until today.  The only change I made \nto Eclipse preferences today was to add junit.jar to the ant home jars.  I \ntried removing it from preferences, but unfortunately, no change in behavior\nfrom the Team synchronization perspective.  Incidentally, I seem to still be\nable to commit using the Team context menu in the Java perspective.\n\nRob Manning",
    "I managed to get past this issue by accessing the \"Synchronize CVS\" wizard \nand de-selecting the \"Java workspace\" resource.  I had tried repeatedly to \nre-synchronize both without any luck before.  Not sure if this is relevant \nat all, but I thought it might be useful for someone to know.\n\nRob",
    "This has been fixed in the 3.2.1 and 3.3 development streams.\n\n*** This bug has been marked as a duplicate of 146833 ***",
    "Thanks for pointing that out. Sorry for the dup. But I did a search before \nfiling the bug for \"ResourceModelParticipantAction.getTraversals\" and it \nturned up nothing.  \n\nAlso, I thought I had the latest release build of 3.2.  I had no idea that\nthere was a 3.2.1 release.  Looking at the following page there is still no \nindication that 3.2.1 has been released:\n\nhttp://download.eclipse.org/eclipse/downloads/\n\nNow I know that \"3.2 Stream Maintenance Build\" actually means 3.2.1 \nbecause I connected the dots (I saw this same id in the other bug\nposting - M20060830-0800)\n\nI would have downloaded M20060830-0800 (a.k.a 3.2.1) and tested it \ninstead of filing the bug if I had known.  Not sure how I would \nchange the downloads page to make this more apparent, but I thought \nI\u0027d at least point it out in case someone else has the same problem.  \nI\u0027m not sure if this is relevant, but the update manager failed to \nfind this update when I ran it (although it did update a couple of \nmy plugins)\n\nRob Manning",
    "Sorry for the confusion of my last comment. I will attempt to clarify. The 3.2.1 release is due sometime in mid to late September. The M (maintenance) builds are similar to I (integration) builds in the sense that they are stable enough to use but are not an official release. In reality, M builds are usually of the same quality as a release build but there are no guarantees of this until the official release occurs. Therefore, I would say that it would be probably be safe for you to upgrade to M20060830-0800 if this problem is stopping you from working (or if you want to help with testing) but, if it is not, you may want to wait for the release. The 3.2.1 build will be available through the update site when it is officially released.",
    "No problem.  I downloaded the \"M\" build and I\u0027ll run that so I can \nprovide more relevant feedback in the future.  Thanks for \nclarifying.\n\nRob"
  ],
  "commentCreationDates": [
    "2006-09-02T17:21:45+02:00",
    "2006-09-02T17:31:00+02:00",
    "2006-09-05T16:44:45+02:00",
    "2006-09-05T17:03:19+02:00",
    "2006-09-05T17:24:42+02:00",
    "2006-09-05T17:41:18+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.team.internal.ui.mapping.ResourceModelParticipantAction.getTraversals",
          "source": "ResourceModelParticipantAction.java:116"
        },
        {
          "method": "org.eclipse.team.internal.ui.mapping.ResourceModelParticipantAction.getResourceTraversals",
          "source": "ResourceModelParticipantAction.java:51"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.mappings.CommitAction.access$0",
          "source": "CommitAction.java:1"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.mappings.CommitAction$1.run",
          "source": "CommitAction.java:78"
        },
        {
          "method": "org.eclipse.jface.operation.ModalContext$ModalContextThread.run",
          "source": "ModalContext.java:113"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "156035",
      "duplicateId": "146833",
      "date": "2006-09-02T17:21:45+02:00",
      "product": "Platform",
      "component": "CVS",
      "severity": "major"
    }
  ],
  "groupId": "146833",
  "bugId": "156035",
  "duplicateId": "146833",
  "date": "2006-09-02T17:21:45+02:00",
  "product": "Platform",
  "component": "CVS",
  "severity": "major"
}