{
  "comments": [
    "Unfortunately I don\u0027t have a concrete set of steps to be able to reproduce this problem but I have encountered it many times and I think it at least needs to be investigated.\n\nOccasionally when I launch a test suite, the launch progress starts at 51% and slowly increments to 54%.  It just hangs at 54% without any errors until it times out.  I have personally encountered this problem many times with the auto GUI test suite.  It usually occurs after launching a set of test suites successfully.  The behavior almost leads me to believe that there is something wrong in the cleaning process after each launch.  Any successive launch after the problem will yield the same result.  Users are often forced to restart the Agent Controller and/or quit the workbench to be able to launch test suite successfully again.",
    "This maybe an IAC/AC co-existence problem.  Nevertheless, the test execution harness can do a better job at implementing a fail safe policy.",
    "I too have experienced this numerous times and have always just restarted the workbench and restarted the AC locally after stopping the old AC process. This works but it is difficult to use for a novice user who does not get an error message, especially since this often occurs after a successful test execution.",
    "Marking this as critical because restarting the workbench/agent controller does not always solve the problem.  I can reproduce this problem on multiple platforms.  The latest execution on Linux yields the following exception in the terminal:\n\nException in thread \"org.eclipse.hyades.execution.core.task.ReusableThread@59045904\" java.lang.NullPointerException\n        at org.eclipse.hyades.execution.local.util.AgentControllerDescriptor.versionIsAtLeast(AgentControllerDescriptor.java:67)\n        at org.eclipse.hyades.execution.local.util.AgentControllerDescriptor.isVersionAtLeast(AgentControllerDescriptor.java:194)\n        at org.eclipse.hyades.execution.local.file.FileManagerFactory$3.run(FileManagerFactory.java:414)\n        at org.eclipse.hyades.execution.core.task.ReusableThread.run(ReusableThread.java:131)\n        at java.lang.Thread.run(Thread.java:797)\n",
    "When I updated to a more recent version of Agent Controller, the execution worked properly.  I was using a TPTP4.3 AC that was about a month older than a TPTP4.3 workbench.",
    "Ali,\n\nThe stack trace you attached indicates that the Agent Controller is either missing the org.eclipse.hyades.execution plugin, or the plugin does not contain version information (which would be a packaging defect in the agent controller.)  We could have a different exception to throw in this case, but we couldn\u0027t work properly, because without knowing the version of the agent controller, we don\u0027t know what file transfer protocol to use.  We could guess and use the new one, but the fact is that this information should always be available.\n\nReducing severity back to major, as the problem discussed above appears to be unrelated to the initial defect.\n\nPlease turn the log level to high and log detail to debug in your agent controller install, and attach your log file to this defect if you are able to reproduce this problem.  Other consumer are also reporting occasional problems creating a session with the agent controller, and we really need more detail to track this down.",
    "May be related to https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d159179",
    "I have spent several days investigating this further, and I think I have narrowed the problem down to an AC problem.  This defect has a fair amount of noise that won\u0027t help the investigation, so I have filed a new defect with the information I have gathered and I\u0027m going to dupe this defect to the new one.\n\n*** This bug has been marked as a duplicate of 160564 ***",
    "ACTION: Please verify/close this defect.",
    "Closing..."
  ],
  "commentCreationDates": [
    "2006-09-08T16:57:16+02:00",
    "2006-09-14T19:55:01+02:00",
    "2006-09-18T16:39:16+02:00",
    "2006-09-25T23:19:31+02:00",
    "2006-09-25T23:26:33+02:00",
    "2006-10-03T20:08:20+02:00",
    "2006-10-03T20:08:58+02:00",
    "2006-10-11T23:20:00+02:00",
    "2006-11-16T14:02:46+01:00",
    "2006-11-16T14:58:11+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.hyades.execution.local.util.AgentControllerDescriptor.versionIsAtLeast",
          "source": "AgentControllerDescriptor.java:67"
        },
        {
          "method": "org.eclipse.hyades.execution.local.util.AgentControllerDescriptor.isVersionAtLeast",
          "source": "AgentControllerDescriptor.java:194"
        },
        {
          "method": "org.eclipse.hyades.execution.local.file.FileManagerFactory$3.run",
          "source": "FileManagerFactory.java:414"
        },
        {
          "method": "org.eclipse.hyades.execution.core.task.ReusableThread.run",
          "source": "ReusableThread.java:131"
        },
        {
          "method": "java.lang.Thread.run",
          "source": "Thread.java:797"
        }
      ],
      "number": 0,
      "commentIndex": 3,
      "bugId": "156713",
      "duplicateId": "160564",
      "date": "2006-09-25T23:19:31+02:00",
      "product": "TPTP Testing",
      "component": "Test.Execution.ExecutionHarness",
      "severity": "major"
    }
  ],
  "groupId": "160564",
  "bugId": "156713",
  "duplicateId": "160564",
  "date": "2006-09-08T16:57:16+02:00",
  "product": "TPTP Testing",
  "component": "Test.Execution.ExecutionHarness",
  "severity": "major"
}