{
  "comments": [
    "Driver:  WTP 1.5.1 09/22 0504\n\nIn the J2EE Project Explorer view, a deployed JSR-109 Echo Web Service would should up under:\n\n  JSR-109 Web Services\n  - Clients\n  - Services\n    - EchoService   \n      - Service Classes\n        - ServiceImpl:  echo_Echo\n\nSelect the Service Classes and either bring up the Create Web Service pop-up or the New wizard -\u003e Web Services -\u003e Web service, have the service scale set to DEVELOP, click Next would result in:\n\nIWAB0014E Unexpected exception occured.\n  org.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServiceImplBeanImpl incompatible with java.lang.String\n      java.lang.ClassCastException: org.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServiceImplBeanImpl incompatible with java.lang.String\n      at org.eclipse.jst.ws.internal.creation.ui.extension.PreServiceDevelopCommand.execute(PreServiceDevelopCommand.java:107)\n      at org.eclipse.wst.command.internal.env.core.fragment.CommandFragmentEngine.runCommand(CommandFragmentEngine.java:413)\n\n\nSelecting ServiceImpl would result in similar exception:\n\nIWAB0014E Unexpected exception occured.\n  org.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServletLinkImpl incompatible with java.lang.String\n      java.lang.ClassCastException: org.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServletLinkImpl incompatible with java.lang.String\n      at org.eclipse.jst.ws.internal.creation.ui.extension.PreServiceDevelopCommand.execute(Unknown Source)\n      at org.eclipse.wst.command.internal.env.core.fragment.CommandFragmentEngine.runCommand(Unknown Source)\n\nIf I click Browse on the first page of the wizard to select the class again, then this problem does not occur.",
    "Targetted to 1.5.2.",
    "Created an attachment (id\u003d51357)\nPatch for org.eclipse.jst.ws.creation.ui\n\n",
    "Under the JSR-109 Web Services branch of the J2EE Project Explorer, \n\nif the \"Service Classes\" is selected to Create Web service, the selection object is:\n\norg.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServiceImplBeanImpl\n\nif the \"ServiceImpl\" class selected, the selection object is:\n\norg.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServletLinkImpl\n\nIn both cases, it would cause a ClassCastException in PreServiceDevelopCommand on the line:\n\nString impl \u003d (String)(selection_.getSelection())[0];\n\nWhen the ServerWizardWidget is called, the internalized() method is called to pass the object selection to the IObjectSelectionLaunchable as the intial selection, the JavaBeanSelectionLaunchable is already handling these J2EE objects.  We just need to call getObjectSelection() on the launchable to get the proper value to pass to the Web service extension.\n\nSimilar changes is not made when the objectSelectionWidget is not an IObjectSelectionLaunchable because first of all, the problem does not occur in when the initial selection a WSDL file, so no point in fixing something that ain\u0027t broke.  Secondly, the getObjectSelection() of WSDLSelectionWidget is currently returning a WSDLSelectionWrapper object which would cause a ClassCastException on the same line in PreServiceDevlopCommand.  This could be address later on in bug 159622.\n\nSo in summary, the problem we are trying to fix is:\n\n- The Problem:  ClassCastException when Creating Web service from the JSR-109 Web Services branch of the J2EE Project Explorer.  This problem mostly affects adoptors since we cannot create JSR-109 Web Services in WTP but it could be used to consume it.\n\n- The Fix: 1 line change to ServiceWizardWidget to get the object selection from the object selection extender\n\n- Workaround:  If this problem is not fixed, the workaround is not to select artifacts in the JSR-109 Web Services branch of the J2EE Project Explorer when creating Web service.  Another workaround is to click the Browse button in the Web Service wizard and click OK to select the Java class before completing the Web Service wizard.\n\n- Testing Done:\n\n I\u0027ve tested this patch in:\n\n- bottom-up when the initial selection is:\n    - the Java bean in src folder\n    - selected using the Browse button in the Web Service wizard\n    - the Service Classes in the JSR-109 Web Services -\u003e Services folder\n    - the ServiceImpl in the JSR-109 Web Services -\u003e Services folder\n\n- top-down and client:\n  - intial selection is WSDL file in Web projects, in JSR-109 Web Services Services or Client folders\n  - URL copied and pasted or typed in either first page of the wizard or in the browse button\n    ",
    "Does this problem occur when selecting \"EchoService\"?",
    "No.  The problem does not occur when EchoService is selected since the \"Create Web Service\" pop-up is not available, only the popups that normally shows up for WSDL files are there (i.e.Generate Java bean skeleton, Generate client, Test with WSE etc.)",
    "PMC, would you please approve this for WTP 1.5.2.\n\nThis is a regression in which the wizards launched via \"File - New\" or via a corresponding context menu action will fail after page one with an internal error whenever the initially selected object is one of the implementation nodes under a Web service node in the JSR-109 Web Services branch of the Project Explorer.\n\nClicking the \"Browse\" button next to the implementation type field on page one of the wizard, then closing the resulting dialog with \"OK\", will workaround the problem, however, this defeats the value of having an initial selection. The only other workaround is to avoid the JSR-109 Web services branch altogether, which of course defeats a large part of the purpose and value of the branch.\n\nThe fix is simple and isolated, effectively asking the extension code for the chosen scenario (Java bottom up, in this case) for its interpretation or transformation of the selected object - something that happens at the end of the \"Browse\" dialog.\n\nThanks - CB.",
    "+1\n\nAgree the fix is \u0027critical\u0027 for adopters. Well documented fix esp. the note on the testing.",
    "+1",
    "Released to WTP 1.5.2 as v200610042148.  Will release to HEAD shortly.",
    "Also released to HEAD as v200610050239.",
    "+1\n",
    "+1 for WTP 1.5.2",
    "Verified on WTP 1.5.2 20061006 driver."
  ],
  "commentCreationDates": [
    "2006-09-28T18:44:50+02:00",
    "2006-10-02T14:39:48+02:00",
    "2006-10-03T19:30:57+02:00",
    "2006-10-03T20:06:20+02:00",
    "2006-10-04T16:54:41+02:00",
    "2006-10-04T17:02:59+02:00",
    "2006-10-04T19:26:39+02:00",
    "2006-10-04T20:42:14+02:00",
    "2006-10-04T23:05:12+02:00",
    "2006-10-04T23:45:57+02:00",
    "2006-10-05T04:42:56+02:00",
    "2006-10-05T20:11:29+02:00",
    "2006-10-05T20:18:54+02:00",
    "2006-10-10T23:28:56+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassCastException",
      "message": "org.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServiceImplBeanImpl incompatible with java.lang.String",
      "elements": [
        {
          "method": "org.eclipse.jst.ws.internal.creation.ui.extension.PreServiceDevelopCommand.execute",
          "source": "PreServiceDevelopCommand.java:107"
        },
        {
          "method": "org.eclipse.wst.command.internal.env.core.fragment.CommandFragmentEngine.runCommand",
          "source": "CommandFragmentEngine.java:413"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "159142",
      "date": "2006-09-28T18:44:50+02:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "critical"
    },
    {
      "exceptionType": "java.lang.ClassCastException",
      "message": "org.eclipse.jst.j2ee.webservice.wsdd.internal.impl.ServletLinkImpl incompatible with java.lang.String",
      "elements": [
        {
          "method": "org.eclipse.jst.ws.internal.creation.ui.extension.PreServiceDevelopCommand.execute",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.wst.command.internal.env.core.fragment.CommandFragmentEngine.runCommand",
          "source": "Unknown Source"
        }
      ],
      "number": 1,
      "commentIndex": 0,
      "bugId": "159142",
      "date": "2006-09-28T18:44:50+02:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "critical"
    }
  ],
  "groupId": "159142",
  "bugId": "159142",
  "date": "2006-09-28T18:44:50+02:00",
  "product": "Web Tools",
  "component": "jst.ws",
  "severity": "critical"
}