{
  "comments": [
    "Whenever you drag and drop a jar file from a windows explorer for example, into an  EAR, the jar is tried to be expanded into a j2ee module project.  This may not be the desired behavior when you really just want to drop a jar.  Workaround is to switch to resource perspective.\n\nSometimes you get the followng:\nI tried to drag a jar file from Windows Explorer to my EAR project within RAD.  I receied an error:\nImporting Java Enterprise Edition Artifacts...\nAn Internal error occured during: \"Importing Java Enterprise Edition artificats...\".\n\nAnd got this NPE in my log:\n!ENTRY org.eclipse.core.jobs 4 2 2006-09-29 10:33:05.140\n!MESSAGE An internal error occurred during: \"Importing Java Enterprise Edition a\nrtifacts ...\".\n!STACK 0\njava.lang.NullPointerException\n        at org.eclipse.jst.j2ee.navigator.internal.dnd.ImportJ2EEModuleDropAssis\ntant$1.run(Unknown Source)\n        at org.eclipse.core.internal.jobs.Worker.run(Unknown Source)",
    "Created an attachment (id\u003d57021)\npatch\n\nThe behavior is now changed to be as follows:\n\nIf the archive being dropped is a just a utility jar, containing images etc, it will simply be dropped in as a file. Else it will be imported. Thanks.",
    "approved... - only question for Jason would be...  do we want to emulate the behavior in EAR import, keeping the binary module files in the ear project as well?",
    "holding off dropping tonight until Jason evaluates\n",
    "Created an attachment (id\u003d57093)\npatch\n\n",
    "Approve.  Dropped code to both 1.5.3 and 2.0 streams.  Please resolve as fixed.",
    "fixed.",
    "Verified with the wtp-sdk-M-1.5.3-200702010713 driver. \n\nIf I drag and drop a regular jar then the file is added under the EAR project file structure. If I drag and drop an EJB project jar then it is imported to the workspace as EJB project. In both cases, the a J2EE Module Dependency is added in the EAR to the correponding jar. ",
    "Verified with the wtp-sdk-I-I200702011746-200702011746 driver as well. \n\nOne additional remark. The EJB project jar is imported in the workspace only and if only dragged and dropped on the ear project node. Otherwise (e.g. if dragged and dropped on the EarContent folder), it is added (like regular jar) under the file structure of the ear project. \n\nIf the above behavior is OK, then please change the status to VERIFIED. ",
    "verified in WTP 153 0206 2007",
    "verified by Raj",
    "closing."
  ],
  "commentCreationDates": [
    "2006-09-29T18:33:24+02:00",
    "2007-01-17T17:17:13+01:00",
    "2007-01-18T01:39:50+01:00",
    "2007-01-18T01:40:17+01:00",
    "2007-01-18T17:20:15+01:00",
    "2007-01-23T20:24:58+01:00",
    "2007-01-23T21:47:18+01:00",
    "2007-02-02T16:05:32+01:00",
    "2007-02-05T12:35:41+01:00",
    "2007-02-06T20:04:35+01:00",
    "2007-02-06T20:09:34+01:00",
    "2007-02-06T20:09:46+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.jst.j2ee.navigator.internal.dnd.ImportJ2EEModuleDropAssistant$1.run",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Unknown Source"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "159314",
      "date": "2006-09-29T18:33:24+02:00",
      "product": "Web Tools",
      "component": "jst.j2ee",
      "severity": "major"
    }
  ],
  "groupId": "159314",
  "bugId": "159314",
  "date": "2006-09-29T18:33:24+02:00",
  "product": "Web Tools",
  "component": "jst.j2ee",
  "severity": "major"
}