{
  "comments": [
    "the following JUnit is now failing. And, it may be an odd, fringe case (everythign null), but seems to me the problem does indicate a change in code, not the test itself. I\u0027m having a hard time reconciling the stack trace with the released code, but I don\u0027t see how Module construction \u003cinit\u003e can throw a null pointer exception?\n\nBTW, I can run the JUnit test in my dev. environment just fine. \n\nI\u0027ve marked as \"blocker\" since this needs to be resolved before we declare. \n\n\ntest06TestProtected\t\n\njava.lang.NullPointerException\nat org.eclipse.wst.server.core.internal.Module.\u003cinit\u003e(Module.java:50)\nat org.eclipse.wst.server.core.model.ModuleFactoryDelegate.createModule(ModuleFactoryDelegate.java:113)",
    "Just correcting Summary. \n",
    "I see, part of the mystery is that it appears server.core has been fixed, from what has been released for 1.5. \n\nTim, I assume you want to release server.core? \n\n",
    "Having hung out with you too long ;-) and realizing that behavioural change is always bad, I made the fix to Module so that an NPE isn\u0027t thrown in the constructor. Released to 1.5 and 2.0 streams.\n\nThe problem is really in the test, and the fix only delays the NPE to when any other method on the Module is called (which was the previous behaviour). The test was only passing because it creates an invalid module and then doesn\u0027t do anything with it. I will improve the test in 2.0 to make it meaningful.\n\nThe failed JUnit looks bad on the build, but won\u0027t affect any behaviour in WTP and should not stop anyone from testing. Had this been an I-build it is the type of error that in the past we wouldn\u0027t bother fixing before declaring the build, but that\u0027s your call.",
    "This is part of a mass update to close out all stale WTP bugs which are in the resolved state without an appropriate targeted version.  If you feel this bug was closed inappropriately, please reopen."
  ],
  "commentCreationDates": [
    "2006-10-06T06:26:22+02:00",
    "2006-10-06T06:28:25+02:00",
    "2006-10-06T06:36:59+02:00",
    "2006-10-06T17:08:24+02:00",
    "2006-11-28T20:49:15+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.wst.server.core.internal.Module.\u003cinit\u003e",
          "source": "Module.java:50"
        },
        {
          "method": "org.eclipse.wst.server.core.model.ModuleFactoryDelegate.createModule",
          "source": "ModuleFactoryDelegate.java:113"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "159966",
      "date": "2006-10-06T06:26:22+02:00",
      "product": "Web Tools",
      "component": "wst.server",
      "severity": "blocker"
    }
  ],
  "groupId": "159966",
  "bugId": "159966",
  "date": "2006-10-06T06:26:22+02:00",
  "product": "Web Tools",
  "component": "wst.server",
  "severity": "blocker"
}