{
  "comments": [
    "Build: I20061017-0800\n\nI cannot launch an Eclipse Application (runtime workspace) with this build. I just get this error:\n\njava.lang.RuntimeException: Could not find framework\n\tat org.eclipse.core.launcher.Main.getBootPath(Main.java:649)\n\tat org.eclipse.core.launcher.Main.basicRun(Main.java:279)\n\tat org.eclipse.core.launcher.Main.run(Main.java:987)\n\tat org.eclipse.core.launcher.Main.main(Main.java:962)\n\nI\u0027ll try debugging to see what\u0027s going on...",
    "It is computing this value for the install location:\n\nfile:/d:/1target/plugins/org.eclipse.platform/bin/\n\nThen when it goes searching for the framework, it looks for a subdirectory of this directory called \"plugins\".  This of course fails... Note that I have org.eclipse.platform checked out in my dev workspace.",
    "Workaround: I can continue working if I delete org.eclipse.platform from my workspace.",
    "Tom tells me this is a PDE bug.\n\nSteps to reproduce:\n\n1) Launch a new workspace\n2) Checkout org.eclipse.platform from HEAD\n3) Create a runtime workbench launch configuration\n4) On the \"Configuration\" tab, Select \"Use an existing config.ini file as a template\"\n5) Give some bogus location for this template ini file (c:\\does\\not\\exist\\config.ini)\n6) Click run.\n\nThe error above occurs and the framework does not start.",
    "I am trying to understand what the issue here is:\n\n1. The fact that you can\u0027t launch if you enter a bogus template config.ini\n\nOR\n\n2. There is something about org.eclipse.platform being in the workspace\n\n\nif it\u0027s #1, then I would say it\u0027s a user error, rather than a critical defect.  The \u0027existing config.ini option\u0027 is designed to \"keep PDE out of the way and let the user launch whichever way he pleases and shoot himself in the foot if he wanted to\".\n\nif it\u0027s #2, we could take a look, but that code hasn\u0027t changed in a very long time.",
    "I originally marked it critical because I was unable to launch test workspaces at all.  After much debugging and discussion with Tom it appeared to be a problem with PDE not properly setting some variable.  Tom, can you comment?\n\nSince I discovered the true source of the problem was the missing template config.ini file, I am downgrading the severity. However, clearly there needs to at least be better assistance for the hapless end user who has gotten into this state (in my case I switched to a new build, and in doing so blew away my template config.ini file). Not everyone has a Tom handy to help them figure out what\u0027s going wrong ;)",
    "Hapless end users don\u0027t craft their own config.ini ;)",
    "I will point to a humorous comment by Ed Burnette in the bug report that led to the creation of the \u0027existing config.ini\u0027 option:  \n\n\"I don\u0027t know about Pascal but I\u0027d rather that if I specified a config.ini it \nnot be touched, augmented, folded, stapled, or mutilated in any way.\"\n\nbug 72274 comment 2\n\nI agree with Ed that PDE should not be in the business of stapling/folding/mutilating a template config.ini content.\n\nAs for this particular use case though, the entire config.ini was missing.  So it would be good if we had aborted the launch with a message when we detected the missing file.",
    "I have continually been caught by this bug.  IMO PDE should add the following\nproperties to the generated config.ini if they are not already set in the\ntemplate config.ini\n\nosgi.bundles\nosgi.bundles.defaultStartLevel\nosgi.install.area\nosgi.framework\nosgi.configuration.cascaded\nosgi.splashPath\n\nPDE is already \"in the way\" here because it needs to fill out the value of\nosgi.bundles to have absolute paths to the bundles identified in the template\nconfig.ini.\n\nIf the template is missing one of the above properties PDE should just add the\ncorrect one back to the generated config.ini.  If the user really wants to\ncontrol the value of the generated values then they should set the value they\nwant in the template config.ini.  For example, if they really do want the\nconfiguration cascaded then they should set the following in thier template\nconfig.ini :\n\nosgi.configuration.cascaded\u003dtrue\n\nPDE should then detect this property and not override it in the generated\nconfig.ini.\n\nWhile it is a nice position for PDE to take WRT stapling/folding/mutilating a template config.ini content, it already has to for osgi.bundles property.  If it did not then the template config.ini would very painful to use.\n",
    "I\u0027m a bit confused by what the option really does.  It says the custom config.ini is a \"template\", which suggests to me that it will take any values specified there, and use them when building a complete config.ini. If the intent really is that the custom config.ini will not be altered in any way by PDE, then perhaps the \"as a template\" wording should be removed from the preference.",
    "We use the word \u0027template\u0027 because the config.ini is not used directly as-is, since the osgi.bundles paths are adjusted to actual paths of plug-ins.  We don\u0027t want the user to maintain that key or have hardcoded paths in it.\n\nThis way, after you\u0027re done testing, your template config.ini (which contains no hardcoded paths) can be dropped as-is in your final product.",
    "(In reply to comment #10)\n\u003e This way, after you\u0027re done testing, your template config.ini (which contains\n\u003e no hardcoded paths) can be dropped as-is in your final product.\n\nThe osgi.framework property will cause problems here.  Currently if you do not set the property to something in your config.ini template then when you self-host the osgi framework either cannot be found (when you have org.eclipse.platform in your workspace) or it will always use the org.eclipse.osgi which is relative to the startup.jar from your target even when you have org.eclipse.osgi in your workspace.\n\nBrian B. showed me that you can set osgi.framework\u003dorg.eclipse.osgi in your template config.ini and then PDE will fill in the correct path when it generates the config.ini.  But this setting (osgi.framework\u003dorg.eclipse.osgi) will not work in a config.ini to launch a stand-alone eclipse instance.\n\nThe osgi.configuration.cascaded is also problematic.  It would be very rare for someone to want to self-host a configuration which is cascaded with the configuration from your target.  A template config.ini is required to add osgi.configuration.cascaded\u003dfalse otherwise the self-hosted instance will be cascaded.",
    "modified summary to reflect the current request",
    ":)\n\nEntirely separate from the \"touch/augment/fold/staple\" discussion, my particular problem turned out to be a *missing* template config.ini file. Minimally the launch configuration dialog should flag an error when you enter a non-existent config.ini as a template.  It would also be nice if the missing file could be detected at launch time and a better error presented.",
    "right.  the error message is captured in comment 7 and will be addressed.  unfortunately, it makes for a boring title.",
    "*** Bug 169905 has been marked as a duplicate of this bug. ***",
    "Fixed in 3.3M5.  We now add the 6 properties specified in comment 8 if they are not present in the config.ini template file."
  ],
  "commentCreationDates": [
    "2006-10-17T17:33:51+02:00",
    "2006-10-17T17:47:23+02:00",
    "2006-10-17T18:04:06+02:00",
    "2006-10-17T19:19:55+02:00",
    "2006-10-17T20:08:25+02:00",
    "2006-10-17T20:17:13+02:00",
    "2006-10-17T20:21:34+02:00",
    "2006-10-17T20:31:49+02:00",
    "2006-10-17T20:36:51+02:00",
    "2006-10-17T21:04:27+02:00",
    "2006-10-17T21:54:25+02:00",
    "2006-10-18T00:02:04+02:00",
    "2006-10-28T08:02:12+02:00",
    "2006-10-30T15:00:38+01:00",
    "2006-10-30T15:05:36+01:00",
    "2007-01-08T23:02:07+01:00",
    "2007-01-11T23:54:26+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.RuntimeException",
      "message": "Could not find framework",
      "elements": [
        {
          "method": "org.eclipse.core.launcher.Main.getBootPath",
          "source": "Main.java:649"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:279"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:987"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:962"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "161265",
      "date": "2006-10-17T17:33:51+02:00",
      "product": "PDE",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "161265",
  "bugId": "161265",
  "date": "2006-10-17T17:33:51+02:00",
  "product": "PDE",
  "component": "UI",
  "severity": "normal"
}