{
  "comments": [
    "Hello Mylar Team,\n\nIf Mylar is used together with Subversive, change sets work differently depending on plugin installation order. In particular:\n- When all Mylar and Subversive features are installed simultaneously, change sets are working correctly\n- If JIRA and Bugzilla Mylar features are not installed or Subversive with Mylar integration is installed before Mylar, change sets don\u0027t displayed in the Synchronize view\n\nSee details: http://forums.polarion.org/viewtopic.php?t\u003d580\n\nDo you have a clue what can be the reason?\n\nBest regards,\nIgor Vinnykov\nSubversive Team",
    "Which change sets mode are you using?  See http://wiki.eclipse.org/index.php/Mylar_FAQ#Active_Change_Set_management for an explanation and trouble shooting. \n\nAlso, when this happens, and you deactivate and then activate the task, does the change set reappear?  I would be happy to investigate further, just point me at the source location I should check out.",
    "Hello Mik,\n\n(In reply to comment #1)\n\u003e Which change sets mode are you using?  See\n\u003e http://wiki.eclipse.org/index.php/Mylar_FAQ#Active_Change_Set_management for an\n\u003e explanation and trouble shooting. \n\nWe use \"standard\" change sets and our implementation provides an ability to see incoming and outgoing change sets simultaneously in the \"Both\" mode of Synchronize View or separately for \"Incoming\" and \"Outgoing\" modes.\n\n\u003e Also, when this happens, and you deactivate and then activate the task, does\n\u003e the change set reappear?  \n\nIn case of any manipulation with task change set doesn\u0027t appear. The same situation, which we see was reported by other people.\n\n\u003e I would be happy to investigate further, just point\n\u003e me at the source location I should check out.\n\nYou can get the Subversive source code (with the Mylar integration) here: http://svn.polarion.org/repos/community/Subversive\n\nBest regards,\nIgor Vinnykov\nSubversive Team",
    "Sorry for the slowness Igor, will investigate this tomorrow.",
    "Igor, I just set up my workspace for Subversive, tried to reproduce this with various configurations, but could not get the change sets to fail showing up.  We streamlined all of the startup for 0.8 because we experienced similar race conditions, so from what I can currently discern this is a 0.7 only problem?  Could you please try to reproduce with the latest?  We will be making a dev build available in about two hours so it is best if you use that (download.eclipse.org/technology/mylar/update-site/dev), but you could also try this with 0.8.  Note that I tested on an Eclipse 3.3M3 integration build, but that should not matter.  Please reopen this bug report if you can still reproduce.\n\nOther comments:\n\n* I will keep the org.eclispe.polarion.team.svn.mylar project checked out into my workspace so that I can notify you of API changes.\n\n* It\u0027s great that you guys made the Quickstart page for Mylar, I linked it from our FAQ.\n\n* On the update site, all features in the \"Subversive Clients\" category mistakenly \"The feature allows to integrate Subversive team provider with Mylar project\" as their description.  For the Mylar feature I suggest something that makes it clear what it adds, e.g. \"Provides integration with Mylar\u0027s change set management\".  For the others I think it would help to be very clear on what they provide because it\u0027s unclear to a novice which should be installed.\n\n* I suggest calling the update site category \"Subversive Integration\" instead of using the plural.",
    "Hello Mik,\n\nThank you for investigations. Originally we didn\u0027t specify dependency of Subversive Mylar integration from the Mylar, so if someone installed Subversive Mylar integration before the Mylar itself then change sets are not work correctly. This problem was resolved since Subversive 1.1.0 M8 build by specifying dependency of Subversive Mylar integration from the Mylar. As a result integration should work. But there are some strange problems with Eclipse update manager, which caused integration problems. We faced them for Subversive update site, so I can suppose that the same situation can have influence on the Subversive Mylar integration.\n\nNamely, when all Subversive features are installed simultaneously, then all works fine, but if some features are installed after other, then following exceptions are happened (for example):\n\n!ENTRY org.eclipse.osgi 4 0 2006-11-08 17:06:29.564\n!MESSAGE An error occurred while automatically activating bundle org.polarion.team.client.javahl.core (127).\n!STACK 0\norg.osgi.framework.BundleException: The activator org.polarion.team.svn.client.javahl.JavaHLPlugin for bundle org.polarion.team.client.javahl.core is invalid\n.....\nCaused by: java.lang.ClassNotFoundException: org.polarion.team.svn.client.javahl.JavaHLPlugin\n at org.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:407)\n....\nRoot exception:\njava.lang.ClassNotFoundException: org.polarion.team.svn.client.javahl.JavaHLPlugin\n at org.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:407)\n \n!ENTRY org.polarion.team.svn.core.svnnature 4 0 2006-11-08 17:06:29.627\n!MESSAGE Subversive: \u0027loadExtension\u0027  operation finished with error\n!SUBENTRY 1 org.polarion.team.svn.core.svnnature 4 0 2006-11-08 17:06:29.627\n!MESSAGE Subversive: \u0027loadExtension\u0027  operation finished with error: Plug-in org.polarion.team.client.javasvn.standard.core was unable to load class org.polarion.team.svn.client.javasvn.standard.JavaSVNClientWrapperFactory.\n!STACK 1\norg.eclipse.core.runtime.CoreException: Plug-in org.polarion.team.client.javasvn.standard.core was unable to load class org.polarion.team.svn.client.javasvn.standard.JavaSVNClientWrapperFactory.\n\n\nI can suppose that it is an Eclipse bug, but we didn?t find related info and unable to reproduce it. Based on this info I think that we should recommend our users to install both projects simultaneously in order to avoid such problems. \n\nThank you for your comments - we will take them into account.\n\nIgor",
    "We experience either the same, or a very similar problem with users installing Mylar.  This is why on the download page we request that users always use the \"Search for new features to install\" option.  I believe that this is largely due to bug 102457, which unfortunately has seen almost no attention.  If installing all features at once always resolves the problem, we should consider whether this is a duplicate of that bug.  And yes, recommending that both projects always be installed/updates simultaneously is a good thing to do.  Are you declaring an exact or a compatible dependency on the org.eclipse.mylar.team version?  If it\u0027s a strict dependency and the user updates Mylar, but does not update the Subversive integration plug-in, the Subversive integration plug-in won\u0027t start.  ",
    "Is it just me, or hyperlink to bug 102457 in Mik\u0027s last comment does not work?",
    "Works for me, but I actually meant to link bug 132450."
  ],
  "commentCreationDates": [
    "2006-10-18T10:42:19+02:00",
    "2006-10-20T23:36:17+02:00",
    "2006-10-23T17:07:40+02:00",
    "2006-10-27T00:54:20+02:00",
    "2006-11-01T23:32:03+01:00",
    "2006-11-09T15:49:45+01:00",
    "2006-11-10T00:41:00+01:00",
    "2006-11-10T01:28:47+01:00",
    "2006-11-10T01:51:53+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "org.polarion.team.svn.client.javahl.JavaHLPlugin",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:407"
        }
      ],
      "number": 0,
      "commentIndex": 5,
      "bugId": "161373",
      "date": "2006-11-09T15:49:45+01:00",
      "product": "Mylyn",
      "component": "Core",
      "severity": "normal"
    },
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "org.polarion.team.svn.client.javahl.JavaHLPlugin",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:407"
        }
      ],
      "number": 1,
      "commentIndex": 5,
      "bugId": "161373",
      "date": "2006-11-09T15:49:45+01:00",
      "product": "Mylyn",
      "component": "Core",
      "severity": "normal"
    }
  ],
  "groupId": "161373",
  "bugId": "161373",
  "date": "2006-10-18T10:42:19+02:00",
  "product": "Mylyn",
  "component": "Core",
  "severity": "normal"
}