{
  "comments": [
    "Description:\nError occurs in Preview after change the group header name\nSteps to reproduce:\n1, Insert a table binding with a dataset.\n2, Group the table with one column such as row[\"customer\"].\n3, Change the group header name to customer111.\n4, Preview the report.\nExpected result:\nThe report can be previewed successfully without any exceptions.\nActual result:\nThe error occurs in Preview, the result can not be previewed.\nError logs:\nColumn binding \"customer\" does not exist.\ndata.engine.ColumnBindingNotExist ( 1 time(s) )\ndetail : org.eclipse.birt.data.engine.core.DataException: Column binding \"customer\" does not exist.at org.eclipse.birt.data.engine.impl.ExprManagerUtil.checkGroupNameValidation(ExprManagerUtil.java:81)\nat org.eclipse.birt.data.engine.impl.ExprManagerUtil.validateColumnBinding(ExprManagerUtil.java:57)\nat org.eclipse.birt.data.engine.impl.ExprManager.validateColumnBinding(ExprManager.java:171)\norg.eclipse.birt.data.engine.impl.ServiceForQueryResults.validateQueryColumBinding(ServiceForQueryResults.java:332)",
    "By \"change group header names\", do you mean change the name of group?\n\nThanks.\nLin",
    "Yes, after step2, we can see there is a group data in group header, and double click that data item then change the Name in \"Edit Data Item\".",
    "This is not a Data bug. We actually function correctly against the given Query definition.\n\nThe current report designer behavior is a bit misleading when user makes operations against column bindings.When user double click a data item, a column binding editor would prompt and user can change the column binding name, type and expression through it.\n\nHowever, change the column binding name has different impact to the report design compare to the changing of column type and expression. For the column binding name actually can be used 1)as part of an expression 2)as key for other data items to reference to an expression. As a result, the column binding editor\u0027s behavior became weird:On one hand, change some of values within (say,type\u0026expression), the data items reference to the very column binding being changed would still valid. On the other hand, if we change the column binding name, then all its reference cross the report design will broke.\n\nA temp solution to this problem might be to limit users\u0027s access to the column binding editor. When user double click data item, we only bring up a column binding selection list(just like what we have done in the very begining).And column binding should be only editable through property editor.This solution can reduce the user confusion little a bit.\n\nThe other solution from a long-term view should be enhance model so that column binding names would not serve as key for a column binding item in the model.There should be kinda of property of all kinds of model structures (DataSet, DataSource, etc.) so that all these structures can be identified through that property rather than their names. If we can achieve that, BIRT would as intelligent as Crystal: in Crystal, when you change the name of an item, all the other report components that refer to the item will be updated automatically.\n\nThe bug is reassigned to Model for further discussion.\n\nThanks.\nLin\n\n\n\n",
    "since the column binding now is only a structure property, it does not have any back reference to refer to any data item who reference it. So it will be a heavy change to do the auto update when user changes the name. I think we can limit user from the designer not to change the column binding name. Also, model can do the check from API.",
    "We can have more discussion to see if we really need this feature. ",
    "Did we have an enh in this area already?",
    "In BIRT 2.2 this has been fixed, by not allowing user to modify the column binding name by double clicking the data item.",
    "resolved in BIRT 2.2",
    "Verified on v20070823-0630 build\nClosed\n\nRegards!"
  ],
  "commentCreationDates": [
    "2006-10-31T06:58:45+01:00",
    "2006-10-31T09:09:25+01:00",
    "2006-11-01T03:19:38+01:00",
    "2006-11-03T08:03:49+01:00",
    "2006-11-13T06:50:23+01:00",
    "2006-12-19T03:32:09+01:00",
    "2007-05-31T02:50:21+02:00",
    "2007-08-09T07:50:32+02:00",
    "2007-08-09T07:51:31+02:00",
    "2007-08-23T10:57:23+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.birt.data.engine.core.DataException",
      "message": "Column binding \"customer\" does not exist.",
      "elements": [
        {
          "method": "org.eclipse.birt.data.engine.impl.ExprManagerUtil.checkGroupNameValidation",
          "source": "ExprManagerUtil.java:81"
        },
        {
          "method": "org.eclipse.birt.data.engine.impl.ExprManagerUtil.validateColumnBinding",
          "source": "ExprManagerUtil.java:57"
        },
        {
          "method": "org.eclipse.birt.data.engine.impl.ExprManager.validateColumnBinding",
          "source": "ExprManager.java:171"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "162848",
      "date": "2006-10-31T06:58:45+01:00",
      "product": "BIRT",
      "component": "Report",
      "severity": "normal"
    }
  ],
  "groupId": "162848",
  "bugId": "162848",
  "date": "2006-10-31T06:58:45+01:00",
  "product": "BIRT",
  "component": "Report",
  "severity": "normal"
}