{
  "comments": [
    "It would be really handy to recognize class names in the bug description and comments (like in bug 164037) and allow to quickly jump into those classes. Similar functionality is provided by AnyEditTools plugin, but it does not work for Task editor.",
    "*** Bug 166397 has been marked as a duplicate of this bug. ***",
    "Handling of fully-qualified class names would help with exceptions, as discussed on bug 166397:\n\nBugzilla editor (and probably others) have nice hyperlinks to the stack trace elements, but not on the exception class. For example:\njava.lang.ExceptionInInitializerError\n\tat \norg.eclipse.mylar.internal.bugzilla.core.BugzillaAttachmentHandler.uploadAttachment(BugzillaAttachmentHandler.java:134)",
    "Mik, this is not exactly the same. Bug 166397 deal with have qualified names and \"exception\" or \"error\" keywords, like detector is already used by Console view.\n\nOn the other hand, this bug is requesting hyperlinking for stuff like \"BugzillaAttachmentHandler\".",
    "While there is a slight difference, I want these tracked as one bug.  Each bug we track adds a little overhead, and the problem and solution for these will be very closely related, which is why I inlined the exception case into this bug.  I doubt that we\u0027re going to parse for \"*Exception\" and \"*Error\" because those may lead to more false positives than detecting fully qualified and camel case naming patterns.",
    "*** Bug 166397 has been marked as a duplicate of this bug. ***"
  ],
  "commentCreationDates": [
    "2006-11-09T22:58:57+01:00",
    "2006-12-01T23:26:34+01:00",
    "2006-12-01T23:28:23+01:00",
    "2006-12-01T23:36:38+01:00",
    "2006-12-02T09:50:32+01:00",
    "2006-12-02T09:52:01+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ExceptionInInitializerError",
      "elements": [
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.BugzillaAttachmentHandler.uploadAttachment",
          "source": "BugzillaAttachmentHandler.java:134"
        }
      ],
      "number": 0,
      "commentIndex": 2,
      "bugId": "164041",
      "date": "2006-12-01T23:28:23+01:00",
      "product": "Mylyn",
      "component": "Tasks",
      "severity": "enhancement"
    }
  ],
  "groupId": "164041",
  "bugId": "164041",
  "date": "2006-11-09T22:58:57+01:00",
  "product": "Mylyn",
  "component": "Tasks",
  "severity": "enhancement"
}