{
  "comments": [
    "Running 0.9.1, I\u0027m unable commit task changes to bugzilla repositories, regardless if update or new. Validation shows that username/password are ok though. Checked bug 165907- likely not the issue as log file stays clean.\nProblem\u0027s not server specific, happens with apache and eclipse sites both. Submission says \u0027failed to submit, probably credentials\u0027.",
    "Andreas, are you running through a proxy? (If so see bug#166540)",
    "No proxy. Same issue on two totally independent networks, too. Working up to 0.8 as far as I remember. Also \u0027validated\u0027 is working- I assume this is using the authentication, too?",
    "Okay, perhaps an encoding issue? Is your repository encoding for eclipse.org set to iso-8859-1? Do you have any characters in your bugzilla userid or password that fall outside this encoding?",
    "No fancy characters. Could do an ethereal trace if of interest?",
    "Yes, that could help. Be sure to obfuscate your uid/pass.  Does this happen for each and every post? Is your IP changing frequently?",
    "Once we get more info (network trace) we try to reproduce. I cannot currently reproduce with latest dev build (download.eclipse.org/technology/mylar/update-site/dev). Setting severity to normal until we find out if this is a defect with our connection handling and not a network issue.",
    "ps. Have you had a look through the faq: http://wiki.eclipse.org/index.php/Mylar_FAQ#Bugzilla_Connector_troubleshooting\n\nAlso, do queries fail? Both through Seach \u003e Search \u003e Task Search  and the tasklist?",
    "No trace yet, but. Created new query against eclipse searching for Mik\u0027s email. Upon synchronizing, receiving an error \"Unrecognized response from server\". My old queries against same server synchronize fine though.",
    "Tried with default (UTF-8) and iso encoding, no difference. Validate is fine in both settings. Network trace is a bit of a problem as bugs.eclipse.org uses HTTPS- any ideas? Possibly an HTTP access available, too?",
    "I\u0027ll email you the username and password for our test bugzilla 2.22 install. Create some queries and open some bugs there and see what happens....\n\nbtw, what are the details of the \"Unrecognized response...\"? Should be getting an html dump?",
    "Ok, the broken response (shown as yellow warning sign in task list) is a red herring. Opening this query in browsers shows the source of the problem: \"You must specify one or more fields in which to search for Mik.Kersten\". Fixing that the query runs fine.\n\nSubmitting to test repository is working, too, unfortunately.",
    "Okay so to summarize, on eclipse.org submitting updates to existing tasks is failing but queries work (you\u0027re able to open the tasks returned from those working queries).  On the test server opening tasks and submitting changes to existing tasks works, queries work too. Yes?\n\n...and you are able to submit changes to eclipse.org via the web? (I realize validation is working but at this point we can\u0027t leave any stone un-turned  ;) )\n\nUsing the latest dev build (0.9.1.v20061206-2200) could you attach a screenshot of the errors you encounter when submitting?\n",
    "All correct. \nWith latest dev build the error message is more explicit- I believe before it has hinting at username only. See screenshot. Validation is still fine.",
    "Created an attachment (id\u003d55270)\nScreenshot of error\n\n",
    "Also interesting, but apparently not giving a pattern is that the tasklist does not pick up this bug- although I\u0027m searching for my email through all possible fields.",
    " (In reply to comment #12)\n\n\u003e ...and you are able to submit changes to eclipse.org via the web? \n\nnot one of my brightest moments. ;)\n\n (In reply to comment #15)\n\u003e Also interesting, but apparently not giving a pattern is that the tasklist does\n\u003e not pick up this bug- although I\u0027m searching for my email through all possible\n\u003e fields.\n\nThis may be our best lead. So when searching via Search \u003e Search ... \u003e Task Search can you locate this report using cpuidle@gmx.de?\n\n\n",
    "Search did find it- and I can now see it in the query, too. Just before searching I had synchronized the query, sorted by ids and checked again- it wasn\u0027t there, now it is? It\u0027s freaking me out...\nAny ideas on the https tracing?",
    "Checking again- submitting via embedded browser is ok, via form is not, even for this \u0027freshly\u0027 found bug.",
    "Well, might as well fire the trace to me and I\u0027ll have a look over it. Oh, and we just release 9.2 so might as well upgrade too. :)",
    "Regarding comment 17, I believe the tasks were there before the search, but sorting did not work as expected- see attached screenshot. Sorting by \"Summary\" highest to lowest. Starting with bug 166662, they appear separately, not on top as expected.",
    "Latest version 0.9.2 still has the same problem:\n\njavax.security.auth.login.LoginException: Invalid Username or Password\nat org.eclipse.mylar.internal.bugzilla.core.BugzillaClient.parseHtmlError(BugzillaClient.java:985)\nat org.eclipse.mylar.internal.bugzilla.core.BugzillaClient.postTaskData(BugzillaClient.java:760)\nat org.eclipse.mylar.internal.bugzilla.core.BugzillaTaskDataHandler.postTaskData(BugzillaTaskDataHandler.java:157)\nat org.eclipse.mylar.tasks.ui.editors.AbstractRepositoryTaskEditor$31.run(AbstractRepositoryTaskEditor.java:2492)\nat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)\n\nBefore network trace, I\u0027ll try debugging first.",
    "Created an attachment (id\u003d55309)\nScreenshot of sorting\n\n",
    "Dammit I\u0027m stupid- found the problem",
    "I had put my crediential into http authentican (which is a technical thing- and I somehow assumed it was used for the login). I had set anonymous access, too...\nNow- if other people are as stupid as I am, then possibly it might help if the \"validate\" button showed a message like \"successfully validated xyz user\". Possibly this way I would have found out that I was anonymous?\n\nSorry for the hassle!",
    "In general my philosophy is that there are no stupid users, just stupiid UIs ;)  That said we can\u0027t fix the error handling of this for 1.0, so Andreas if you could add a note of caution to the wiki that will help others identify this mistake that would be great:\n\nhttp://wiki.eclipse.org/index.php/Mylar_FAQ#Bugzilla_Connector_troubleshooting",
    "I agree, a wiki entry would be good and we can think about refactoring the validation post 1.0. Thanks for the update Andreas.",
    "Done:\n\nIf tasks fail to submit with credentials error, but the repository validates fine, make sure that you\u0027ve correctly setup your account\u0027s username and password and are not using the HTTP authentication fields instead.\n\nThanks!"
  ],
  "commentCreationDates": [
    "2006-12-04T17:06:02+01:00",
    "2006-12-05T16:54:17+01:00",
    "2006-12-05T17:16:54+01:00",
    "2006-12-06T03:02:49+01:00",
    "2006-12-06T12:14:56+01:00",
    "2006-12-06T18:31:45+01:00",
    "2006-12-06T19:07:36+01:00",
    "2006-12-06T19:10:29+01:00",
    "2006-12-07T10:56:31+01:00",
    "2006-12-07T11:12:16+01:00",
    "2006-12-07T17:55:33+01:00",
    "2006-12-07T18:12:33+01:00",
    "2006-12-07T18:35:52+01:00",
    "2006-12-07T20:00:59+01:00",
    "2006-12-07T20:01:34+01:00",
    "2006-12-07T20:02:55+01:00",
    "2006-12-07T20:15:47+01:00",
    "2006-12-07T23:55:37+01:00",
    "2006-12-07T23:57:08+01:00",
    "2006-12-08T00:11:17+01:00",
    "2006-12-08T14:22:52+01:00",
    "2006-12-08T14:25:06+01:00",
    "2006-12-08T14:31:30+01:00",
    "2006-12-08T14:51:44+01:00",
    "2006-12-08T14:54:12+01:00",
    "2006-12-08T16:42:48+01:00",
    "2006-12-08T17:15:00+01:00",
    "2006-12-08T17:19:53+01:00"
  ],
  "traces": [
    {
      "exceptionType": "javax.security.auth.login.LoginException",
      "message": "Invalid Username or Password",
      "elements": [
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.BugzillaClient.parseHtmlError",
          "source": "BugzillaClient.java:985"
        },
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.BugzillaClient.postTaskData",
          "source": "BugzillaClient.java:760"
        },
        {
          "method": "org.eclipse.mylar.internal.bugzilla.core.BugzillaTaskDataHandler.postTaskData",
          "source": "BugzillaTaskDataHandler.java:157"
        },
        {
          "method": "org.eclipse.mylar.tasks.ui.editors.AbstractRepositoryTaskEditor$31.run",
          "source": "AbstractRepositoryTaskEditor.java:2492"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 21,
      "bugId": "166661",
      "date": "2006-12-08T14:25:06+01:00",
      "product": "Mylyn",
      "component": "Bugzilla",
      "severity": "normal"
    }
  ],
  "groupId": "166661",
  "bugId": "166661",
  "date": "2006-12-04T17:06:02+01:00",
  "product": "Mylyn",
  "component": "Bugzilla",
  "severity": "normal"
}