{
  "comments": [
    "Build 20020521 (1:39pm)\n\nSorry, I don\u0027t have reproducible steps for this one. I was trying to come up \nwith a reproducible case for bug 16657, so I was doing a lot of clicking on \nsearch results in java files, then closing the editors.  Note that I had the \n\"Single Click\" and \"Hover Select\" preferences turned on.  I just happened to see \nthis exception in the log file (attaching complete log file):\n\n!ENTRY org.eclipse.core.runtime 4 0 May 21, 2002 15:19:46.35\n!MESSAGE Duplicate contribution item found during removal\n!STACK 0\njava.lang.Exception\n\tat \norg.eclipse.jface.action.ContributionManager.itemRemoved(ContributionManager.jav\na:278)\n\tat \norg.eclipse.jface.action.ContributionManager.remove(ContributionManager.java:317\n)",
    "Created an attachment (id\u003d925)\nStack trace\n",
    "Thanks John, this is tracing we put in to try to track down the problem with \nduplicate menu items appearing.  Do you now have any duplicate menu items or \ntoolbar items?\n\n",
    "No, I don\u0027t see any duplicate items.\n\nI actually just reproduced this again in a different workspace with similar \nsteps (selecting in seach results to open java editor).  Unfortunately I can\u0027t \nlock down exact steps to reproduce it.\n\nOne thing that may be related... I am using a java perspective, but I have \ncustomized it to remove the \"Java Element Creation\" action set. When you\u0027re in a \nperspective like this, and there are no java editors open, the \"Search\" and \n\"Open Type\" coolbar items are on the far right hand side of the coolbar.  Then \nwhen you open a java editor, these buttons jump over to the left hand side of \nthe coolbar, and the editor actions are added after them.  When you close the \neditor, \"Search\" and \"Open Type\" jump back to the far right.",
    "Here are reproducible steps:\n\n1) Do a search that finds references in multiple java files\n2) Make sure all editors are closed\n3) Double-click on one search result to open an editor\n4) Double-click on another search result.\n\nNow the internal error occurs.  Note that between step 3) and 4), the editor was \nnever made \"active\".  See also bug 16707, which is probably related.",
    "I got the same when exiting Eclipse (but not each time)",
    "Lynn this is an example of the \"duplicate item foud after removing an item \nfrom the CoolBarManager\". Is this still an issue? Note that I will shortly be \nremoving the code to detect this case.",
    "*** Bug 17841 has been marked as a duplicate of this bug. ***",
    "Randy, I haven\u0027t done anything about this.  Can you recreate the given \nscenario?  I can\u0027t.  I did catch up yesterday and got the error when running an \ninner eclipse, but I\u0027m not sure how.  Will attach log.  My guess is that the \nproblem is related to how the editor action bars are getting \nactivated/deactivated.  You can assign to me to investigate further, but I \nreally need a repeatable test case.",
    "Created an attachment (id\u003d1085)\nwalkback log\n",
    "No I can\u0027t recreate with John\u0027s steps below.\nPerhaps it is related somehow to CoolBarContributionItem\u0027s implementation of \nequals?",
    "I can still reproduce quite easily with my steps.  It only seems to happen in \n\"Double Click\" mode.  The error doesn\u0027t seem to happen on the first attempt in a \nnew workspace.  I.e., you may have to do steps 1-4, then close all editors, then \nrepeat.  I\u0027ll try again in today\u0027s build.",
    "Able to reproduce with F1 build.  The trick is to do the search twice and after \nthe first time CloseAll (as suggested).  Will investigate.",
    "This problem does not occur if you close the editors one by one (versus using \nCloseAll).  Tracked down what is causing this behavior.  It\u0027s in WorkbenchPage. \ncloseAllEditors().  In this method, the order of events is as follows:\n\n1. CoolBarContributionItem for *.java EditorActionBar is deactivated (visible \u003d \nfalse)\n2. actionSwitcher.updateTopEditor(null) is called, which triggers \nCoolBarManager.update().  Since the CoolBarContributionItem is not empty \n(visible \u003d false but items have not been disposed), the CoolBarContributionItem \nfor the *.java EditorActionBar is removed from the CoolBarManager.\n3. *.java EditorActionBar is disposed of, however this code path does not \ntrigger CoolBarManager.update().\n\nThe next time CoolBarManager.update() is called, the disposed of \nCoolBarContributionItem will be removed.  In the given scenario, this happens \nto be after a new CoolBarContributionItem for the *.java EditorActionBar has \nbeen added, so there are duplicate items for a brief period.\n\nThis is not a bug.  Things will get cleaned up if the Exception that is being \nthrown in ContributionManager.itemRemoved() is removed and processing is \nallowed to continue.\n\nNote that this behavior is not an issue in the non CoolBar case since non- \nvisible items are disposed of immediately.  In the CoolBarManager, when a \nCoolBarContributionItem is made non-visible, its CoolItem is disposed of but \nnot the associated ToolBarManager.\n\nRG, NE do you have any problems with my explanation?",
    "Step 2 above should read \"is ** NOT ** removed from the CoolBarManager.\"\n",
    "The exception being logged in ContributionManager.itemRemoved does not stop \nexecution.  The exception is just used to dump the stack, and is not actually \nthrown.\n",
    "Ack, my mistake.  I just commented out the code and tested, but even with the \ncode in things get cleaned up properly.  I\u0027d like to close this.",
    "Randy, are there still cases you\u0027d like to track with this?\n",
    "No I\u0027ve removed the detection code in Contribution manager and WorkbenchPage.\nClosing."
  ],
  "commentCreationDates": [
    "2002-05-21T22:02:27+02:00",
    "2002-05-21T22:02:43+02:00",
    "2002-05-21T22:12:27+02:00",
    "2002-05-21T23:26:58+02:00",
    "2002-05-21T23:56:01+02:00",
    "2002-05-23T14:10:54+02:00",
    "2002-05-27T15:32:52+02:00",
    "2002-05-27T15:50:07+02:00",
    "2002-05-28T15:22:54+02:00",
    "2002-05-28T15:24:51+02:00",
    "2002-05-28T15:36:59+02:00",
    "2002-05-28T16:09:37+02:00",
    "2002-05-28T22:06:19+02:00",
    "2002-05-29T00:01:38+02:00",
    "2002-05-29T00:05:05+02:00",
    "2002-05-29T00:17:56+02:00",
    "2002-05-29T01:57:50+02:00",
    "2002-05-29T02:34:25+02:00",
    "2002-05-29T15:07:54+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.Exception",
      "elements": [
        {
          "method": "org.eclipse.jface.action.ContributionManager.itemRemoved",
          "source": "ContributionManager.jav a:278"
        },
        {
          "method": "org.eclipse.jface.action.ContributionManager.remove",
          "source": "ContributionManager.java:317 "
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "16671",
      "date": "2002-05-21T22:02:27+02:00",
      "product": "Platform",
      "component": "UI",
      "severity": "critical"
    }
  ],
  "groupId": "16671",
  "bugId": "16671",
  "date": "2002-05-21T22:02:27+02:00",
  "product": "Platform",
  "component": "UI",
  "severity": "critical"
}