{
  "comments": [
    "I added the \u0027SWT\u0027 libary to my build path. That makes ErrorDialog and Status available. However, when I try to use the Status constructor, I am rewarded with the following:\n\njava.lang.NoClassDefFoundError: org/eclipse/osgi/util/NLS\n\nfrom \n\nat org.eclipse.core.runtime.Status.\u003cclinit\u003e(Status.java:30)\n\nThe SWT library bundle should include this OSGI stuff.",
    "I see jface, moving to UI\n",
    "Probably needs to move again. The SWT library is defined in one of the layered packaged (visual editing, but I can\u0027t figure out which one).",
    "Status is in Core Runtime",
    "Given that this library is only defined in the VE package, why is this core? I\u0027m confused. Or is the idea that this missing class should be in one of the packages that the VE definition is already including?",
    "What exactly are you trying to do?  I\u0027m guessing that you:\n- created a Java project (not a bundle project)\n- added the SWT library to the build path\n- things died\n\nIf this is the case and you want to use code from runtime then you will have to add other libraries to your build path. Specifically, Status is found in the org.eclipse.equinox.common bundle.\n\n",
    "I haven\u0027t explained this nearly well enough.\n\nThe Visual Edit bundle adds a new \u0027library\u0027 to the build path system, via the defined extension point for this purpose. That library, called SWT, includes several packages. It does not include the package that contains org.eclipse.osgi.util.NLS. I think that this is a bug in that VE extension point, which is why I tried to reroute this bug to them at some point yesterday once I had figured this much out.\n",
    "Ok, moving to VE. Although I am still not sure of the problem as SWT code should not have any dependancy on OSGi code. But then again I am unfamiliar with the Visual Editor and how it works.",
    "For the record: the VE-implemented SWT classpath container has an option to include JFace. That brings you ErrorDialog, Status, and the connection to the locale code in OSGI.\n\n",
    "The problem is that OSGI is a NEW requirement for JFACE. If you look at the official Wiki site, the run JFace outside of Eclipse page does not include OSGI.\nSee\nhttp://wiki.eclipse.org/index.php/JFace\n\nSince at the time VE was released JFace didn\u0027t require OSGI, we didn\u0027t include it either when JFace was selected in the SWT container."
  ],
  "commentCreationDates": [
    "2006-12-13T17:03:16+01:00",
    "2006-12-13T19:57:19+01:00",
    "2006-12-13T20:02:38+01:00",
    "2006-12-14T12:59:44+01:00",
    "2006-12-14T13:57:00+01:00",
    "2006-12-14T14:09:51+01:00",
    "2006-12-14T14:13:55+01:00",
    "2006-12-14T16:34:28+01:00",
    "2006-12-14T17:22:57+01:00",
    "2006-12-14T17:28:34+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NoClassDefFoundError",
      "message": "org/eclipse/osgi/util/NLS  from",
      "elements": [
        {
          "method": "org.eclipse.core.runtime.Status.\u003cclinit\u003e",
          "source": "Status.java:30"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "167882",
      "date": "2006-12-13T17:03:16+01:00",
      "product": "VE",
      "component": "CDE",
      "severity": "normal"
    }
  ],
  "groupId": "167882",
  "bugId": "167882",
  "date": "2006-12-13T17:03:16+01:00",
  "product": "VE",
  "component": "CDE",
  "severity": "normal"
}