{
  "comments": [
    "The HP C/C++ Remote Developer Plug-in allows you to edit C/C++ code using the Eclipse Integrated Development Environment (IDE) on a Windows or Linux machine while providing you with the ability to compile, run, and debug that code on an HP Integrity (Itanium IA-64 machine) / HP 9000 (PA-RISC) running the HP-UX operating system. The user interface, including all error messages, interactions, and full-featured graphics, takes advantage of the Eclipse IDE on a Windows or Linux box. The processing power needed for building, running, and debugging your C/C++ program is provided by the HP Integrity server on the backend.",
    "Created an attachment (id\u003d55666)\nReadme file\n\nReadme file which gives a description of how to get the source code",
    "Created an attachment (id\u003d55669)\nSource zip file\n\nThis zip file has the source code for HP C/C++ Remote Developer plug-in. This is not the entire source code. Some other attachments will follow.",
    "Created an attachment (id\u003d55670)\nSource zip file - 2 \n\nThis zip file has the source code for HP C/C++ Remote Developer plug-in.",
    "Created an attachment (id\u003d55671)\nSource zip file - 3\n\nThis zip file has the source code for HP C/C++ Remote Developer plug-in.",
    "Created an attachment (id\u003d55737)\nSource zip file - 4\n\nThis zip file has the source code for HP C/C++ Remote Developer plug-in.",
    "Created an attachment (id\u003d55738)\nChanged CDT Files\n\nThis zip file has the CDT files which needed to be changed for the remote developer plug-in. We are in the process of submitting these changes to CDT. Please check the README file and other documentation being provided here, for further details. ",
    "Created an attachment (id\u003d55739)\nDocumentation for the plug-in\n\nThis zip file has the documentation for the plug-in. Developer as well as user documentation has been provided.",
    "Created an attachment (id\u003d55740)\nReadme file\n\nUpdated README file",
    "I\u0027ve tried to download HP C/C++ Remote Developer plug-in from HP website (http://h21007.www2.hp.com/dspp/tech/tech_TechSoftwareDetailPage_IDX/1,1703,8319,00.html?jumpid\u003dreg_R1002_USEN) and installed it with a fresh Eclipse 3.2.0/CDT 3.0.1 and with a fresh Eclipse 3.2.1/CDT 3.1.1. I am using Sun\u0027s Java 6 JVM and Fedora Core 5.\n\nHowever, I couldn\u0027t get it working. If I choose to create a new \"Remote Standard Make C Project\", when I click the \"Next\" button, nothing happens. I took a look in my \u003cworkspace\u003e/.metadata/.log file and the following Exception was registered there:\n\n!ENTRY org.eclipse.ui 4 0 2006-12-20 13:22:02.091\n!MESSAGE WizardNewProjectCreationPage_projectContentsGroupLabel\n!STACK 0\njava.lang.NoSuchFieldError: WizardNewProjectCreationPage_projectContentsGroupLabel\n\tat com.hp.cdt.remote.ui.wizards.RemoteWizardNewProjectCreationPage.createProjectLocationGroup(RemoteWizardNewProjectCreationPage.java:150)\n\tat com.hp.cdt.remote.ui.wizards.RemoteWizardNewProjectCreationPage.createControl(RemoteWizardNewProjectCreationPage.java:125)\n\tat org.eclipse.jface.wizard.Wizard.createPageControls(Wizard.java:180)\n\tat com.hp.cdt.remote.ui.wizards.NewRemoteMakeProjectWizard.createPageControls(NewRemoteMakeProjectWizard.java:76)\n\tat org.eclipse.jface.wizard.WizardDialog.createPageControls(WizardDialog.java:614)\n\tat org.eclipse.jface.wizard.WizardDialog.setWizard(WizardDialog.java:989)\n\tat org.eclipse.jface.wizard.WizardDialog.updateForPage(WizardDialog.java:1041)\n\tat org.eclipse.jface.wizard.WizardDialog.access$2(WizardDialog.java:1038)\n\tat org.eclipse.jface.wizard.WizardDialog$4.run(WizardDialog.java:1028)\n\tat org.eclipse.swt.custom.BusyIndicator.showWhile(BusyIndicator.java:67)\n\tat org.eclipse.jface.wizard.WizardDialog.showPage(WizardDialog.java:1026)\n\tat org.eclipse.jface.wizard.WizardDialog.nextPressed(WizardDialog.java:757)\n\tat org.eclipse.jface.wizard.WizardDialog.buttonPressed(WizardDialog.java:351)\n\tat org.eclipse.jface.dialogs.Dialog$3.widgetSelected(Dialog.java:660)\n\tat org.eclipse.swt.widgets.TypedListener.handleEvent(TypedListener.java:90)\n\tat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\n\tat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:1085)\n\tat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3164)\n\tat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2840)\n\tat org.eclipse.jface.window.Window.runEventLoop(Window.java:820)\n\tat org.eclipse.jface.window.Window.open(Window.java:796)\n\tat org.eclipse.ui.actions.NewProjectAction.run(NewProjectAction.java:116)\n\tat org.eclipse.jface.action.Action.runWithEvent(Action.java:499)\n\tat org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection(ActionContributionItem.java:539)\n\tat org.eclipse.jface.action.ActionContributionItem.access$2(ActionContributionItem.java:488)\n\tat org.eclipse.jface.action.ActionContributionItem$5.handleEvent(ActionContributionItem.java:400)\n\tat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\n\tat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:1085)\n\tat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3164)\n\tat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2840)\n\tat org.eclipse.ui.internal.Workbench.runEventLoop(Workbench.java:1914)\n\tat org.eclipse.ui.internal.Workbench.runUI(Workbench.java:1878)\n\tat org.eclipse.ui.internal.Workbench.createAndRunWorkbench(Workbench.java:419)\n\tat org.eclipse.ui.PlatformUI.createAndRunWorkbench(PlatformUI.java:149)\n\tat org.eclipse.ui.internal.ide.IDEApplication.run(IDEApplication.java:95)\n\tat org.eclipse.core.internal.runtime.PlatformActivator$1.run(PlatformActivator.java:78)\n\tat org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.runApplication(EclipseAppLauncher.java:92)\n\tat org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.start(EclipseAppLauncher.java:68)\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:400)\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:177)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)\n\tat sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)\n\tat java.lang.reflect.Method.invoke(Method.java:597)\n\tat org.eclipse.core.launcher.Main.invokeFramework(Main.java:336)\n\tat org.eclipse.core.launcher.Main.basicRun(Main.java:280)\n\tat org.eclipse.core.launcher.Main.run(Main.java:977)\n\tat org.eclipse.core.launcher.Main.main(Main.java:952)\n\nI tried to find some information about what should I be doing wrong in the documentation at HP\u0027s site but I couldn\u0027t find anything helpful for this especific error. Do you have any idea of what I am doing wrong? Is it necessary to have any pre-configuration in the environment to run HP Remote Development plug-ins?\n\nAnother question that I have is: These source files that were posted here are the same files available from HP website or there is any difference between these and those plug-ins?\n\nI appreciate any help.",
    "Why not submit a patch for the \"Changed CDT Files\" instead of a ZIP archive?",
    "Response to Comment #9:\n\n\nHello Leonardo Garcia\n\nThanks for your interest in HP C/C++ Remote Developer plugin. We\u0027ll try to sort out the issues that you are facing.\n\nFrom your message, it seems that you installed Eclipse and CDT and then our plug-in. This might be causing the problem, because we have modified some CDT files. We package modified CDT plugins with our release bits. So for installation of our plug-in (v 1.1.0), you need to install Eclipse 3.2 and then extract the zip or tar file for our plug-in, for Windows and Linux respectively. For more details please check the \"Installing and Launching the HP C/C++ Remote Developer Plug-in\" section in HP_RemoteDev_Install_Guide. It is there in Documents.zip file attached with Bug 168048.\n\nThe latest version which we released for our plug-in was 1.1.0. Which version did you download ? Although there are some cosmetic changes between 1.1.0 release and the source code that we have submitted, the functionality remains same. We are looking at how we can submit the latest release bits to Eclipse community. It is not possible to attach it to the bugzilla entry.\n\nPlease let us know if you face any other issues with the plug-in. \n\n\nRegards\nVirender.\n",
    "Patches for the following changed CDT files are being attached:\n\n1. CDebuggerTab.java\n2. CPathIncludeSymbolEntryPage.java\n3. CWordFinder.java\n4. NewIncludesSymbolsTabBlock.java",
    "Created an attachment (id\u003d56020)\nPatch for CDebuggerTab\n\nThis is patch for CDebuggerTab.java file",
    "Created an attachment (id\u003d56021)\nPatch for CPathIncludeSymbolEntryPage.java\n\n",
    "Created an attachment (id\u003d56022)\nPatch for CWordFinder.java\n\n",
    "Created an attachment (id\u003d56023)\nPatch for NewIncludesSymbolsTabBlock.java\n\n",
    "Hi Verender,\n\nThanks for the help! I just figured out that I was trying version 1.0.0. I could download version 1.1.0 and I am not getting these exceptions anymore.\n\nI have another doubt now: I am trying to create a new \"Remote Standard Make C Project\". As far as I could understand, in the first dialog of the wizard, I have to give a name for the project and a path to the remote directory mounted in my Linux host system with the files I want to import from the remote machine. In the second dialog of the wizard, I can configure error and ELF parsers, etc. for my C project and, finally, in the last dialog, I can fill the settings to connect to my remote system.\n\nIn the last dialog page I am typing:\n\nHostname: \u003cIP address of the remote computer\u003e\nUsername: \u003cmy username on the remote computer\u003e\nSource directory: \u003cthe source directory in the remote computer\u003e\nDisplay IP address: \u003cIP address of the remote computer\u003e:0.0\n\nUnfortunately, when I click \"Test Connection...\" I got a \"No route to host\" error message. However, I am pretty sure I can connect to the remote system using, for example, SSH. If I then click again in \"Test connection\", Eclipse freezes.\n\nNow my questions:\n\n1) I know that it is said in the help documentation that this plug-in is for HP-UX remote systems, but will this plug-in work only if I have a HP-UX system in the remote machine? Or does it use common *NIX protocols (NFS, SSH, etc.) and then I will be able to use it to connect to remote computers running Linux?\n\n2) The Display IP address is the Display IP address of the remote computer? Why should we configure this if we are using only the local host computer to use graphical applications? Is this for running GUI applications in the remote machine?\n\nBest regards,\n\nLeonardo Garcia",
    "To Virender:\nAre you considering using services from teh Target Management Project in the future? - We have existing ssh/sftp and ftp connections, plus Jakarta Commons Net for rlogin, rsh, telnet and the like, and an integrated Terminal view. We even have a CDT Remote Run/Debug Launch through gdbserver. Looks like the perfect base technology for adding CDT Remote Make and whatever else you are doing on top of it. See\nhttp://www.eclipse.org/dsdp/tm/tutorial/index.php",
    "(In reply to comment #17)\n\u003e Unfortunately, when I click \"Test Connection...\" I got a \"No route to host\"\n\u003e error message. However, I am pretty sure I can connect to the remote system\n\u003e using, for example, SSH. If I then click again in \"Test connection\", Eclipse\n\u003e freezes.\n\nJust a correction. Eclipse doesn\u0027t freeze. It just take a long time to give another \"No route to host\" error message.",
    "Reply to Comment #17\n\nHello Leonardo\n\nFollowing are my replies to your queries:\n\n1) Currently, the remote system should be HP-UX Itanium IA-64/PA-RISC server as mentioned in the \"Requirements\" section of the HP_RemoteDev_Install_Guide. It is possible to extend our plug-in for other remote system types in the future.\n\n2) During remote debug, we are displaying a console window in which the output for the session is shown. This window is displayed on the machine whose IP address is specified by the user. It is not the IP address for the remote machine. It will mostly be the local system. But it can be some other system also.\n\nOne more thing. In the first dialog box, the Directory you should specify will be on the local machine. For instance, if you are on Windows local system and have mounted the remote file system using Samba, then the path of the directory in Samba mapped drive should be specified. If the local system is Linux, then remote file system can be mounted using NFS. Again the local directory path should be specified.\n\nPlease let us know if you have any other questions.\n\nRegards\nVirender.\n\n",
    "Reply to Comment #18\n\nHello Martin\n\nThanks for your input. We would certainly like to take a look at the existing tools and wherever possible try to integrate them with our plugin. For instance, we are using rsh or ssh to login to remote system. It might be possible that we also support other options for login to remote system in future. Input like yours is very useful, so that we come to know what is important for the community.\n\nRegards\nVirender",
    "We\u0027ve taken a look at the HP C/C++ Remote Developer submission and we have several comments related to its relationship to the PTP project and our particular community.\n\n1. There should be an option (preferably the default) to use EFS (in addition to Samba or a locally mounted file system).\n2. It would be helpful to move the remote configuration options (hostname, username, ...) to the first page of the project creation wizard.\n3. It is unclear from the documentation how environment variables are passed to the remote system.  What command file is executed (.profile, .bashrc, ...)?  On our systems, environment variables are very important for controlling compilation, etc.  It would helpful if there were an option to provide a filename that would be executed on remote login.\n4. The X11 display env should be an environment variable rather than a required (?) field.  ssh -Y should handle X11 fine.\n5. There is no reason to be arch specific (perhaps with the exception of windows)\n6. Anything other than ssh is pretty useless in our environment.  \"Passwordless ssh/public key encription\" is not allowed on many of our systems.  Most of our systems require a one-time password to login, although sometimes Kerberos authetication is OK.\n7. The \"Remote Standard Make Projects\" are a nice start, but they should eventually be integrated into standard CDT C/C++ projects (with a remote option), rather than a completely new project type..",
    "Response to Comment #22\n\nHello Craig\n\nThanks for your comments. I\u0027ve responded to your comments below. \n\n1. We have not yet looked into EFS support with our plug-in (but we\u0027ll definitely look into that). However, our plug-in works with Samba, or a mounted Clearcase VOB as well as some other options by which remote file systems can be mounted to local system. So my understanding is that our solution should work as long as you have the remote file system mounted. Ofcourse, currently we test with Samba (on Windows) and NFS mounted file system (on Linux) only.\n\n2. We\u0027ll look into that.\n\n3. We are creating our own environment file. It has export statements for all the environment variables (like export arg1\u003d3). We execute this file for setting the environment variables.\n\n4. We\u0027ll look into that.\n\n5. When you say arch specific, do you mean windows and linux (for local system) or HP-UX (for remote system) or both. Please clarify a bit more.\n\n6. We are providing support for ssh and rsh. Would that not work in your environment. For ssh, we need to do the setup once, by giving the password. Afterwards there is no need to specify password. So this requires one-time password to login, as you mentioned.\n\n7. What would be the advantage of \"integrating\" remote projects into standard CDT projects. Please give more details so that we can do a thorough analysis.\n\nI would also appreciate if you could give some more details about PTP project and the environment that you are working in. How can our plug-in be useful for your project ? In addition to the points that you have mentioned, what would be the features that you would like to see in our solution in the future ?\n\n\nRegards\nVirender.\n\n",
    "Virender, I\u0027m responding to you comments in #23.\n\n1. EFS is attractive because it will work in situations where it is not possible to mount the remote file system.\n\n5. My guess is that macosx should work as well as linux, for example.\n\n6. I\u0027ll have to take another look at how ssh connections are setup.  It shoulds like it would probably work.\n\n7. Regarding integrating remote projects into standard CDT projects.  I think it would be helpful to merge your remote project contribution into CDT standard make and managed make projects.  So when you use the wizard to create a new CDT project, you have the option of making it\u0027s location remote.  This would require making the CDT more remote aware, but I think this is the goal anyway.\n\nThe primary item our PTP project requires at the moment is the ability to startup remote executables via an ssh connection.  It would be helpful if your remote capabilities provided an API for setting up remote ssh connections and running executables.  In particular, we need to start up a remote daemon through which we communicate via sockets to determine the state of the remote machine (nodes, queues, jobs ...) and to submit and debug jobs.",
    "I have a question regarding debug:\n\nThe DSDP-TM \"CDT Remote Debug\" currently uses gdbserver on the remote machine, and a local (cross) gdb. It seems to work OK though setting up the (cross) gdb is not trivial.\n\nAn alternative solution would be to launch gdb on the remote side, and do the gdb/mi communication through an (ssh) channel. We had an earlier product (SNiFF+) which did exactly this, and it worked fine. Has anybody tried this on the CDT, or knows how this could be done?\n\nWhat approach does the HP Remote Development solution take?\nWhat are the further plans for it?\nFYI, another discussion regarding remote debugging is on bug 30094.\n",
    "Response to Comment #25\n\n\nOur plugin launches gdb session on the remote machine and uses gdb/mi communication for sending requests from the local system and responses from the remote system. It works with ssh as well as rsh protocols, which we are currently using for making the remote connection.\n\nI cannot discuss about the future plans for the plugin at this point. We are in the process of finalizing these plans and would have a clear picture in a few days. ",
    "For background info on C/C++ Remote Development see also\nhttp://dev.eclipse.org/mhonarc/lists/dsdp-tm-dev/msg01369.html"
  ],
  "commentCreationDates": [
    "2006-12-14T13:33:34+01:00",
    "2006-12-14T13:35:47+01:00",
    "2006-12-14T14:16:11+01:00",
    "2006-12-14T14:17:12+01:00",
    "2006-12-14T14:18:08+01:00",
    "2006-12-15T05:27:16+01:00",
    "2006-12-15T05:30:55+01:00",
    "2006-12-15T05:39:29+01:00",
    "2006-12-15T05:42:52+01:00",
    "2006-12-20T15:35:39+01:00",
    "2006-12-20T20:11:28+01:00",
    "2006-12-21T04:37:27+01:00",
    "2006-12-21T04:41:16+01:00",
    "2006-12-21T04:43:35+01:00",
    "2006-12-21T04:44:50+01:00",
    "2006-12-21T04:45:35+01:00",
    "2006-12-21T04:46:12+01:00",
    "2006-12-21T15:58:05+01:00",
    "2006-12-21T16:04:46+01:00",
    "2006-12-21T16:12:47+01:00",
    "2006-12-22T04:59:13+01:00",
    "2006-12-22T05:12:28+01:00",
    "2007-01-02T21:21:42+01:00",
    "2007-01-03T04:50:04+01:00",
    "2007-01-09T14:46:36+01:00",
    "2007-02-14T16:57:12+01:00",
    "2007-02-15T04:05:36+01:00",
    "2007-07-13T13:30:23+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NoSuchFieldError",
      "message": "WizardNewProjectCreationPage_projectContentsGroupLabel",
      "elements": [
        {
          "method": "com.hp.cdt.remote.ui.wizards.RemoteWizardNewProjectCreationPage.createProjectLocationGroup",
          "source": "RemoteWizardNewProjectCreationPage.java:150"
        },
        {
          "method": "com.hp.cdt.remote.ui.wizards.RemoteWizardNewProjectCreationPage.createControl",
          "source": "RemoteWizardNewProjectCreationPage.java:125"
        },
        {
          "method": "org.eclipse.jface.wizard.Wizard.createPageControls",
          "source": "Wizard.java:180"
        },
        {
          "method": "com.hp.cdt.remote.ui.wizards.NewRemoteMakeProjectWizard.createPageControls",
          "source": "NewRemoteMakeProjectWizard.java:76"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.createPageControls",
          "source": "WizardDialog.java:614"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.setWizard",
          "source": "WizardDialog.java:989"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.updateForPage",
          "source": "WizardDialog.java:1041"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.access$2",
          "source": "WizardDialog.java:1038"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog$4.run",
          "source": "WizardDialog.java:1028"
        },
        {
          "method": "org.eclipse.swt.custom.BusyIndicator.showWhile",
          "source": "BusyIndicator.java:67"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.showPage",
          "source": "WizardDialog.java:1026"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.nextPressed",
          "source": "WizardDialog.java:757"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.buttonPressed",
          "source": "WizardDialog.java:351"
        },
        {
          "method": "org.eclipse.jface.dialogs.Dialog$3.widgetSelected",
          "source": "Dialog.java:660"
        },
        {
          "method": "org.eclipse.swt.widgets.TypedListener.handleEvent",
          "source": "TypedListener.java:90"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:1085"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3164"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2840"
        },
        {
          "method": "org.eclipse.jface.window.Window.runEventLoop",
          "source": "Window.java:820"
        },
        {
          "method": "org.eclipse.jface.window.Window.open",
          "source": "Window.java:796"
        },
        {
          "method": "org.eclipse.ui.actions.NewProjectAction.run",
          "source": "NewProjectAction.java:116"
        },
        {
          "method": "org.eclipse.jface.action.Action.runWithEvent",
          "source": "Action.java:499"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection",
          "source": "ActionContributionItem.java:539"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.access$2",
          "source": "ActionContributionItem.java:488"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem$5.handleEvent",
          "source": "ActionContributionItem.java:400"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:1085"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3164"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2840"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runEventLoop",
          "source": "Workbench.java:1914"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runUI",
          "source": "Workbench.java:1878"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.createAndRunWorkbench",
          "source": "Workbench.java:419"
        },
        {
          "method": "org.eclipse.ui.PlatformUI.createAndRunWorkbench",
          "source": "PlatformUI.java:149"
        },
        {
          "method": "org.eclipse.ui.internal.ide.IDEApplication.run",
          "source": "IDEApplication.java:95"
        },
        {
          "method": "org.eclipse.core.internal.runtime.PlatformActivator$1.run",
          "source": "PlatformActivator.java:78"
        },
        {
          "method": "org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.runApplication",
          "source": "EclipseAppLauncher.java:92"
        },
        {
          "method": "org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.start",
          "source": "EclipseAppLauncher.java:68"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:400"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:177"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "NativeMethodAccessorImpl.java:39"
        },
        {
          "method": "sun.reflect.DelegatingMethodAccessorImpl.invoke",
          "source": "DelegatingMethodAccessorImpl.java:25"
        },
        {
          "method": "java.lang.reflect.Method.invoke",
          "source": "Method.java:597"
        },
        {
          "method": "org.eclipse.core.launcher.Main.invokeFramework",
          "source": "Main.java:336"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:280"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:977"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:952"
        }
      ],
      "number": 0,
      "commentIndex": 9,
      "bugId": "168048",
      "date": "2006-12-20T15:35:39+01:00",
      "product": "CDT",
      "component": "cdt-debug",
      "severity": "normal"
    }
  ],
  "groupId": "168048",
  "bugId": "168048",
  "date": "2006-12-14T13:33:34+01:00",
  "product": "CDT",
  "component": "cdt-debug",
  "severity": "normal"
}