{
  "comments": [
    "I have done the automatic updating for Eclipse. BIRT reporter will not run - it will not even create a new report. This occurs on both Windows XP and Linux. Everything should be the current version.\nXP reports a class not found error (I know - what class? Sadly the error occured at work and I don\u0027t have Eclipse here, sorry), Linux locks up.\nIt did not appear as if BIRT itself had updated, so it\u0027s some sort of dependency, I imagine. But the non loading class was a BIRT class - EditorProxy? something proxy, anyway.\n(Yes I know that\u0027s a rotten error report)",
    "Well when you try to update the BIRT, did you click the \"Select required\" button?  Please see attached pic.\nThe issue is if any required plug-ins was not ready, the designer plug-in is disabled too. This can cause the ClassNotFound exception.\nCould you try to confirm this?",
    "Created an attachment (id\u003d56081)\nScreen shot of updating dialog\n\n",
    "*** Bug 168528 has been marked as a duplicate of this bug. ***",
    "Ah yes, a duplicate - so it is! Sorry. I will do more testing when I get back start Jan 2007. I will check the update process then. thanks for your comments Wang.\n\nThe other report (earlier - how did I not find it?) had \"class not found\" thus:\n\njava.lang.ClassNotFoundException:\norg.eclipse.birt.report.designer.ui.editors.ReportEditorProxy\n        at\norg.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:402)\n        at\norg.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:347)",
    "Batttling through the Eclipse update stuff - I eventually hit the roadblock of\n\nEclipse BIRT Report Designer Feature (2.2.0.v20061117-1020) requires feature \"org.eclipse.datatools.enablement.oda.designer.feature (1.0.0)\", or later version.\n\n\"Select Required\" didn\u0027t do much (I have been through the cycle a few times by now) I clicked on Data Tools Platform and then off again - then it wanted\n\nEclipse BIRT Web Tools Project (2.2.0.v20061117-1020) requires feature \"org.eclipse.jst.common_core.feature (1.0.0)\", or later version.\n\nThis I could not find. There\u0027s definitely a version mismatch somewhere.\n\nAnd the editor error is still there, sadly.\nSimon",
    "I have reached some progress with this bug - after uninstalling all old version of all (not-only BIRT-related) plugins throw Help/Software Updates/Manage Configuration/Show Disabled) it became to possible to start Report Designer,\nbut if I try to view the report, exception occurs - dialog pop-ups with message\nsimilar to \"java.lang.CastCastException - java.lang.ClassNotFoundException is incompatible with java.lang.Exceptin\".",
    "For the class exception issue, could you provide the log file? Please check if you have designer.ide and designer.rcp plug-ins installed together.",
    "Hello,\n\nconcerning the .log-file - nothing can be easier, absolutely nothing comes to log for this exception.\n\nConcerning plug-ins - yes, all is installed. Initially BIRT was successfully running, then, after some updates of Eclipse with update manager, it ceased to run (even designer). Then, after uninstalling(by means of \"Manage configuration\" dialog) old (disabled) versions of all plug-ins designer is available again, but attempt to view a report results in exception, shown in nice window inside report viewer.\n\nBTW, it seems that there is a nice mess with BIRT update site and, in general, in relationship between BIRT and Eclipse update manager. I have done recently a fresh installation of Eclipse (3.2.1, from eclipse-SDK-3.2.1-win32.zip) and then install all plug-ins that I need with update manager. There were some pecularities:\n\n1. BIRT 2.2 (not 2.1) was proposed to install, while on BIRT pages, including download one 2.1 is still named as production version and available for download.\n\n2. Lowagie iText 1.3 was installed, while BIRT installation guide states that for 2.2 iText 1.4.6 is required (while installed version works nicely).\n\n3. When selected in install plugin dialog, BIRT complains that it needs this or that plugin, but \"Select required\" button does nothing.\n\n4. Complaints about required plugins (in above-mentioned dialog) are sometimes \nmisleading as they sometimes mention plug-ins that are already selected for installation, and then disappears when some unmentioned plug-in is selected.\n\nRegards, \nOleksandr\nRegards,\nOleksandr",
    "I have done the updating yet again. It downloaded some new version of Lowagie iText  and possible a few other things.\nAnd now, magically, it seems to work.\n\nAfter the conversion, I seem to have ended up with TWO files for each report - xxx.rptconfig and xxx.rptdesign\nNot all conversions succeeeded, but I\u0027m sure I can figure that out.\n\nI am reluctant to change this to FIXED until someone else has the same experience, though. Oleksandr (that\u0027s a great name - Ukraine, maybe?), can you try please?\n\nSimon (in Sydney, where it is summer)",
    "Thanks Simon. \nCould you try to summary the steps of you in detail? By this, we can try to find the reason of this issue. I heard same issues for several times from community. I\u0027ll keep this bug opening to see if we can find more.\nFor the xxx.rptconfig, I should be used at preview stage. Delete it at design time should be safe. If you found any problem at design time, please let me know.\n\nWill it be hot in Sydney at Feb.? I\u0027ll have a vaction there? :)\n",
    "\u003e Not all conversions succeeeded, but I\u0027m sure I can figure that out.\n\u003e I am reluctant to change this to FIXED until someone else has the same\n\u003e experience, though. Oleksandr (that\u0027s a great name - Ukraine, maybe?), can you\n\u003e try please?\n\u003e Simon (in Sydney, where it is summer)\n\nAs I have written I have reinstalled Eclipse completely, so at the moment I can not prove if additional updates fix this bug. Have to say that I have another installation of Eclipse that suffers from this bug, but I can not reach it before Monday or ever Tuesday. \n\nConcerning name - you are write, it comes from Ukraine. Really, I\u0027m just normal Alexander, but Ukraine has a law how names shall be spelled in the passport in Latin alphabet. Results you see :( ",
    "(In reply to comment #11)\n\u003e \u003e Not all conversions succeeeded, but I\u0027m sure I can figure that out.\n\u003e \u003e I am reluctant to change this to FIXED until someone else has the same\n\u003e \u003e experience, though. Oleksandr (that\u0027s a great name - Ukraine, maybe?), can you\n\u003e \u003e try please?\n\u003e \u003e Simon (in Sydney, where it is summer)\n\u003e As I have written I have reinstalled Eclipse completely, so at the moment I can\n\u003e not prove if additional updates fix this bug. Have to say that I have another\n\u003e installation of Eclipse that suffers from this bug, but I can not reach it\n\u003e before Monday or ever Tuesday. \n\n\nWere you able to get to the other installation to verify if the solution fix the issue?\n\n",
    "please reopen the bug if it doesn\u0027t work.",
    "Sorry, I completely forgot that this \"another\" installation was really \"another\" - it has not BIRT installed so was unsuitable to testing for this bug."
  ],
  "commentCreationDates": [
    "2006-12-21T21:57:49+01:00",
    "2006-12-22T02:14:04+01:00",
    "2006-12-22T02:15:58+01:00",
    "2006-12-22T02:17:21+01:00",
    "2006-12-23T00:56:03+01:00",
    "2007-01-02T07:10:23+01:00",
    "2007-01-05T15:54:47+01:00",
    "2007-01-08T02:32:40+01:00",
    "2007-01-08T08:10:43+01:00",
    "2007-01-12T02:13:48+01:00",
    "2007-01-12T03:10:01+01:00",
    "2007-01-12T09:25:46+01:00",
    "2007-02-08T03:44:11+01:00",
    "2007-02-08T03:45:10+01:00",
    "2007-02-08T07:58:28+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "org.eclipse.birt.report.designer.ui.editors.ReportEditorProxy",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:402"
        },
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:347"
        }
      ],
      "number": 0,
      "commentIndex": 4,
      "bugId": "168905",
      "date": "2006-12-23T00:56:03+01:00",
      "product": "BIRT",
      "component": "Report Designer",
      "severity": "critical"
    }
  ],
  "groupId": "168905",
  "bugId": "168905",
  "date": "2006-12-21T21:57:49+01:00",
  "product": "BIRT",
  "component": "Report Designer",
  "severity": "critical"
}