{
  "comments": [
    "Build ID: M20060921-0945\n\nSteps To Reproduce:\n1. Run the attached project as Eclipse application.\n2. Hit the menu entry JobManagerLoad.\n3. In the console, a stack overflow error is reported.\n\n\nMore information:\nFrom the location where the error is thrown, I would conclude that the exclusion of jobs, which must not be performed in parallel (aka which are excluded via an appropriate rule) are somehow recursively scheduled for execution. If the number of jobs is more than the number of allowed stack traces, the error occurs.\n\nNote that this has been discovered by a bug in the debug view decoration in Eclipse 3.2.0. The decoration had been defined as mutual exclusive job for each element in the debug view which led to the problem described. The respective coding has been changed with 3.2.1, but the underlying problem in the Jobs API still exists. From the coding I conclude a simple tail recursion which should be solvable with a while loop.",
    "Created an attachment (id\u003d56618)\nA Plugin project to reproduce the problem\n\n",
    "I can reproduce this, but I\u0027m having a hard time finding the cause because I can\u0027t see the problematic stack (Bug 170558).  Do you know some trick to get it to show the stack trace for the thread with the stack overflow?",
    "(In reply to comment #2)\n\u003e I can reproduce this, but I\u0027m having a hard time finding the cause because I\n\u003e can\u0027t see the problematic stack (Bug 170558).  Do you know some trick to get it\n\u003e to show the stack trace for the thread with the stack overflow?\n\nI am getting a stacktrace in the console view when starting a runtime workbench and hitting the menu entry. If that doesn\u0027t work for you try starting with -debug -consolelog. The design time as well as the runtime was started with -Xmx512m as jvm parameter.\n\nAnother way is to start the workbench in debug mode and to set an Exception breakpoint on StackOverFlowError, which shows the entire stack when stopping.\n\nI should have posted the stacktrace nevertheless. Sorry for that. It is:\n\njava.lang.StackOverflowError\n\tat org.eclipse.core.internal.jobs.InternalJob.addLast(InternalJob.java:116)\n....\n\nor the bottom frames from the debugger:\nSampleAction$1(InternalJob).addLast(InternalJob) line: 116\t\nJobManager.nextJob() line: 827\t\nJobManager.startJob() line: 1102\t\nWorkerPool.startJob(Worker) line: 206\t\nWorker.run() line: 51\t\n\n\nKindest Regards\nRichard\n",
    "Created an attachment (id\u003d57553)\nFix\n\nSwitched tail recursion to iterative solution",
    "Thanks, fix released."
  ],
  "commentCreationDates": [
    "2007-01-09T09:59:58+01:00",
    "2007-01-09T10:01:46+01:00",
    "2007-01-18T16:54:57+01:00",
    "2007-01-19T06:54:40+01:00",
    "2007-01-25T23:08:43+01:00",
    "2007-01-25T23:09:25+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.StackOverflowError",
      "elements": [
        {
          "method": "org.eclipse.core.internal.jobs.InternalJob.addLast",
          "source": "InternalJob.java:116"
        }
      ],
      "number": 0,
      "commentIndex": 3,
      "bugId": "169943",
      "date": "2007-01-19T06:54:40+01:00",
      "product": "Platform",
      "component": "Runtime",
      "severity": "major"
    }
  ],
  "groupId": "169943",
  "bugId": "169943",
  "date": "2007-01-09T09:59:58+01:00",
  "product": "Platform",
  "component": "Runtime",
  "severity": "major"
}