{
  "comments": [
    "Unable to execute a URL test on Solaris agent. Liz Dancy was going to see if she could duplice the problem on another Solaris box, but was unable to do that today.  I am running an agent that is using an IBM 1.4.2 JVM.\n\nJoe Toomey indicates that JUnit tests run ok using the same Solaris agent.  I am getting the same failure whether I run a Linux Host or a Windows Host to the Solaris agent.  \n\nHere is the output from the server process;  \n\nRAServer started successfully\n[u:/export./home/dmorris/tptprac/bin]$java.lang.reflect.InvocationTargetExceptio\nn\n        at sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n        at sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.\njava:39)\n        at sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAcces\nsorImpl.java:25)\n        at java.lang.reflect.Method.invoke(Method.java:324)\n        at org.eclipse.hyades.internal.collection.framework.FileClientHandlerExt\nendedImpl.executeCommand(FileClientHandlerExtendedImpl.java:157)\n        at org.eclipse.hyades.internal.collection.framework.FileClientHandlerExt\nendedImpl.run(FileClientHandlerExtendedImpl.java:289)\n        at java.lang.Thread.run(Thread.java:534)\nCaused by: java.io.IOException\n        at org.eclipse.hyades.internal.execution.core.file.communicator.ChannelC\nommunicator.receive(ChannelCommunicator.java:94)\n        at org.eclipse.hyades.internal.execution.core.file.dynamic.PutFileComman\nd$Server.execute(PutFileCommand.java:184)\n        at org.eclipse.hyades.internal.execution.core.file.dynamic.AbstractFileS\nerverCommand.execute(AbstractFileServerCommand.java:318)\n        ... 7 more",
    "I tried the IBM 1.5 JVM on Solaris.\n\nI am still getting the same error as with 1.4.2 from Windows XP Host running a URL test.  Joe Toomey is somehow able to run a URL test on the same Solaris agent with the same build using the same simple recording to the google main page.  I don\u0027t know what to make of the difference.\n\nEarlier, I was also getting the same error from a Vista Host in addition to XP and Linux.",
    "Hi DuWayne, is security enabled in your setup? If so, this may be related to bug  168948.\n",
    "No, security is off.  Joe was running a test against the same Solaris agent without any changes to the running configuration since I am the one that installed and started the agent.  So, as I said, that part  is a mystery.  Are you able to run a simple URL test on a different Solaris agent OK?  Is there a way I could try running there?  To repeat the situation, I\u0027m getting the same results from 3 different host machines running 3 different operating systems using the 0115 driver for the test pass.",
    "Will take a look during 4.4 i1 since 4.2.2 is closing down.\n",
    "I accessed the Solaris agent constellation.torolab.ibm.com.\n\nInteresting results.  I can execute URL tests just fine on constellation.  The same test still fails to execute on my local Solaris agent.  I will try again with the next  4.2.2 Test Pass build and see what happens.\n\nThe fact that Joe can execute against the same Solaris machine where I always get a failure while my same host machine and configuration runs fine against another Solaris agent  is a puzzle.\n",
    "Installed 4.2.2 Test Pass 2 workbench and agent, tptpdc.solaris_sparc-TPTP-4.2.2-200701291553.zip driver on the Solaris box where this problem was originally reported.  The error is the same as I was getting before.",
    "Set priority to P1 for 4.4 plan closure.",
    "Hi Wai,\n\nThanks for the help on this.\n\nEvidently this is \"works as designed\", although a better error message is certainly needed.  \n\nThe issue is that the AC was not started by \"root\" and this can result in file permissions problems.\n\nNeither Mark Dunn nor myself have the root password for the Solaris machine we are using for our testing.  Thus, if Mark starts the AC and then I run a test using that agent, a /var/tmp/morris folder gets created that is owned by Mark.  Subsequently, if Mark stops that AC and someone else, me for example, installs and starts another AC, the tmp folder morris still belongs to Mark and there are no permissions for file transfer.  This was the problem.  After Mark deleted the /var/tmp/morrris folder, I was able to run using the agent I had started.\n\nThere are two solutions, 1) start the AC as root, which I understand is documented as the way to do things, or 2) whoever stops the AC to allow another one to run or another user to start it needs to delete any user folders created under /var/tmp before another user starts the AC.\n\n\n",
    "Agreed to defer to next release.\n",
    "Hi Bing. I have transferred my bugs to you for triage. Thanks."
  ],
  "commentCreationDates": [
    "2007-01-23T02:09:43+01:00",
    "2007-01-23T22:17:10+01:00",
    "2007-01-25T15:45:59+01:00",
    "2007-01-25T16:21:20+01:00",
    "2007-01-26T19:14:23+01:00",
    "2007-01-29T19:59:27+01:00",
    "2007-01-30T21:23:29+01:00",
    "2007-01-31T21:09:44+01:00",
    "2007-02-13T15:53:00+01:00",
    "2007-02-13T17:34:08+01:00",
    "2007-11-27T14:33:20+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.io.IOException",
      "elements": [
        {
          "method": "org.eclipse.hyades.internal.execution.core.file.communicator.ChannelCommunicator.receive",
          "source": "ChannelCommunicator.java:94"
        },
        {
          "method": "org.eclipse.hyades.internal.execution.core.file.dynamic.PutFileCommand$Server.execute",
          "source": "PutFileCommand.java:184"
        },
        {
          "method": "org.eclipse.hyades.internal.execution.core.file.dynamic.AbstractFileServerCommand.execute",
          "source": "AbstractFileServerCommand.java:318"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "171339",
      "date": "2007-01-23T02:09:43+01:00",
      "product": "TPTP Agent Controller",
      "component": "Platform.Agents",
      "severity": "major"
    }
  ],
  "groupId": "171339",
  "bugId": "171339",
  "date": "2007-01-23T02:09:43+01:00",
  "product": "TPTP Agent Controller",
  "component": "Platform.Agents",
  "severity": "major"
}