{
  "comments": [
    "Installed Versions\nopenSUSE 10.2 (kernel 2.6.18.2-34-default) with KDE 3.5.5 \"release 45.2\"\nSun Java 1.6.0-b105\nEclipse 3.3 M4 from http://download.eclipse.org/eclipse/downloads/drops/S-3.3M4-200612141445/index.php\n\nI skipped the executable and directly called:\njava -jar eclipse/startup.jar\ncreate an empty workspace\ncreate new project test\ncreate new class Test.java\n\nI see a new empty Java Tab coming up. The mouse cursor goes into wait forever and the only option is to close Eclipse.\n\nNext I started up eclipse and tried to open an arbitrary text file to no avail.\n\nI\u0027ve saved the .log with the exact exception ... Hope I can post it somehow ...",
    "Created an attachment (id\u003d58604)\nthe .log from .metadata directory in my workspace\n\n",
    "Do you get the same results if you start Eclipse with the launcher? Is this always reproducible?",
    "Really wonderful ... I just took a step back an downloaded 3.3 M3 from http://download.eclipse.org/eclipse/downloads/drops/S-3.3M3-200611021715/index.php\n\nGuess what ... another NullPointerException! But this time I could not create the test project, so this refers to JDT I guess. I\u0027ll attach it anyway.\n\n\n\nUps another comment: Hello Bogdan!\n\nYes, the error in M4 is reproducible (the other in M3 also)\nIn M4 I was not able to make any sense of the launcher. Either it told me something about insufficient memory or I was playing around with -Xms128m -Xmx350m. But I cannot even launch a HelloWorld with those -X options because Java complains:\n\nError occurred during initialization of VM\nCould not reserve enough space for object heap\nCould not create the Java virtual machine.\n\nWith M3 the laucher won\u0027t work either:\nFirst I see the splash-screen\nnext a window giving Errorlevel 13 and the complete commandline\nand the console reads:\n\nmmap failed for CEN and END part of zip file\nmmap failed for CEN and END part of zip file\n\nOK ... next I downgrade Java to Version 5 whatever\nstay tuned ...",
    "Created an attachment (id\u003d58610)\nthe log of the NullPointerException in JDT for M3\n\n",
    "Created an attachment (id\u003d58616)\nlog of initial error reproduced with Java 1.5.0_11-b03 and 3.3 M3\n\nNow I could set up a fresh test project in a new workspace. But creating the Test class triggers the error of not getting a java editor window.",
    "Moving to UI for comment.",
    "Bogdan, what is the printer support doing?  Creating the text editor is checking the text actions (which is checking printer support).  But it\u0027s generating close against the workbench window shell for some reason.\n\n\tat org.eclipse.swt.widgets.Shell.closeWidget(Shell.java:531)\n\tat org.eclipse.swt.widgets.Shell.gtk_delete_event(Shell.java:847)\n\tat org.eclipse.swt.widgets.Widget.windowProc(Widget.java:1468)\n\tat org.eclipse.swt.widgets.Display.windowProc(Display.java:3837)\n\tat org.eclipse.swt.internal.gtk.OS._gtk_main_do_event(Native Method)\n\tat org.eclipse.swt.internal.gtk.OS.gtk_main_do_event(OS.java:5506)\n\tat org.eclipse.swt.widgets.Display.eventProc(Display.java:1149)\n\tat org.eclipse.swt.internal.gtk.OS._gtk_enumerate_printers(Native Method)\n\tat org.eclipse.swt.internal.gtk.OS.gtk_enumerate_printers(OS.java:6137)\n\tat org.eclipse.swt.printing.Printer.getPrinterList(Printer.java:73)\n\nPW\n",
    "Please answer a couple of quesions for me:\n\n1) Do you have any printers installed (using CUPS), and if so, can you print to them from another application?\n\n2) What version of GTK are you using? (rpm -q gtk2)\n\nPlease also read bug 153936, and see if making any of the changes mentioned there (change to KDE if you are using Gnome, upgrade to a newer 2.10.x gtk, update your CUPS install, ...) make any difference for you.",
    "\u003e 1) Do you have any printers installed (using CUPS),\n\nI haven\u0027t gotten to that part yet. Starting the printer panel from the Desktop I see an empty queue. The menu lists filters for All printers, Fax, PDF, PostScript and eMail PDF. Firefox offers to print to PostScript only. Ksysguard lists a CUPSD process.\n\nPrinting from Konqueror results in an Error telling me (translated back from German):\nError while loading printer list:\nNo Connection to CUPS-Server. Please check that CUPS-Server is installed and active.\nCause: IPP-Request failed due to unknown reasons.\n\n\n\u003e 2) What version of GTK are you using? (rpm -q gtk2)\n\ngtk2-2.10.6-24.2\n\n\u003e Please also read bug 153936, and see if making any of the changes mentioned\n\u003e there (change to KDE if you are using Gnome, upgrade to a newer 2.10.x gtk,\n\u003e update your CUPS install, ...) make any difference for you.\n\nThat bug sounds quite familiar to me :-/\n\nI\u0027m already running KDE 3.5.5 \"release 45.2\"\n\nI was a little confused today ... in the tray there is an Update-Mini-Program, that told me, there are no new updates available. Nevertheless, I\u0027ve updated with Yast from the root-account and got some 60 packages including CUPS cups-1.2.7-12.1\n\nIn addition I\u0027ve installed Java via Yast:\n\njava version \"1.5.0_10\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.5.0_10-b03)\nJava HotSpot(TM) Client VM (build 1.5.0_10-b03, mixed mode)\n\nwhich is the latest Sun-JDK I found through Yast on the openSUSE servers.\n\nIt automatically replaced the 1.5.0_11 which I downloaded from sun directly. Maybe I made a fault in installing the jdk 1.5.0_11 and perhaps the same mistake when installing jdk 1.6.0-b105 yesterday.\n\nBut the good news is. I just ran M3 successfully and could create a new Java-Project and Java-Test-Class. Just to be sure I opened the print dialog, that offered printing to a file :-)\n\nNow I switched to M4 and hold your breath ... It\u0027s not working! This time I cannot even create a project. Other than the NullPointerException in the second attachment (M3 Java 6), this time (M4 Java 5_10) I did not even get the question, what kind of project I want to set up. (I\u0027ll attach the log) The toolbar-button for calling the creation-wizard is just grayed out. I gets color, on mouse over.\n\nI conclude with a wild guess: Is 512 MB physical RAM and 1 GB SWAP insufficient for running eclipse?",
    "Created an attachment (id\u003d58682)\nNullPointer on create new project in M4 with jdk 1.5.0_10\n\n",
    "Tod \u0026 Darin, I am trying to get to the bottom of a gtk printer problem, but these other 2 extraneous problems have come up in comment 9 and 10, and I just want to quickly get past them so we can get to the real problem. Thanks!\n\nTod, can you please help fix this \"fastview bar\" problem? Is it just a value in some config file that Holger can edit out?\n\n!MESSAGE Invalid value for org.eclipse.ui/initialFastViewBarLocation preference.  Value \"\" should be one of \"left\", \"bottom\", or \"right\".\n\n\nDarin, can you please help work around this null pointer problem? Is it just some vm version thing? Maybe Holger can use a different vm?\n\njava.lang.NullPointerException\n\tat org.eclipse.jdt.launching.JavaRuntime.equals(JavaRuntime.java:1675)\n\tat org.eclipse.jdt.launching.JavaRuntime.updateCompliance(JavaRuntime.java:2582)\n\tat org.eclipse.jdt.launching.JavaRuntime.initializeVMs(JavaRuntime.java:2556)\n\tat org.eclipse.jdt.launching.JavaRuntime.getDefaultVMId(JavaRuntime.java:497)\n\tat org.eclipse.jdt.launching.JavaRuntime.getDefaultVMInstall(JavaRuntime.java:451)\n",
    "(In reply to comment #11)\n\u003e Tod, can you please help fix this \"fastview bar\" problem? Is it just a value in\n\u003e some config file that Holger can edit out?\n\u003e \n\u003e !MESSAGE Invalid value for org.eclipse.ui/initialFastViewBarLocation\n\u003e preference.  Value \"\" should be one of \"left\", \"bottom\", or \"right\".\n\nCarolyn, this just causes us to pick bottom, it shouldn\u0027t effect the workflow or results.\n\nPW\n",
    "The NPE is coming from us trying to update the default compiler compliance options based on the JRE he starting the workspace with. I have not seen this problem before, but does look like a bug on our part. I suggest to try using a 1.4 or 1.5 VM to avoid this (looks like he\u0027s using 1.6). I\u0027ll file a bug against debug for this.",
    "(In reply to comment #13)\n\u003e I suggest to try using a\n\u003e 1.4 or 1.5 VM to avoid this (looks like he\u0027s using 1.6). I\u0027ll file a bug\n\u003e against debug for this.\n\nI started with\nJava 1.6.0-b105 directly from Sun -\u003e attachment 1 and 2\nDowngraded to 1.5.0_11-b03 also a download from Sun -\u003e attachment 3\nLast I switched to 1.5.0_10-b03 via Yast Update from openSUSE servers -\u003e attachment 4\n\n3.3M3 is working on 1.5.0_10-b03 (without intensive testing) so thats my choice for the weekend, because I have to present something on Monday ...",
    "Created an attachment (id\u003d58832)\njava.lang.Exception 3.3 M4 with jdk_1.5.0_10-b03\n\nI have to apologize! Finally I found the reason for my memory shortage. There definitely is a SWAP-Partition. But somehow it just wasn\u0027t activated. So attachment 1 to 4 should all be hidden memory-issues, that just did not come up with the correct OutOfMemoryException.\n\nMoreover I found out, that M3 would run with -Xmx150m but throw Exceptions at -Xmx180m whereas java refused to load the VM at -Xmx220m (without SWAP on 512 MB RAM).\n\nBut not to give you the impression of having finished ... M3 is now running from the launcher, but still I cannot run M4 and this time I double checked the memory:\n\nLinux-Host:/usr/java # free\n             total       used       free     shared    buffers     cached\nMem:        516220     508968       7252          0      34648     161744\n-/+ buffers/cache:     312576     203644\nSwap:      1032184         76    1032108\n\nAny idea on this?\n\nBTW: This Exception is the same for the launcher and by runnig java -jar startup.jar directly except for the logged times and commandline-arguments.",
    "Moving to Update. This no longer has anything to do with printing, and the stack trace in comment 15 looks like some kind of update problem. Unless it\u0027s a core problem (missing bundle). Note that Holger has been switching vms and eclipse versions to try to solve the problem, and may not be in a clean state (not sure).",
    "I did another update today, switching back to Java 6 in line with some automatic updates from OpenSUSE. Now 3.3 M4 is running even from the launcher.\n\nWell, I\u0027m quite happy to have it running now. But maybe the reports might help you to nail down other problems.\n\nThanks for your attention"
  ],
  "commentCreationDates": [
    "2007-02-08T21:31:06+01:00",
    "2007-02-08T21:34:03+01:00",
    "2007-02-08T22:01:31+01:00",
    "2007-02-08T22:18:48+01:00",
    "2007-02-08T22:21:15+01:00",
    "2007-02-08T23:22:20+01:00",
    "2007-02-09T15:27:07+01:00",
    "2007-02-09T16:16:15+01:00",
    "2007-02-09T17:19:00+01:00",
    "2007-02-09T19:08:24+01:00",
    "2007-02-09T19:11:52+01:00",
    "2007-02-09T19:56:44+01:00",
    "2007-02-09T20:08:02+01:00",
    "2007-02-09T20:20:20+01:00",
    "2007-02-09T20:33:11+01:00",
    "2007-02-13T07:09:07+01:00",
    "2007-02-13T14:28:27+01:00",
    "2007-02-15T15:06:25+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.jdt.launching.JavaRuntime.equals",
          "source": "JavaRuntime.java:1675"
        },
        {
          "method": "org.eclipse.jdt.launching.JavaRuntime.updateCompliance",
          "source": "JavaRuntime.java:2582"
        },
        {
          "method": "org.eclipse.jdt.launching.JavaRuntime.initializeVMs",
          "source": "JavaRuntime.java:2556"
        },
        {
          "method": "org.eclipse.jdt.launching.JavaRuntime.getDefaultVMId",
          "source": "JavaRuntime.java:497"
        },
        {
          "method": "org.eclipse.jdt.launching.JavaRuntime.getDefaultVMInstall",
          "source": "JavaRuntime.java:451"
        }
      ],
      "number": 0,
      "commentIndex": 11,
      "bugId": "173538",
      "date": "2007-02-09T19:56:44+01:00",
      "product": "Platform",
      "component": "Update",
      "severity": "critical"
    }
  ],
  "groupId": "173538",
  "bugId": "173538",
  "date": "2007-02-08T21:31:06+01:00",
  "product": "Platform",
  "component": "Update",
  "severity": "critical"
}