{
  "comments": [
    "Build ID: 3.2.1\n\nSteps To Reproduce:\n1. ZIP will be attached\n\n\nMore information:\nI am having problems making an update site to provide several\nfeatures.  I have been unable to resolve these problem after a\nsubstantial amount of time.  The behavior just does not make sense.\nIn order to understand better what is happening I have made a\n(relatively) simple test example.  This test example demonstrates\nseveral problems with update sites and the update mechanism without\nthe complication of my real situation.\n\nIt is, of course, possible that I have done something stupid, but if\nso, I cannot find it.  If that is the case I appologize.  I am\nrelatively experienced with Eclipse and have several update sites that\nwork all right.  This example attempts to isolate the places where\nproblems occur.  It is not completely simple, but it is a simple as I\ncan make it and still observe the problems.  I believe these are\nlegitimate problems.  Please bear with me.\n\nThis is for Eclipse 3.2.1 on Windows XP using JDK 1.5.0_09.\n\nTest case\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nThe test example consists of two plugins, organized into three\nfeatures, and an update site.\n\nThe first plugin, test.plugin1, was build with the Hello World\nexample.  It puts a menu on the toolbar that has an item that displays\na dialog with a message.\n\nThe second plugin, test.plugin2, was build with no examples, and is a\nbare-bones plugin.\n\nThese were changed as follows.\n\nA String field, message, was added to the Activator for plugin2, along\nwith a getMessage() method.  The action for Plugin1 was modified to\nget its message from plugin2 via:\n\ntest.plugin2.Activator.getDefault().getMessage()\n\nand a dependency on test.plugin2 was added in the manifest editor.\nPlugin2 was modified to export the package test.plugin2.  Otherwise,\napart from some renaming of \"sample\" to \"plugin1\", no significant\nchanges were made to the plugins as created.\n\nThe result is that we have two plugins, one of which depends on the\nplug-in code in the other.\n\nFeatures\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nI made three feature projects, again making minimal changes, mostly\non the Information tabs.\n\ntest.feature: Has test.plugin1 and test.plugin2.\n\ntest.feature1: Has test.plugin1 only. Depends on test.feature2.\n\ntest.feature2: Has test.plugin2 only.\n\nUpdate Site\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nI made an update and modified it in several ways.  I installed it in a\nclean version of Eclipse 3.2.1 with no other features or plugins\ninstalled.  The test Eclipse was started with -clean.\n\n1. Category 1 with test.feature.  This installs and works as expected.\n\n2. Category 2 with test.feature1 and test.feature2.  This also\ninstalls and works as expected.  The update manager notices that\ntest.feature1 requires test.feature2, if you just select\ntest.feature1.\n\n3. Both of the above.  Now the problems start.  First Build ALL gets an error:\n\n--------------------------------------------------------------------\n# 2/13/07 11:33:13 AM CST\n# Eclipse Java Compiler v_677_R32x, 3.2.1 release, Copyright IBM Corp 2000, 2006. All rights reserved.\n----------\n1. ERROR in C:\\Documents and Settings\\evans\\My Documents\\Eclipse\\Work\\test.plugin1\\src\\test\\plugin1\\actions\\Plugin1Action.java (at line 35)\n\ttest.plugin2.Activator plugin2 \u003d test.plugin2.Activator.getDefault();\n\t^^^^^^^^^^^^\ntest.plugin2 cannot be resolved to a type\n----------\n2. ERROR in C:\\Documents and Settings\\evans\\My Documents\\Eclipse\\Work\\test.plugin1\\src\\test\\plugin1\\actions\\Plugin1Action.java (at line 35)\n\ttest.plugin2.Activator plugin2 \u003d test.plugin2.Activator.getDefault();\n\t                                 ^^^^^^^^^^^^\ntest.plugin2 cannot be resolved\n----------\n2 problems (2 errors)\n--------------------------------------------------------------------\n\nNote, the plug-ins have not changed.  Moreover, the generated JAR\nfile has test.plugin2.Activator.class in it.  (I will show later that\nit seems to be OK.)\n\nIn the update manager, it no longer notices that test.feature1\nrequires test.feature2 if you just select test.feature1.  It installs\nwith everything selected.  However, when selecting the menu\nitem, it says that test.plugin2 cannot be resolved to a type, and the\ndialog does not appear.  (This is the sort of thing that is happening\nin my real case.)\n\nIf I remove _either_ of the categories in the update manager, it does\nnot give any errors on Build All and works as expected.  It does not\nwork if leave both of the categories in, but select only one or the\nother of them to install.\n\nI note that the Plug-in Development Environment Guide says a feature\ncan appear in \u003e\u003d0 categories.  Though I have had more trouble\ndetermining if a plugin can be in more than one feature, it says that\nis the case in \"The Java Developer\u0027s Guide to Eclipse\", by D\u0027Anjou, et\nal., p. 319.  In any event, there is no reason a plug-in should not\nappear in more than one feature nor that a feature should not appear\nin more than one category.  If there are such restrictions, then there\nshould be a mechanism on the update site or in the update manager to\ndiscover this.\n\nList of Problems\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nA. This example indicates there are problems with update sites and in\nthe update manager when there are multiple plug-ins and/or multiple\nfeatures.  There are also has problems with the build (Build All).\n\nB. In  addition I note that  there is an item,  \"Recompile when feature\nplug-ins change\", with a check box.  If you check this box, it does not\nremain checked.  I  cannot see where it gets into feature.xml, and it\nis not described in the help for the feature manifest editor.\n\nC. In the update manager, I note that if I have a feature that depends\non two features (not the above case) then if I check only the box for\nthat feature, then it says it needs one of the other features (as it\nshould).  However, if I then check the stated, required feature, it\ncontinues to say it needs that feature, whereas it should then say it\nneeds the other feature.  I have a screen dump of this if requested.\n\nD. In my real case, I have several features that are intended to be\ninstalled optionally.  Several of these depend on one of the features.\nI get the build errors as detailed above.  I can eliminate them by\nputting /bin in the Classpath in the Runtime tab for the plug-in.\nHowever I should not have to do this.  As stated, the JARS are OK, as\nfar as I can tell.  In this case, I get a message:\n\n--------------------------------------------------------------------\norg.osgi.framework.BundleException: The activator gov.anl.xrays.jai.plugin.JAIPlugin for bundle gov.anl.xrays.jai is invalid\n\tat org.eclipse.osgi.framework.internal.core.AbstractBundle.loadBundleActivator(AbstractBundle.java:141)\n\tat org.eclipse.osgi.framework.internal.core.BundleContextImpl.start(BundleContextImpl.java:962)\n...\nRoot exception:\njava.lang.ClassNotFoundException: gov.anl.xrays.jai.plugin.JAIPlugin\n\tat org.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:402)\n\tat org.eclipse.osgi.framework.internal.core.BundleLoader.findClass(BundleLoader.java:347)\n--------------------------------------------------------------------\n\nI note that debugging indicates that the gov.anl.xrays.jai plugin was\ncreated (BundleData created: gov.anl.xrays.jai_1.0.0).  It appears in\nthe Plugin-Details in the About dialog.  It cannot be _found_ by the\nclass loader when the plugin-that depends on it starts up.  (Note that\nfindClass fails, not loadClass.)\n\nI also note that all of these plug-ins involved run properly in the\nruntime workspace.  I just cannot export them via the update\nmechanism.\n\nOK, I realize this is too long.  I will attach a ZIP of the test\ncases, as it is probably easier to test it than to question me about\nall the possible things I might have done wrong.  It is also easier\nto see what is happening.  I have been careful with the test case to\ndo as little as possible that might introduce errors.\n\nHopefully, if the problems with the test case can be worked around,\nthe problem with my real case can also be fixed.  It is much more\ncomplicated, and will be harder to describe.  The problem is that it\nis unlikely to work when there are problems with the simplier test\ncase.  It is hard for me to debug what is happening inside Eclipse.\n\nI have spent the time to provide a documented test case.  I hope that\nsomeone will pay attention to it.  I think these are are critical\nproblems.  They are for me, in fact, a stopper.\n\nThanks.",
    "Created an attachment (id\u003d58877)\nZIP of the described projects. \n\nZIP of the described projects.  The update site is in a different part of the file system.",
    "Created an attachment (id\u003d58878)\nPNG image.\n\nScreen dump of Update Manager continuing to say a plug-in is required when it is, in fact, in a selected feature.  The same message appeared before the XRAYS core feature was selected, and did not change when it became selected.  The missing required plug-in is actually in XRAYS JAI, which has not been selected, yet.",
    "Hello , sorry about the delay\n\nI tried the scenario C with the zip you sent\n\nVersion: 3.3.0\nBuild id: I20070321-1800\n\nI selected Interactiontest2\\Interaction Test Feature 1 and got the proper error message stating feature 1 requires feature 2\nI select feature 2 and the error message disappears\nI un-select feature 2 and the error message appears\nI select feature 2 and the error message disappears\n\nDid I do something wrong or did we fix this part of the issue ?\nlet me know :)\n",
    "Hi,\n\n    I don\u0027t have version 3.3.  If it behaves as you said, that part of the problem may be fixed.  I am using 3.2.2 and that version definitely has that problem, and not just with this test case.\n\n    Have you tested the problem with the build errors.\n\n    It has been long enough that I don\u0027t remember what I did all that well.\n\n     Thanks,\n\n     -Ken\n\n",
    "Ken, the build error is still there, I verified I also get the compiler error\nBut I cannot reproduce the \u0027C\u0027\n\nI will open a bug against PDE build, pointing to this one\nIf you have time ( i know, I know :) try the 3.3 to ensure you do not see the \u0027C\u0027 anymore :)"
  ],
  "commentCreationDates": [
    "2007-02-13T18:49:45+01:00",
    "2007-02-13T18:54:42+01:00",
    "2007-02-13T18:59:46+01:00",
    "2007-04-12T02:52:48+02:00",
    "2007-04-12T17:04:22+02:00",
    "2007-04-12T18:50:11+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.osgi.framework.BundleException",
      "message": "The activator gov.anl.xrays.jai.plugin.JAIPlugin for bundle gov.anl.xrays.jai is invalid",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.AbstractBundle.loadBundleActivator",
          "source": "AbstractBundle.java:141"
        },
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleContextImpl.start",
          "source": "BundleContextImpl.java:962"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "174045",
      "date": "2007-02-13T18:49:45+01:00",
      "product": "Platform",
      "component": "Update",
      "severity": "critical"
    },
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "gov.anl.xrays.jai.plugin.JAIPlugin",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:402"
        },
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleLoader.findClass",
          "source": "BundleLoader.java:347"
        }
      ],
      "number": 1,
      "commentIndex": 0,
      "bugId": "174045",
      "date": "2007-02-13T18:49:45+01:00",
      "product": "Platform",
      "component": "Update",
      "severity": "critical"
    }
  ],
  "groupId": "174045",
  "bugId": "174045",
  "date": "2007-02-13T18:49:45+01:00",
  "product": "Platform",
  "component": "Update",
  "severity": "critical"
}