{
  "comments": [
    "To launch an equinox runtime via the Eclipse Launcher wizard, you must have the \"org.eclipse.osgi\" bundle selected in the line-up.  If it\u0027s not, the tooling tells you it must be included as soon as you hit the Run button -- so you have to re-open the launch wizard, add it manually, and try again.\n\nTo reproduce:\n\n1.  Create a new Equinox OSGi Framework launch configuration.\n2.  Click \"Deselect All\".  You should have 0 bundles selected.\n3.  Click the \"Validate Plug-in Set\" button and you\u0027ll get the \"No problems were detected in the selected set of plug-ins.\" dialog.\n4.  Click the \"Run\" button and you\u0027ll get the \"The org.eclipse.osgi plug-in is missing from this configuration.\" dialog. \n\nIf this IS a required bundle as far as the tooling is concerned, then:\n\na) the \"Add Required Plugins\" button should add it if it is missing\nb) the \"Validate Plugin Set\" button should warn the user if the bundle is missing\nc) the launch wizard should not close after hitting \"Run\" if the bundle is missing",
    "I believe that Brett was testing on Eclipse 3.2.2 and Equinox 3.2.2, where his problem desciption is accurate.  This is even more problematic on Eclipse 3.3 M5, since an NPE is thrown and written to the .log:\n\n!ENTRY org.eclipse.core.jobs 4 2 2007-02-27 10:57:31.314\n!MESSAGE An internal error occurred during: \"Launching\".\n!STACK 0\njava.lang.NullPointerException\n\tat java.util.Hashtable.put(Unknown Source)\n\tat org.eclipse.pde.ui.launcher.EquinoxLaunchConfiguration.saveConfigurationFile(EquinoxLaunchConfiguration.java:81)\n\tat org.eclipse.pde.ui.launcher.EquinoxLaunchConfiguration.getProgramArguments(EquinoxLaunchConfiguration.java:63)\n\tat org.eclipse.pde.ui.launcher.AbstractPDELaunchConfiguration.launch(AbstractPDELaunchConfiguration.java:75)\n\tat org.eclipse.pde.ui.launcher.OSGiLaunchConfigurationDelegate.launch(OSGiLaunchConfigurationDelegate.java:48)\n\tat org.eclipse.debug.internal.core.LaunchConfiguration.launch(LaunchConfiguration.java:747)\n\tat org.eclipse.debug.internal.core.LaunchConfiguration.launch(LaunchConfiguration.java:613)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch(DebugUIPlugin.java:819)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin$7.run(DebugUIPlugin.java:1013)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)\n",
    "I\u0027m also seeing the NPE.  In addition, the launch configuration fails to start with a \u0027An internal error occurred during: \"Launching\"\u0027 dialog.",
    "We will address this bug for M6. \n\nHowever, I find it interesting (and alarming :) that people are launching the framework with no bundles selected.  What are you expecting it to do without the osgi framework bundle?",
    "I wouldn\u0027t expect anybody to intentionally attempt to launch with the framework bundle.  If a user forgets to select the framework bundle, however, a NPE does not help them determine the problem.  ",
    "Sometimes it\u0027s nice to launch an empty runtime just to make sure the launcher works... or if you\u0027re planning on installing bundles via their URLs.",
    "Heated agreement.  My preference is to typically start with no bundles selected, and then to hand pick only those that I want.  This is pretty common when using Equinox for OSGi application development, rather than Eclipse plug-in development.  In the embedded space you\u0027re trained to truly understand your application dependencies and to resist dependency creep.\n\nWriting this comment inspired me to create bug 177444.\n\n:-)",
    "I understand the \u0027start with no bundles and then install on-demand\u0027 scenario.  \n\nYou won\u0027t get very far without at least the osgi bundle though.  That was my point.  From comment 4, it seems that people are inadvertently getting themselves into the situation by pressing \u0027Deselect All\u0027 and launching, not realizing that there is no such thing as free lunch, and they don\u0027t get osgi for free.",
    "need to keep in mind cases where you are launching other frameworks where the bundle is not org.eclipse.osgi. ",
    "In 3.3, the Equinox launcher has been renamed to the \u0027OSGi Framework\u0027 launcher and was made more generic in that you can launch with other OSGi frameworks.\n\nNon-equinox frameworks must register themselves and their launcher delegates (ie. the class that does the actual launching) via an org.eclipse.pde.ui.osgiFrameworks extension.\n\nNow back to this defect:\nThe launch configuration itself should be org.eclipse.osgi-agnostic and must treat all frameworks equally without particular knowledge of any framework requirements.  The only thing that can be done in the launch configuration itself is the feedback message when you press the Validate button.  Instead of telling you that everything is fine, it should tell you that \u0027no bundles are selected\u0027.  A no-bundle-is-selected may be fine for some other framework, so this is not an error state as far as the launch configuration is concerned.\n\nNow when you come to launch the launch config with the Equinox framework, the PDE Equinox launch delegate gets called.  This class is org.eclipse.osgi-aware and tells you that osgi has not been selected (in 3.2) or throws an NPE (in 3.3 ;).  We could tweak this class to be more helpful and perhaps offer to find/check an osgi plugin for you if you are lauching with no bundles.\n",
    "Would this be a good case for the OSGi launch delegate to be able to participate in the \"Add Required Plugins\" and/or \"Validate Plugin Set\" logic via an extension point?  Then any framework-specific bundles could be selected correctly, avoiding any errors/warnings after the launch.  From the user perspective it\u0027s all the same wizard.",
    "yes, that would make sense.\n\nUnfortunately, API freeze for 3.3 is effectively today and technically next week. I would not be comfortable committing to API additions at this point.\n\nIncidentally, and somewhat unrelated, all references to \u0027plug-in\u0027 will be replaced by \u0027bundle\u0027 in the OSGi framework launcher as of M6.",
    "It\u0027s like Christmas in March... I didn\u0027t dare ask for a rename, but I\u0027m happy to hear it\u0027s happening.  Bundle developers unite!",
    "This is all in an effort to reduce the amount of PDE slandering in public ;)\n\nhere is a passage from a certain eclipsecon talk abstract:\n\"we explain some of the gaps we discovered in the Eclipse tooling and the approaches that we have taken to fill them while developing, deploying, and maintaining these complex applications running on over a dozen remote devices. \n\"",
    "Fixed.\n\nSince the launch configuration is now a generic OSGi launch configuration, not an Equinox launch configuration, we cannot put any org.eclipse.osgi logic in it.\n\nHowever, when it comes to launching time, the Equinox launcher delegate that gets called now auto-manages the org.eclipse.osgi plug-in.  If it is missing, it finds the best suitable osgi plug-in (ie. a workspace copy has precedence over a target copy of the osgi plug-in) and we launch with it.\n\nIf for some reason, we can\u0027t find osgi in the workspace or target, the launch fails with an error message indicating so.\n\nThis auto-management of osgi for Equinox launches is consistent with the auto-management of bootstrap code for Eclipse app launches and auto-discovery of JUnit plug-ins for JUnit Plug-ins launches.",
    "\u003e\u003e Comment #14 From Wassim Melhem 2007-04-29 02:45:01 [reply]\n\nClearly you were up late last night, or maybe just up very early this morning!  Thanks, Wassim.",
    "\u003eClearly you were up late last night, or maybe just up very early this \u003emorning! \n\nAnother explanation could be that I am working out of my home office in Cairo, Egypt.\n"
  ],
  "commentCreationDates": [
    "2007-02-26T21:06:17+01:00",
    "2007-02-27T16:04:31+01:00",
    "2007-03-14T20:49:17+01:00",
    "2007-03-14T21:15:36+01:00",
    "2007-03-14T21:32:23+01:00",
    "2007-03-14T21:36:16+01:00",
    "2007-03-14T22:57:17+01:00",
    "2007-03-14T23:14:43+01:00",
    "2007-03-16T17:04:39+01:00",
    "2007-03-16T18:49:16+01:00",
    "2007-03-16T19:06:35+01:00",
    "2007-03-16T19:17:12+01:00",
    "2007-03-16T19:23:48+01:00",
    "2007-03-16T19:42:46+01:00",
    "2007-04-29T08:45:01+02:00",
    "2007-04-29T15:46:18+02:00",
    "2007-04-30T05:29:20+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "java.util.Hashtable.put",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.pde.ui.launcher.EquinoxLaunchConfiguration.saveConfigurationFile",
          "source": "EquinoxLaunchConfiguration.java:81"
        },
        {
          "method": "org.eclipse.pde.ui.launcher.EquinoxLaunchConfiguration.getProgramArguments",
          "source": "EquinoxLaunchConfiguration.java:63"
        },
        {
          "method": "org.eclipse.pde.ui.launcher.AbstractPDELaunchConfiguration.launch",
          "source": "AbstractPDELaunchConfiguration.java:75"
        },
        {
          "method": "org.eclipse.pde.ui.launcher.OSGiLaunchConfigurationDelegate.launch",
          "source": "OSGiLaunchConfigurationDelegate.java:48"
        },
        {
          "method": "org.eclipse.debug.internal.core.LaunchConfiguration.launch",
          "source": "LaunchConfiguration.java:747"
        },
        {
          "method": "org.eclipse.debug.internal.core.LaunchConfiguration.launch",
          "source": "LaunchConfiguration.java:613"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch",
          "source": "DebugUIPlugin.java:819"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin$7.run",
          "source": "DebugUIPlugin.java:1013"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 1,
      "bugId": "175599",
      "date": "2007-02-27T16:04:31+01:00",
      "product": "PDE",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "175599",
  "bugId": "175599",
  "date": "2007-02-26T21:06:17+01:00",
  "product": "PDE",
  "component": "UI",
  "severity": "normal"
}