{
  "comments": [
    "Using Eclipse 3.3 M5, on Windows XP\n\nHaving exported my RCP application using the export wizard, I am finding that the generated .exe does not work, resulting in the error dialog:\n\n  The \u003capplication\u003e executable launcher was unable to locate\n  its companion shared library.\n\nThis is curious, since:\n\n1. java.exe is on my path.\n\n2. The RCP application runs fine from within the IDE using an Eclipse\n   Application launch configuration.\n\n3. The RCP application can be forced to run using a command line such as:\n\n   java -jar plugins\\org.eclipse.equinox.launcher_1.0.0.v20070208a.jar\n     -application com.xyz.myapp_application\n\n\nThis bug, by the way, does not feel like it belongs in PDE/UI, but this is a good place to start.",
    "Does the exported product contain a org.elcipse.equinox.launcher.win32.win32.x86 fragment?  Is that fragment in folder form (not a jar)?\n",
    "Yes, I believe so...\n\n$dir plugins\\org.eclipse.equinox.launcher*.*\n Volume in drive C has no label.\n Volume Serial Number is 44FE-578C\n\n Directory of C:\\myapp\\eclipse\\plugins\n\n03/01/2007  12:00 PM            41,614 org.eclipse.equinox.launcher_1.0.0.v20070208a.jar\n03/01/2007  12:00 PM            36,038 org.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070208a.jar\n               2 File(s)         77,652 bytes\n               0 Dir(s)   2,582,151,168 bytes free\n",
    "I think the problem is that the fragment is jared:\norg.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070208a.jar\n\nUnzip that jar so that it is a folder named org.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070208a\n\nWassim, during the export, the generated feature must have unpack\u003dtrue for the launcher fragments.  The fragments don\u0027t specify a Bundle-ClassPath since they don\u0027t contain any java code.\n\nI don\u0027t know if there is something we can do to the fragments to make them recognized as needing to have unpack\u003dtrue\n\n",
    "I did an RCP export and the fragment in question was flat, not JARd.\n\n\u003eI don\u0027t know if there is something we can do to the fragments to make them\n\u003erecognized as needing to have unpack\u003dtrue\nIt would be nice if this information (ie. to pack/unpack) was actually in the build.properties/MANIFEST.MF of the plug-in itself, so that PDE would not have to guess and/or make choices for the user in plugin-based exports.",
    "Some more details about my configuration...\n\n- Using a Pre-defined Target (unlikely the cause).\n\n- The fragment plug-in, org.eclipse.equinox.launcher.win32.win32.x86, resides\n  in the target platform as a folder, not a JAR.\n\n- The fragment plug-in is described in the RCP .product file as:\n  \u003cplugin id\u003d\"org.eclipse.equinox.launcher.win32.win32.x86\" fragment\u003d\"true\"/\u003e\n",
    "Nothing equinox can do here.  We need help from tooling to ensure that the launcher fragment is not jar\u0027ed.",
    "Here are some steps to reproduce this problem:\n\n1.  File \u003e New \u003e Other..., then choose \"Plug-in Project\", click Next.\n2.  Enter a Project name, such as \"HelloRcp\", click Next.\n3.  Under \"Rich Client Application\" choose the \"Yes\" radio button.\n4.  Choose the \"Hello RCP\" template, click Finish.\n5.  File \u003e New \u003e Other..., then choose \"Product Configuration\", click Next.\n6.  Entery a filename, such as \"HelloRcp.product\", click Finish.\n7.  In the Product editor enter a Product Name, such as \"HelloRcp\".\n8.  In the Product editor define a Product ID by clicking New and then Finish.\n9.  Save the Product editor changes.\n10. In the Product editor, under Exporting, click the \"Eclipse product export wizard\" link.\n11. In the export wizard enter a directory into which to export the application.\n12. Once exported, find the application and run \"eclipse.exe\".\n13. The following error will be displayed: \"The Eclipse executable launcher was not able to locate its companion shared library.\"\n\nWhile developing these steps I saw the following error when trying to launch the app from within the IDE using the Product editor\u0027s Testing section, which has a \"Launch the product\" link.\n\n!ENTRY org.eclipse.equinox.launcher 4 0 2007-04-30 11:47:08.597\n!MESSAGE Exception launching the Eclipse Platform:\n!STACK\njava.lang.ClassNotFoundException: org.eclipse.core.runtime.adaptor.EclipseStarter\n  at java.net.URLClassLoader$1.run(Unknown Source)\n  at java.security.AccessController.doPrivileged(Native Method)\n  at java.net.URLClassLoader.findClass(Unknown Source)\n  at java.lang.ClassLoader.loadClass(Unknown Source)\n  at java.lang.ClassLoader.loadClass(Unknown Source)\n  at org.eclipse.equinox.launcher.Main.invokeFramework(Main.java:473)\n  at org.eclipse.equinox.launcher.Main.basicRun(Main.java:416)\n  at org.eclipse.equinox.launcher.Main.run(Main.java:1141)\n  at org.eclipse.equinox.launcher.Main.main(Main.java:1116)\n\n\nRemember, this is all being done using Eclipse 3.3 M6 and the \"Hello RCP\" template, with no custom code or configuration.  I\u0027m really concerned that the out-of-the-box experience for developing an RCP app has degraded in 3.3.\n\nOf course I might just be doing something wrong, but I don\u0027t think I am.  I\u0027ve consulted with other folks here and we\u0027re pretty convinced that \"stuff\u0027s broken\".  I hope this help!\n",
    "(In reply to comment #7)\nYou are missing some steps:\n8.5: In the Product editor, Configuration Tab, Click [Add...], select your HelloRcp plug-in.  \n8.6: In the Product editor, Configuration Tab, Click [Add Required Plug-ins]",
    "Of course, Andrew is correct.  Thank you, Andrew.\n\nThese missing steps were preventing me from trying out the work-around, which is to:\n\n1.  Find org.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070318.jar, which will be in the plugins folder.\n2.  Create a folder within the plugins folder called org.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070318a.  By adding \"a\" to the end you don\u0027t have to delete the JAR since Eclipse will always pick the later name.\n3.  Extract org.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070318.jar\nit into the folder.\n4.  Run eclipse.exe to start the HelloRcp application.\n",
    "Simon, is there a bug here?  If so, how do we reproduce it taking into account the missing steps that add plug-ins to the product file?",
    "The bug, as far as I understand it, is that when you export an RCP application using the export link in the Product editor, the fragment plug-in org.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070318 is getting JAR\u0027d when it shouldn\u0027t be.\n\nDo you agree, or are we misunderstanding each other?",
    "I do agree, but the last time I tried it (comment 4), the fragment was not JARd.  I was hoping you would be able to provide a reproducible scenario that proves otherwise.",
    "Wassim, if you follow the steps outlined in comment 7 and comment 8 you will see the problem.  But you must follow the steps exactly... I fear that you\u0027re injecting some knowledge into the steps that is preventing the problem from being observed.  Sometimes you can know too much.  :-)\n\nI am running Eclipse \"Version: 3.3.0, Build id: I20070209-1006\".  I cannot believe that through some happy coincidence you\u0027re running on a version of Eclipse where this problem is fixed, but anything\u0027s possible.\n\nPlease try the steps again, creating a new HelloRcp application, or get someone else that is unfamilar with this problem to try it.\n\nMaybe one of the many cc\u0027ers to this bug report can also try the steps and report their findings.",
    "Simon, I would suggest trying a newer build.  I have been unable to reproduce this using I20070430-0800.  I did your steps explicitly (including the 8.5,8.6) after various permutations of my own export (with \u0026 without delta pack, with and without the launchers in the config) failed to reproduce the problem.",
    "I shall try this one again on M7 later in the week.  It sounds like this one has probably been fixed.  Since we have a work around (extract the JAR by hand) this is not particularly urgent for us.  Thanks again, Andrew.\n",
    "In a plugin-based product configuration, PDE tries to \"guess\" whether a plug-in should be JARd based on its Bundle-Classpath, etc.\n\nFor good measure, I added a paranoid check to always leave all fragments of the launcher plug-in flat (ie. unpack\u003d\"true\" in the feature.xml that we generate).",
    "Thank you, Wassim.",
    "Hi,\n\nI still have this problem in the 3.3 release. But not in the export wizard but in the non-interactive PDE build (eclipse.exe -application org.eclipse.pde.build.Build -consolelog).\nWe use this to automatically build RCP applications.\n\nThe plugin org.eclipse.equinox.launcher.win32.win32.x86_1.0.0.v20070523 in the resulting zip file is JARed and not extracted. After manually extracting the JAR the application works again.\n\nCan you reopen this bug?",
    "Please open a separate bug report against PDE/Build."
  ],
  "commentCreationDates": [
    "2007-03-01T19:35:01+01:00",
    "2007-03-01T20:07:05+01:00",
    "2007-03-01T20:21:50+01:00",
    "2007-03-01T21:37:08+01:00",
    "2007-03-01T21:49:55+01:00",
    "2007-03-01T23:45:38+01:00",
    "2007-03-21T20:33:47+01:00",
    "2007-04-30T17:52:01+02:00",
    "2007-04-30T18:56:23+02:00",
    "2007-04-30T19:24:34+02:00",
    "2007-04-30T19:30:36+02:00",
    "2007-04-30T19:37:04+02:00",
    "2007-04-30T19:40:44+02:00",
    "2007-04-30T19:48:15+02:00",
    "2007-04-30T19:53:57+02:00",
    "2007-04-30T20:18:04+02:00",
    "2007-04-30T20:51:31+02:00",
    "2007-04-30T20:54:14+02:00",
    "2007-07-10T08:28:20+02:00",
    "2007-07-10T08:30:11+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "org.eclipse.core.runtime.adaptor.EclipseStarter",
      "elements": [
        {
          "method": "java.net.URLClassLoader$1.run",
          "source": "Unknown Source"
        },
        {
          "method": "java.security.AccessController.doPrivileged",
          "source": "Native Method"
        },
        {
          "method": "java.net.URLClassLoader.findClass",
          "source": "Unknown Source"
        },
        {
          "method": "java.lang.ClassLoader.loadClass",
          "source": "Unknown Source"
        },
        {
          "method": "java.lang.ClassLoader.loadClass",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.equinox.launcher.Main.invokeFramework",
          "source": "Main.java:473"
        },
        {
          "method": "org.eclipse.equinox.launcher.Main.basicRun",
          "source": "Main.java:416"
        },
        {
          "method": "org.eclipse.equinox.launcher.Main.run",
          "source": "Main.java:1141"
        },
        {
          "method": "org.eclipse.equinox.launcher.Main.main",
          "source": "Main.java:1116"
        }
      ],
      "number": 0,
      "commentIndex": 7,
      "bugId": "176084",
      "date": "2007-04-30T17:52:01+02:00",
      "product": "PDE",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "176084",
  "bugId": "176084",
  "date": "2007-03-01T19:35:01+01:00",
  "product": "PDE",
  "component": "UI",
  "severity": "normal"
}