{
  "comments": [
    "+++ This bug was initially created as a clone of Bug #155267 +++\n\nBelow is my original 155267 bug Description.  I have since downloaded Eclipse 3.2.2 and installed WebTools 1.5.3 from the Software Updates menu and using Tomcat 5.5.17.  I think the problem may be that Web Tools Tomcat server functionality is expecting my workspace to be in some default location (perhaps inside the Eclipse application\u0027s directory) and can\u0027t find the source using just the project name as the docBase because the workspace isn\u0027t in that default location.  I believe something needs to be changed so the server correctly determines where the workspace is located and looks for the docBase within that location, or adding the project to the server generates the absolute path of the docBase in server.xml.   \n\nOriginal bug Description:\n\nUsing wtp-all-inone-sdk-R-1.5.0 and Tomcat 5.0.18\n\nWhen I add CredCriteria project to my Tomcat server, it adds\n\u003cContext docBase\u003d\"CredCriteria\" path\u003d\"/credcriteria\" reloadable\u003d\"true\" source\u003d\"org.eclipse.jst.j2ee.server:CredCriteria\"/\u003e to server.xml and generates following exception when server is started:\nSEVERE: Error starting static Resources\njava.lang.IllegalArgumentException: Document base C:\\eclipse 3.2 Web workspace\\.metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\webapps\\CredCriteria does not exist or is not a readable directory\n\tat org.apache.naming.resources.FileDirContext.setDocBase(FileDirContext.java:185)\n\tat org.apache.catalina.core.StandardContext.resourcesStart(StandardContext.java:3858)\n\nI can comment this out and manually add the following and it works (debugger breakpoints also work):\n\u003cContext docBase\u003d\"c:/eclipse 3.2 Web workspace/CredCriteria\" path\u003d\"/credcriteria\" reloadable\u003d\"true\"/\u003e\n\nNeed to fix so adding a project to the server generates a context that works.\n\nNote: Although this is a minor bug, it can be very time consuming to determine the cause/solution and fix manually.",
    "Hi Aaron,\nAs I started to explain in bug 155267, this is the expected format inside the workspace. When you publish to a server (either to the metadata config folder in the past bug or out to a real server), this path should be expanded to the correct or relative location. Can you check the server.xml in [workspace]\\.metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\conf to see if it has the same problem, or are you copying the configuration directly out of the workspace yourself?",
    "The fact that \"...\\tmp0\\webapps\\CredCriteria\" is referenced by the exception but wasn\u0027t created suggests that \"Run modules directly...\" was checked and something went wrong during publish.  Setting the docBase to \"c:/eclipse 3.2 Web workspace/CredCriteria\" could have avoided the exception, but I don\u0027t see how the webapp would have worked correctly since the WEB-INF folder would have been under \"WebContent\" relative to the docBase.\n\nAaron,\n\nIf this workspace still exists, it would be helpful to attach the following, provided it still exists in that workspace:\n\n1) Zip of WTP Servers project\n2) Zip of the CredCriteria project if not recreated with MyEclipse (remove any proprietary content and WEB-INF/lib jars to minimize size)\n3) Zip of \"C:\\eclipse 3.2 Web workspace\\.metadata\\.plugins\\org.eclipse.wst.server.core\" folder (remove any proprietary content)\n4) .log file in \"C:\\eclipse 3.2 Web workspace\\.metadata\" (zip if large)\n\nWithout this, we would be shooting in the dark to determine what was actually going wrong.  If you have cleaned out all of these, and you aren\u0027t able to reproduce this, then it may be best to close this bug as INVALID.  I do basically what you describe often with many versions of Tomcat and don\u0027t encounter this problem.\n\nThanks,\nLarry",
    "(In reply to comment #1)\n\u003e Hi Aaron,\n\u003e As I started to explain in bug 155267, this is the expected format inside the\n\u003e workspace. When you publish to a server (either to the metadata config folder\n\u003e in the past bug or out to a real server), this path should be expanded to the\n\u003e correct or relative location. Can you check the server.xml in\n\u003e [workspace]\\.metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\conf to see if\n\u003e it has the same problem, or are you copying the configuration directly out of\n\u003e the workspace yourself?\n\nI replied to your email from my rarely used \u0027Hotmail\u0027 account but don\u0027t see anything in the \u0027sent\u0027 folder so will attempt to repeat my reply here.  The server.xml in the location below is the same as the one I changed in the Servers project.  It has both the original Context element and the one I added with the full path (with one of them commented out).  In case this may have something to do with it, I moved WEB-INF and META-INF from WebContent (deleted) to the main project directory and src to WEB-INF and changed the build path configuration (under project properties) to match.  I did this to duplicate the project structure in the MKS Source Integrity repository so it would populate correctly when I created a sandbox.  Maybe its assuming there is always a WebContent folder when a full path isn\u0027t specified?  I just verified that the application does work using the context with the full path to the project and doesn\u0027t when using the generated one containing only the project name as the docBase. \n\n(In reply to comment #1)\n\u003e Hi Aaron,\n\u003e As I started to explain in bug 155267, this is the expected format inside the\n\u003e workspace. When you publish to a server (either to the metadata config folder\n\u003e in the past bug or out to a real server), this path should be expanded to the\n\u003e correct or relative location. Can you check the server.xml in\n\u003e [workspace]\\.metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\conf to see if\n\u003e it has the same problem, or are you copying the configuration directly out of\n\u003e the workspace yourself?\n\n",
    "Hi Aaron,\n\nThanks for your response, it seems likely that the creation of the \"tmp0\\webapps\\CredCriteria\" may depend on copying something under that directory.  By moving the META-INF and WEB-INF out from under \"WebContent\", you may have left the publish operation nothing to copy, and no \"CredCriteria\" directory was created.\n\nWTP doesn\u0027t really support this kind of customization of a Dynamic Web project.  The \"WebContent\" is there to separate the content portion of the webapp from the project\u0027s metadata, among other things.  By moving the META-INF and WEB-INF into the root of your project, you have effectively moved resources like \".project\", \".classpath\", and the \".settings\" folder into your webapp.  I\u0027m not sure what you would get if you tried to export this project with WTP\u0027s Export -\u003e WAR file.\n\nI\u0027m not familiar with MyEclipse, but it and I think the Sysdeo Tomcat plug-in would probably be happier with you current project structure that WTP is.  I also don\u0027t know MKS, to say if there is a practical way to use it and keep WTP\u0027s preferred project structure.\n\nSince this is due to unsupported modifications to the project format, I\u0027m marking this bug INVALID.\n\nI assume that the Java source for this project is found found under the WEB-INF/classes folder of the project.  If this is the case, I unfortunately haven\u0027t yet found a way allow the project to be fetched into the WebContent folder of a Dynamic Web Project and manually reconfigure the project so that it works with exporting as a WAR file.  Assuming WTP 1.5.x, publishing to a server can be made to work by removing the \u003cweb-resource\u003e element from the \".settings/org.eclipse.wst.common.component\" file that has the deploy-path set to \"/WEB-INF/classes\".  Then in the \".classpath\" file, replace the \"\u003cclasspathentry kind\u003d\"src\" path\u003d\"src\"/\u003e\" entry with:\n\n\u003cclasspathentry excluding\u003d\"*.class\" kind\u003d\"src\"\n   output\u003d\"WebContent/WEB-INF/classes\" path\u003d\"WebContent/WEB-INF/classes\"/\u003e\n\nThis approach has the advantage of not including all of the project overhead files in the webapp.  A custom Ant build could be created to create the WAR file.",
    "Larry,\n\nThanks for your (quick) reply.  I may still be able to use WTP with JBoss (it seems to work with my directory structure) and maybe Tomcat as an external server. \n\nI realize that tools like WTP are very complex to develop and maintain. But I hope WTP becomes more flexible in the future and supports Standard Web Application Directory Structure (the one shown in \u0027Programming Jakarta STRUTS\u0027 book) because repositories seem to want to populate the same directory structure as theirs for sandboxes and checkin/checkout. So it seems to me that a given repository project ends up being directly compatible only with a specific tool such as WTP (Web Root is \u0027WebContent\u0027) or MyEclipse (Web Root default is \u0027WebRoot\u0027). \n\nMyEclipse allows you to specify the Web Root folder (and source) path for new projects under \u0027preferences\u0027 and allows \u0027/\u0027 (default is \u0027WebRoot\u0027), so in that sense it\u0027s more flexible. But it doesn\u0027t allow you to run Tomcat locally like WTP and that probably made it more feasible to allow the Web Root folder to be configurable.\n\n(In reply to comment #4)\n\u003e Hi Aaron,\n\u003e Thanks for your response, it seems likely that the creation of the\n\u003e \"tmp0\\webapps\\CredCriteria\" may depend on copying something under that\n\u003e directory.  By moving the META-INF and WEB-INF out from under \"WebContent\", you\n\u003e may have left the publish operation nothing to copy, and no \"CredCriteria\"\n\u003e directory was created.\n\u003e WTP doesn\u0027t really support this kind of customization of a Dynamic Web project.\n\u003e  The \"WebContent\" is there to separate the content portion of the webapp from\n\u003e the project\u0027s metadata, among other things.  By moving the META-INF and WEB-INF\n\u003e into the root of your project, you have effectively moved resources like\n\u003e \".project\", \".classpath\", and the \".settings\" folder into your webapp.  I\u0027m not\n\u003e sure what you would get if you tried to export this project with WTP\u0027s Export\n\u003e -\u003e WAR file.\n\u003e I\u0027m not familiar with MyEclipse, but it and I think the Sysdeo Tomcat plug-in\n\u003e would probably be happier with you current project structure that WTP is.  I\n\u003e also don\u0027t know MKS, to say if there is a practical way to use it and keep\n\u003e WTP\u0027s preferred project structure.\n\u003e Since this is due to unsupported modifications to the project format, I\u0027m\n\u003e marking this bug INVALID.\n\u003e I assume that the Java source for this project is found found under the\n\u003e WEB-INF/classes folder of the project.  If this is the case, I unfortunately\n\u003e haven\u0027t yet found a way allow the project to be fetched into the WebContent\n\u003e folder of a Dynamic Web Project and manually reconfigure the project so that it\n\u003e works with exporting as a WAR file.  Assuming WTP 1.5.x, publishing to a server\n\u003e can be made to work by removing the \u003cweb-resource\u003e element from the\n\u003e \".settings/org.eclipse.wst.common.component\" file that has the deploy-path set\n\u003e to \"/WEB-INF/classes\".  Then in the \".classpath\" file, replace the\n\u003e \"\u003cclasspathentry kind\u003d\"src\" path\u003d\"src\"/\u003e\" entry with:\n\u003e \u003cclasspathentry excluding\u003d\"*.class\" kind\u003d\"src\"\n\u003e    output\u003d\"WebContent/WEB-INF/classes\" path\u003d\"WebContent/WEB-INF/classes\"/\u003e\n\u003e This approach has the advantage of not including all of the project overhead\n\u003e files in the webapp.  A custom Ant build could be created to create the WAR\n\u003e file.\n\n",
    "Closing as part of mass query to clean up old resolved bugs in untargetted milestones."
  ],
  "commentCreationDates": [
    "2007-03-07T15:51:45+01:00",
    "2007-03-07T19:05:38+01:00",
    "2007-03-07T19:58:21+01:00",
    "2007-03-08T17:16:16+01:00",
    "2007-03-09T20:17:03+01:00",
    "2007-03-12T17:55:45+01:00",
    "2007-04-03T17:47:46+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.IllegalArgumentException",
      "message": "Document base C:\\eclipse 3.2 Web workspace\\.metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\webapps\\CredCriteria does not exist or is not a readable directory",
      "elements": [
        {
          "method": "org.apache.naming.resources.FileDirContext.setDocBase",
          "source": "FileDirContext.java:185"
        },
        {
          "method": "org.apache.catalina.core.StandardContext.resourcesStart",
          "source": "StandardContext.java:3858"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "176616",
      "date": "2007-03-07T15:51:45+01:00",
      "product": "Web Tools",
      "component": "jst.server",
      "severity": "minor"
    }
  ],
  "groupId": "176616",
  "bugId": "176616",
  "date": "2007-03-07T15:51:45+01:00",
  "product": "Web Tools",
  "component": "jst.server",
  "severity": "minor"
}