{
  "comments": [
    "Build ID: M6\n\nSteps To Reproduce:\n1.Create a new Connection Profile (SQL Model) in the DataSource Explorer and connect to the Database. Everything\u0027s fine, you can browse the Schema.\n2. Relaunch Eclipse\n3. Connecting to the database works, but the Schema can\u0027t be \ndisplayed anymore.\n\nMore information:\nThe following error appears when connecting to the database:\n\nError creating SQL Model Connection connection to test2. (Error: null)\n\njava.lang.NullPointerException\n\tat org.eclipse.datatools.connectivity.sqm.internal.core.util.DatabaseProviderHelper.getCatalogDatabase(DatabaseProviderHelper.java:37)\n\tat org.eclipse.datatools.connectivity.sqm.internal.core.util.DatabaseProviderHelper.setDatabase(DatabaseProviderHelper.java:46)\n\tat org.eclipse.datatools.connectivity.sqm.internal.core.connection.ConnectionInfoImpl.\u003cinit\u003e(ConnectionInfoImpl.java:628)\n\tat org.eclipse.datatools.connectivity.sqm.internal.core.connection.ConnectionFactory.createConnection(ConnectionFactory.java:36)\n\tat org.eclipse.datatools.connectivity.sqm.core.SQMConnectionFactory.createConnection(SQMConnectionFactory.java:45)\n\tat org.eclipse.datatools.connectivity.internal.ConnectionFactoryAdapterProvider.createConnection(ConnectionFactoryAdapterProvider.java:79)\n\tat org.eclipse.datatools.connectivity.internal.CreateConnectionJob.run(CreateConnectionJob.java:55)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:58)",
    "Michael:\n\nI tried this in the DTP 1.5 4/9 and couldn\u0027t repro. Connected to PostgreSQL 8.1.2, DSE tree OK, close connection, relaunch Eclipse, connect, and everything\u0027s still fine. Next, tried connecting to PostgreSQL 8.1.2, DSE tree OK, close Eclipse without closing connection, relaunch, connect, DSE tree still OK.\n\nCould you provide some more details about the DB that you are connecting to, your OS, and so on?\n\nThanks",
    "Hey John,\n\nMy guess is that this is a problem with the way the connection profile is configured.  If an extender fails to include the database vendor and version properties, the ConnectionInfoImpl can\u0027t find the DB definition, which is probably what is causing this error.  Not sure why it works once.  Just a guess.\n\nRob\n",
    "Hi John,\n\nI\u0027m using a MySQL 5.1 database. I tried both the recent 3.1.14 and 5.0.5 JDBC connectors with the standard Driver class. It\u0027s all the same, I even tried a fresh workspace just to be sure.. The Drivers are configured under MySQL 4.1 (whatever that 4.1 means) in the Connectivity Preferences.\nWhen the problem shows and I change the driver from the drop down list in the JDBC Connection Properties (Data Source Explorer -\u003e Database -\u003e Properties) everything\u0027s fine again (including connecting/disconnecting/reconnecting) - until the next restart of Eclipse.\n\nThe other thing I should also mention is, I\u0027m using the M6 Eclipse build on Linux/GTK2(x86_64).",
    "Hi John,\n\nthere\u0027s news here. I tried the same thing with a PostgreSQL database and it worked like a charm, as long as the new Connection Profile had been chosen from the \"PostgreSQL JDBC Connection\". However, as soon as you create a new connection from an \"SQL Model JDBC Connection\", either to a MySQL or a PostgreSQL database, things mess up like previously mentioned; note, it does so with every(!) profile, even those that used to work before the addition of the \"SQL Model JDBC Connection\".\nDeleting the latter does not solve the problem with the other profiles though, in the sequel they still show that corrupted behaviour.\n\nHope I could help\n",
    "Michael:\n\nWhen DTP 1.5RC0 is available (target: 5/11), please retest this for MySQL. I saw the same problems, but they appear to be fixed with the recent updates of the MySQL driver templates and db definition files.",
    "(In reply to comment #5)\n\nHallo John,\n\nunfortunately RC0 didn\u0027t fix things, however, it changed them.\nDespite showing only the catalog given in the URL of the connection profile, one can actually see all those that are available in the database. For each of those catalogs the next thing to see is the \"Schemas\" folder, but with nothing in it.\nAlso, no exceptions are thrown anymore.\nIt still applies that when the connection profile is new it works just fine, until you restart eclipse.\n",
    "Hey Michael,\n\nCould you please provide a set of detailed steps to reproduce this problem?\n\nThanks in advance,\nRob\n",
    "Hey Rob,\n\nit\u0027s quite simple. I create a new Connection Profile, one time with a MySQL server and the other time I do the exact same thing with a PostgreSQL server. In the latter case everything works as you would expect, in the first case it does so too but only as long as you don\u0027t close and reopen eclipse. It really is just an issue with MySQL, or let\u0027s say it doesn\u0027t happen with PostgreSQL.\nTo clearify what the problem looks like on the screen I\u0027ll attach a little file.\n\nbye M;chi",
    "Created an attachment (id\u003d67274)\nView of Data Source Explorer\n\nfor the first connection the \"amarok\" schema had been specified in the connection URL, but instead I get a complete list with nothing in it though.\nFor postgres it just works, as you can see",
    "Will continue to look at this post 1.5. Might need Enablement support for MySQL...",
    "(In reply to comment #10)\nHello,\nI encountered this problem too with MySQL. The problem always appears if i have unchecked save password in the connection profile. So I have to click to connect, give the password and after that I see the connection described before with catalog and schema but no tables. Editing the connection profile doesn\u0027t help in my case, so I have to recreate the profile and check save password and everything is fine.\n\nMark\n\n"
  ],
  "commentCreationDates": [
    "2007-03-31T18:31:31+02:00",
    "2007-04-09T17:26:06+02:00",
    "2007-04-09T18:53:56+02:00",
    "2007-04-09T19:13:09+02:00",
    "2007-04-14T19:04:29+02:00",
    "2007-05-10T19:27:29+02:00",
    "2007-05-14T07:33:59+02:00",
    "2007-05-15T17:26:11+02:00",
    "2007-05-15T18:49:06+02:00",
    "2007-05-15T18:53:26+02:00",
    "2007-06-14T23:58:17+02:00",
    "2007-12-05T12:50:32+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.datatools.connectivity.sqm.internal.core.util.DatabaseProviderHelper.getCatalogDatabase",
          "source": "DatabaseProviderHelper.java:37"
        },
        {
          "method": "org.eclipse.datatools.connectivity.sqm.internal.core.util.DatabaseProviderHelper.setDatabase",
          "source": "DatabaseProviderHelper.java:46"
        },
        {
          "method": "org.eclipse.datatools.connectivity.sqm.internal.core.connection.ConnectionInfoImpl.\u003cinit\u003e",
          "source": "ConnectionInfoImpl.java:628"
        },
        {
          "method": "org.eclipse.datatools.connectivity.sqm.internal.core.connection.ConnectionFactory.createConnection",
          "source": "ConnectionFactory.java:36"
        },
        {
          "method": "org.eclipse.datatools.connectivity.sqm.core.SQMConnectionFactory.createConnection",
          "source": "SQMConnectionFactory.java:45"
        },
        {
          "method": "org.eclipse.datatools.connectivity.internal.ConnectionFactoryAdapterProvider.createConnection",
          "source": "ConnectionFactoryAdapterProvider.java:79"
        },
        {
          "method": "org.eclipse.datatools.connectivity.internal.CreateConnectionJob.run",
          "source": "CreateConnectionJob.java:55"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:58"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "180356",
      "date": "2007-03-31T18:31:31+02:00",
      "product": "Data Tools",
      "component": "Data Source Explorer",
      "severity": "normal"
    }
  ],
  "groupId": "180356",
  "bugId": "180356",
  "date": "2007-03-31T18:31:31+02:00",
  "product": "Data Tools",
  "component": "Data Source Explorer",
  "severity": "normal"
}