{
  "comments": [
    "With the 04/26 WTP 2.0 driver, if I purposely do not install the Axis2 runtime and tried to go through an Axis2 Web service scenario. Here\u0027s what I get:\n\n1. For bottom-up, the wizard finished but nothing was generated.\n\n2. For top-down and for client, the Axis2 configuration page is empty and I got:\n\nException occured while code generation the wsdl\n    java.lang.NullPointerException\n    at org.eclipse.jst.ws.axis2.consumption.core.utils.WSDL2JavaGenerator.getAxisService(WSDL2JavaGenerator.java:355)\n    at org.eclipse.jst.ws.axis2.creation.core.command.Axis2WSDL2JavaCommand.execute(Axis2WSDL2JavaCommand.java:72)\n\nSince the Web services tools users are not familiar with this requirement to install Axis2 runtime first before going through any Axis2 Web service scenario, they should be shown a meaningful error message to point them exactly to what to do.",
    "This is not exist in the integration build. 20070426 from\nhttp://download.eclipse.org/webtools/downloads/drops/R2.0/I-I200704261031-200704261031/\n \nI have committed the fix for this with the previous 6 patches that I have attached. \n\nNow that its automatically install the Axis2 Facet if the web service creation/consumption is invoked if the selected runtime as Axis2. \n\nThanks \n\nLahiru",
    "With the fix for bug 180284, if the Axis2 install location is not set, the error the user is getting is:\n\nUnable to add the follwing facets to project a1: Axis2 Web Services Extensions, Axis2 Web Services Core.\n    org.eclipse.core.runtime.CoreException: Failed while installing Axis2 Web Services Core 1.1.\n    at org.eclipse.wst.common.project.facet.core.internal.FacetedProject.callDelegate(FacetedProject.java:1253)\n    at org.eclipse.wst.common.project.facet.core.internal.FacetedProject.modifyInternal(FacetedProject.java:415)\n    at org.eclipse.wst.common.project.facet.core.internal.FacetedProject.access$2(FacetedProject.java:288)\n    at org.eclipse.wst.common.project.facet.core.internal.FacetedProject$1.run(FacetedProject.java:270)\n    at org.eclipse.core.internal.resources.Workspace.run(Workspace.java:1797)\n    at org.eclipse.wst.common.project.facet.core.internal.FacetedProject.modify(FacetedProject.java:280)\n    at org.eclipse.jst.ws.internal.consumption.common.FacetUtils$1.run(FacetUtils.java:744)\n    at org.eclipse.jface.operation.ModalContext$ModalContextThread.run(ModalContext.java:113)\n    org.eclipse.core.runtime.CoreException[0]: org.eclipse.core.runtime.CoreException: Axis2 runtime is not set at web services preferences page!! Please set the web services runtime by navigating through preferences.\n    at org.eclipse.jst.ws.axis2.facet.deligate.Axis2CoreFacetInstallDelegate.execute(Axis2CoreFacetInstallDelegate.java:46)\n    at org.eclipse.wst.common.project.facet.core.internal.FacetedProject.callDelegate(FacetedProject.java:1224)\n\nNote that the message:\n\nAxis2 runtime is not set at web services preferences page!! Please set the web services runtime by navigating through preferences.\n\nis embedded but not very prominent (since it\u0027s in the middle of the stack trace).  It would help if the user is given more precise error at the beginning of the error message.\n\nAlso, the message should be more specific about the problem and what to do:\n\nAxis2 facet cannot be installed since the Axis2 runtime location has not been set at the Web Services preference page.  Please set the Axis2 runtime location using the preference.",
    "Moving to RC0 since it involves properties file change.",
    "Created an attachment (id\u003d66296)\nGraphical Error Message For the user at the point Axis2 Facet Fails\n\nHi Kathy , \n\nThis comment is regarding the stack trace that you have made earlier. \nThe actual error message is coming at the middle of the, Since I have used the Graphical Error Message Window to show the error message to the user. \n\nSince the Dynamic project creation fails because of the facet, the project trace comes before and the cause facet message comes after that at the stack trace. \n\nBut I believe rather than the stack trace, we have to consider graphical feedback on the user about the error message. \n\nI have attach the error message box \n\nthanks \n\nLahiru ",
    "Created an attachment (id\u003d66297)\nfix for the bug 184450 (error message)\n\nIf the graphical error was prominent and agreed on my previous comment, \nattaching the patch . \n\nthanks \n\nLahiru ",
    "Hi Lahiru, \n\nI\u0027m still getting the whole stack trace with the error message imbedded.  I found this hard for the user to pin-point the cause of the problem.  The message dialog you attached only have the error message text, not the stack trace.  I think that\u0027s the better approach.\n\nYour patch only included the updated error message but no code change.  I suspect you had forgotten to attach the code fix.\n\nAlso, I think the properties String ERROR_SERVER_IS_NOT_SET would be more clear if worded something like:\n\nThe Axis2 facets cannot be installed since the Axis2 runtime location has not been set.  \\nPlease go to the Web Services preference page and set the Axis2 runtime location under Axis2 Preferences.",
    "Patch reviewed.  I\u0027ve changed the wording to what I proposed in comment #6 and ommitted to HEAD.  I\u0027ve also released it to WTP 2.0 as v200705092115. \n\nHowever, I\u0027m not resolving the defect yet since I\u0027m still getting the complete stack trace in the error dialog, which has the error message about Axis2 runtime not installed in the middle of it.\n\nLahiru has problem reproducing that problem.  He\u0027s getting just a simple message in the error dialog without the stack trace.\n\nBy CC:  Andrew, could you please give it a try?",
    "I am testing all this on both windows and linux with the integration build 20070505 with Suns JDK 1.5. Kathy was on a slightly older build as I heard. \n\nAndrew can you post the information what you have. ",
    "Hi Lahiru,\n\nI also see the long stack trace that Kathy saw (comment #2).  I see this in BU, TD, and Client scenarios.\n\nThe steps I took are:\n1) Using a new workspace, without loading any axis2 runtime.\n2) Create a Dynamic Web Project without adding the axis2 facet.\n3) Go thru BU/TD/Client scenario on that project and axis2 runtime selected on the first page.",
    "Hi Andrew, \n\nThanks for your reply,\nIn patch I have fixed the error message that was coming before the steps invoking the web services. i.e. at the creation of the facet when the Axis2 runtime is not set at the preferences. Will fix this ASAP. \n\nThanks \n\nLahiru ",
    "Hi Kathy/Andrew\n\nIn my Axis2 facet I have Axis2CoreFacetInstallDelegate to install the facet and since because of it implements the IDelegate the execute method signature follows, \n\n   void execute( IProject project,\n                  IProjectFacetVersion fv,\n                  Object config,\n                  IProgressMonitor monitor )\n    \n        throws CoreException;\n\nSo because of this perticular scenario mean to fail as expected I have and throwing a new CoreException(status). \n\nThe point where this was caught is at the org.eclipse.wst.common.project.facet.core.internal.FacetedProject \n\nat callDelegate( final IProjectFacetVersion fv,\n                               final IDelegate delegate,\n                               final Object config,\n                               final Object context,\n                               final IProgressMonitor monitor )\n    \n        throws CoreException\n\nsince this also throws the CoreException by having the caught the previous thrown exception at the Delegate Level I assumed that if the exception there is a CoreException the callDelegate needed to check the type and throw the message of the caught exception to up rather than creating a new exception with a new status, ignoring the previous core exception status. \n\nIf this is acceptable, then the user will be able to view the error Cleanly at the start of the Error Dialog , not having to search for it. Other vice we have to find some other way.  \n\nIs there something I missed here. Shall I go ahead and attach a patch to this \n\ncc\u0027ing kosta@bea.com , \n\nKonstantin,\nPlease have a look at this, your feedback will be very valuable. \n\nThanks \n\nLahiru.    ",
    "Created an attachment (id\u003d66810)\nFix for the Bug 184450\n\nI have done minor change in the FacetProject in this patch. \nTested with some scenarios, If the arguments made at the Comment#11 reasonable, \nPlease review and commit this patch. \n\nThanks \n\nLahiru.",
    "(From update of attachment 66810)\nNo, this is not a valid change. The wrapper error message is necessary in order to provide context of which facet has failed and during which action.\n\nThrowing an exception from a facet action delegate execution is not a good way to signal an expected condition. These exceptions are treated as software failures.\n\nTo signal an expected error condition that can happen due to something that user does (or doesn\u0027t do), you want to use IActionConfig interface (if you don\u0027t already have a config object, likely if you don\u0027t have a wizard page for this facet, you will need to implement one and register a factory that will create it with the facet action extension). The IActionConfig interface has a validate() method that returns an IStatus. This is where you would put your logic. The validate methods for actions get called before any delegates are invoked.\n\nI think eventually for best user experience, you will want to create a wizard page for this facet action that allows the user to specify the necessary configuration and can block the wizard completion if necessary.",
    "Since having to install Axis2 runtime is new to most users of the current Web services tools, the more we could help the user understand what they have to do, the better.  So I agree that the best approach is to have the Axis2 runtime install page show up as a wizard page when the user is trying to install the Axis2 facet.  Please keep in mind that we also need to handle the case when the Web services wizard automatically add the Axis2 facet for the user.  I assume the the IActionConfig validate() method would be called whenever a facet is added (not only when it\u0027s done through the \"Add facets\" wizard).",
    "The IActionConfig.validate() methods get called as part of validating input to IFacetedProject.modify() method, so yes they will get called no matter what UI you use.",
    "(In reply to comment #13)\n\u003e (From update of attachment 66810 [details])\n\u003e No, this is not a valid change. The wrapper error message is necessary in order\n\u003e to provide context of which facet has failed and during which action.\n\u003e \n\u003e Throwing an exception from a facet action delegate execution is not a good way\n\u003e to signal an expected condition. These exceptions are treated as software\n\u003e failures.\n\u003e \n\u003e To signal an expected error condition that can happen due to something that\n\u003e user does (or doesn\u0027t do), you want to use IActionConfig interface (if you\n\u003e don\u0027t already have a config object, likely if you don\u0027t have a wizard page for\n\u003e this facet, you will need to implement one and register a factory that will\n\u003e create it with the facet action extension). The IActionConfig interface has a\n\u003e validate() method that returns an IStatus. This is where you would put your\n\u003e logic. The validate methods for actions get called before any delegates are\n\u003e invoked.\n\u003e \n\u003e I think eventually for best user experience, you will want to create a wizard\n\u003e page for this facet action that allows the user to specify the necessary\n\u003e configuration and can block the wizard completion if necessary.\n\nYes, this cleared my mind, of having the action deligate is not feasible to do in the framework. Since I believe this is in the path of user interaction with the wizards, we need control over that and will be feasible to include additional page to the wizard to get control and then validate accordingly with the resulted status of the user actions. \n\nThanks Konstantin for the sharing the underneath information regarding this. \n\nI ll invalidate the previous patch and follow the agreed solution to include a additional step to the wizard and apply a patch. \n\nThanks \n\nLahiru\n\n",
    "Retargetting to RC1.",
    "Created an attachment (id\u003d67948)\nFix for the Bug 184450\n\nKathy, \n\nThis is a fix that i came up, that will cover a sub scenario of the issue, which we can improve. Currently this only applies for the BU scenario as a proof of concept. If all agrees on the solution, then we can introduce this to TD and client. We can reuse most of the code that was included here and simply implement them for the other two scenarios. \n\nThe sub scenario is that user getting the preferences change to point to a wrong location of Axis2 runtime and then invoke BU scenario. \n\ndown the road to the final fix, if needed we can get this page appear based on the runtime being Axis2 and preferences not set case at the web services scenarios. \n\nI have test with all scenarios and all test passed in the process. \n\nThoughts?\n\nPlease review and commit. \n\nThank s\n\nLahiru",
    "Problem:\nUser accidentally may remove or set a wrong place to the Axis2 Runtime (Where i t was set to correct location earlier) in the middle of Axis2 Web services scenario invocation.\n\nWorkaround:\ncurrently error is Poped up . \n\nSolution:\nCheck the validity of the runtime at the middle of the Axis2 Runtime Location and then if that was not set, a page was displayed at the end of the scenario before the command will be executed to enter the valid location of the Axis2 Runtime, update that in the context and then proceed with the scenario. \n\nTesting:\nTested with valid scenarios.\n\nRisk:\nLow.  \n\nReviewed by:\n\nBringing up for PMC approval for WTP 2.0 RC1.",
    "Cannot make RC1, re-targetting to WTP 2.0 RC2.",
    "Lahiru and I discussed about this problem a bit more.  The preferred approach is not to introduce another page to the Web services wizard flow as proposed by Lahiru in comment 18 and comment 19.  For WTP 2.0, all we might have time for is for the IActionConfig interface for the facet to have a validate() method that checks to see if the Axis2 runtime is installed or not.  If it\u0027s not, then put up a concise error message.  For post WTP 2.0, you can reuse the Axis2 install runtime page to let the user enter the location when istalling the Axis2 facet and the install location is not set.",
    "Not likely to make RC2.  Targetting WTP 2.0 in general for now.",
    "Retargetting for WTP 2.0.1.",
    "*** Bug 193371 has been marked as a duplicate of this bug. ***",
    "*** Bug 198429 has been marked as a duplicate of this bug. ***",
    "Correction, bug 193371 is not a dup of this bug.  I did a typo.\n\nFor this problem, we should not add extra page to the wizard, it should at least put up error message right when Axis2 facet is selected.  For WTP 3.0, it should bring the user to the Axis2 runtime install page so that they could fill in the location.",
    "Running out of time for WTP 2.0.1.  Re-targetting to WTP 2.0.2.",
    "When the Axis2 runtime has not been installed, the error I got with WTP 2.0.1 is:\n\nException occurred while reading or writing file {0}The Axis2 facets cannot be installed since the Axis2 runtime location has not been set.  \nPlease go to the Web Services preference page and set the Axis2 runtime location under Axis2 Preferences.",
    "*** Bug 206351 has been marked as a duplicate of this bug. ***"
  ],
  "commentCreationDates": [
    "2007-04-27T17:16:38+02:00",
    "2007-04-30T15:34:59+02:00",
    "2007-05-01T18:53:40+02:00",
    "2007-05-08T15:50:25+02:00",
    "2007-05-08T16:57:00+02:00",
    "2007-05-08T17:00:29+02:00",
    "2007-05-08T19:45:28+02:00",
    "2007-05-09T23:20:00+02:00",
    "2007-05-10T07:07:44+02:00",
    "2007-05-10T19:28:24+02:00",
    "2007-05-10T20:30:01+02:00",
    "2007-05-11T06:35:22+02:00",
    "2007-05-11T08:04:38+02:00",
    "2007-05-11T15:20:23+02:00",
    "2007-05-11T16:09:43+02:00",
    "2007-05-11T16:27:19+02:00",
    "2007-05-11T17:35:23+02:00",
    "2007-05-17T16:20:00+02:00",
    "2007-05-21T10:45:53+02:00",
    "2007-05-23T07:23:48+02:00",
    "2007-05-23T21:39:38+02:00",
    "2007-05-25T21:02:55+02:00",
    "2007-05-31T22:39:47+02:00",
    "2007-06-01T22:52:35+02:00",
    "2007-08-15T20:44:51+02:00",
    "2007-08-17T20:54:28+02:00",
    "2007-08-17T20:55:35+02:00",
    "2007-09-10T19:42:50+02:00",
    "2007-10-02T20:10:01+02:00",
    "2007-10-15T18:58:58+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.jst.ws.axis2.consumption.core.utils.WSDL2JavaGenerator.getAxisService",
          "source": "WSDL2JavaGenerator.java:355"
        },
        {
          "method": "org.eclipse.jst.ws.axis2.creation.core.command.Axis2WSDL2JavaCommand.execute",
          "source": "Axis2WSDL2JavaCommand.java:72"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "184450",
      "date": "2007-04-27T17:16:38+02:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "normal"
    },
    {
      "exceptionType": "org.eclipse.core.runtime.CoreException",
      "message": "Failed while installing Axis2 Web Services Core 1.1.",
      "elements": [
        {
          "method": "org.eclipse.wst.common.project.facet.core.internal.FacetedProject.callDelegate",
          "source": "FacetedProject.java:1253"
        },
        {
          "method": "org.eclipse.wst.common.project.facet.core.internal.FacetedProject.modifyInternal",
          "source": "FacetedProject.java:415"
        },
        {
          "method": "org.eclipse.wst.common.project.facet.core.internal.FacetedProject.access$2",
          "source": "FacetedProject.java:288"
        },
        {
          "method": "org.eclipse.wst.common.project.facet.core.internal.FacetedProject$1.run",
          "source": "FacetedProject.java:270"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.run",
          "source": "Workspace.java:1797"
        },
        {
          "method": "org.eclipse.wst.common.project.facet.core.internal.FacetedProject.modify",
          "source": "FacetedProject.java:280"
        },
        {
          "method": "org.eclipse.jst.ws.internal.consumption.common.FacetUtils$1.run",
          "source": "FacetUtils.java:744"
        },
        {
          "method": "org.eclipse.jface.operation.ModalContext$ModalContextThread.run",
          "source": "ModalContext.java:113"
        }
      ],
      "number": 1,
      "commentIndex": 2,
      "bugId": "184450",
      "date": "2007-05-01T18:53:40+02:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "normal"
    },
    {
      "exceptionType": "org.eclipse.core.runtime.CoreException",
      "message": "Axis2 runtime is not set at web services preferences page!! Please set the web services runtime by navigating through preferences.",
      "elements": [
        {
          "method": "org.eclipse.jst.ws.axis2.facet.deligate.Axis2CoreFacetInstallDelegate.execute",
          "source": "Axis2CoreFacetInstallDelegate.java:46"
        },
        {
          "method": "org.eclipse.wst.common.project.facet.core.internal.FacetedProject.callDelegate",
          "source": "FacetedProject.java:1224"
        }
      ],
      "number": 2,
      "commentIndex": 2,
      "bugId": "184450",
      "date": "2007-05-01T18:53:40+02:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "normal"
    }
  ],
  "groupId": "184450",
  "bugId": "184450",
  "date": "2007-04-27T17:16:38+02:00",
  "product": "Web Tools",
  "component": "jst.ws",
  "severity": "normal"
}