{
  "comments": [
    "I created an axis2 web service which is started on a tomcat 5.5 server.  I then try to delete the project containing the web service but I run into an error saying the jars in the project are locked and cannot be deleted (message included below).  This happens even if I stop the server and remove the project from the server first.\n\nProblems encountered while deleting resources.\n  Could not delete \u0027/TD\u0027.\n    Problems encountered while deleting resources.\n      Problems encountered while deleting files.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\activation-1.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\annogen-0.1.0.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axiom-api-1.2.4.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axiom-dom-1.2.4.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axiom-impl-1.2.4.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-adb-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-adb-codegen-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-codegen-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-fastinfoset-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-java2wsdl-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jaxbri-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jaxws-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jaxws-api-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jibx-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-json-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-kernel-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-metadata-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-saaj-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-saaj-api-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-soapmonitor-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-spring-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-xmlbeans-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\backport-util-concurrent-2.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-codec-1.3.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-fileupload-1.1.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-httpclient-3.0.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-io-1.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-logging-1.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\jakarta-httpcore-4.0-alpha4.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\jaxen-1.1-beta-10.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\jibx-run-1.1.4.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\mail-1.4.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\neethi-2.0.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-beans-1.2.8.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-context-1.2.8.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-core-1.2.8.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-web-1.2.8.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\stax-api-1.0.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\woden-1.0-incubating-M7a.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\wsdl4j-1.6.2.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\wstx-asl-3.2.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xalan-2.7.0.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xbean-2.2.0.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xercesImpl-2.8.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xml-apis-1.3.03.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\XmlSchema-1.3.1.jar.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent.\n        Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD.\n    Problems encountered while deleting files.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\activation-1.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\annogen-0.1.0.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axiom-api-1.2.4.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axiom-dom-1.2.4.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axiom-impl-1.2.4.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-adb-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-adb-codegen-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-codegen-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-fastinfoset-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-java2wsdl-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jaxbri-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jaxws-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jaxws-api-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-jibx-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-json-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-kernel-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-metadata-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-saaj-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-saaj-api-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-soapmonitor-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-spring-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\axis2-xmlbeans-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\backport-util-concurrent-2.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-codec-1.3.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-fileupload-1.1.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-httpclient-3.0.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-io-1.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\commons-logging-1.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\jakarta-httpcore-4.0-alpha4.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\jaxen-1.1-beta-10.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\jibx-run-1.1.4.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\mail-1.4.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\neethi-2.0.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-beans-1.2.8.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-context-1.2.8.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-core-1.2.8.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\spring-web-1.2.8.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\stax-api-1.0.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\woden-1.0-incubating-M7a.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\wsdl4j-1.6.2.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\wstx-asl-3.2.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xalan-2.7.0.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xbean-2.2.0.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xercesImpl-2.8.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\xml-apis-1.3.03.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib\\XmlSchema-1.3.1.jar.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF\\lib.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent\\WEB-INF.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD\\WebContent.\n      Could not delete: D:\\WTP\\workspaces\\workspace-axis2\\TD.",
    "I was unable to reproduce the problem. \n\nEnvironment \n* J2EE Perspective. \n* Tomcat 5.5.17\n\nSteps\n1) created a Dynamic Web Project pointing to Axis2 runtime \n2) created bottom-up/Top-down service plus a client too\n3) Sevlet container is started in the above setp\n4) Click on the project and delete that (both ways remove from file system also/not )\n5) Project was successfully deleted and sevlet container sync automatically after that\n\nI believe if this happen because of the version of the servlet container then this is a jst.server issue. \n\nPlease give your feedback/comments....\n\nThanks \n\nLahiru \n\n",
    "Hi Andrew/Kathy, \n\nAny updates on this issue. \nWith the steps Andrew have mentioned and also trying to do some additional steps, I could not recreate the issue. \n\nIf this is not an issue any more please mark this as resolved. \n\nThanks\n\nLahiru ",
    "Hi Lahiru,\n\nI\u0027ve tried Tomcat 5.5.12 and can reproduce the problem everytime.\n\nAndrew, could you please try the latest Tomcat 5.5 (Lahiru was using 5.5.17) and see if the problem is still there.",
    "If the the difference is Servlet Container - Tomcat running on Windows and Tomcat Running on Linux causing the bug is not reprodusable. Thinking what will be the state of this issue.\n\nIf so then the problem should be common to any Dynamic Web Project with a library. \n\n I ll confirm on this by testing on windows. \n\nThanks   \n\nLahiru",
    "No.  This problem does not occur with Axis 1.4 which also adds JARs to the WEB-INF/lib directory of the dynamic Web project.  BTW, Andrew was using Tomcat 5.5.20.  So it\u0027s unlikely the version of Tomcat that\u0027s causing the problem.  You were not able to reproduce it probably because you are on Linux and we were on Windows.",
    "I have tested with the 20070505 integration build on windows, and the issue can be reprodused there. Kathy as you have suggested lets have the feedback from some WTP  community on this to understand the issue more. Please update when you have any information information.   ",
    "By CC:  Tim and Larry, do you have any idea why deleting a Web project containing the Axis2 servlet would cause \"Problem while deleting resources\"?  \n\nThe problem actually shows up by just adding the Axis2 servlet on Tomcat (without having to go through creation of Web service).  Here\u0027s how to reproduce it with WTP 2.0 driver (say the 20070510 driver):\n\n1. Go to http://ws.apache.org/axis2/download/1_2/download.cgi to download Axis2 v1.2 binary distribution.\n2. Unzip the Axis2 v1.2 binary distribution (say to d:\\axis2).\n3. Go to Preference -\u003e Web Services -\u003e Axis2 Preferences.  In the Axis2 Runtime tab, browse to d:\\axis2.  Click Apply.\n4. Go to Server -\u003e Install runtime to install Tomcat 5.5.\n5. New -\u003e Dynamic Web project.  Type in the name of the Web project \"a2\", click Next and select the Axis2 facet.\n6. Add project \"a2\" to the Tomcat server. Then start the server.\n7. Try deleting the \"a2\" project would result in error in deleting resources.\n\n",
    "On Windows, Sun\u0027s (and maybe others) JRE jar handling locks the jar files until the jar object actually gets garbage collected.  This means Tomcat must be stopped before these files can be removed from the server.  WTP doesn\u0027t currently include handling to do this automatically.  For publishing to a running server, we worked around this locking issue by rewriting the file (I forget the bug number).",
    "Sorry, didn\u0027t read the original report closely enough. Stopping the server allows me to delete the project in my test case on Windows with a Sun JDK.  \n\nAndrew,\n\nI\u0027m not sure why the jars were still locked after the server was stopped in your scenario.  Are you able to reproduce this behavior?  If so, in the server configuration, are either of the \"Serve modules without publishing\" or \"Publish modules to separate XML files\" checked for this server?  Also, were there any errors reported when the server was stopped?  Thanks.\n\nLarry",
    "I\u0027ve re-tried this scenario using a newer build (I200705090547).  Now if I stop the server first, I *do not* get the error.\n\nBut the error still occurs if the server is running, so this still needs to be investigated since it only happens for axis2 project.\n\nLarry, not sure if this still matters, but none of the options you mentioned are checked in my server config.",
    "(In reply to comment #10)\n\u003e I\u0027ve re-tried this scenario using a newer build (I200705090547).  Now if I stop\n\u003e the server first, I *do not* get the error.\n\u003e \n\u003e But the error still occurs if the server is running, so this still needs to be\n\u003e investigated since it only happens for axis2 project.\n\u003e \n\u003e Larry, not sure if this still matters, but none of the options you mentioned\n\u003e are checked in my server config.\n\nHi Andrew/Larry, \n\nThis is the exact same status of the issues that I have reproduced in windows.\nOkey its not about a one jar that we are talking about, all the jars are locked in :(\n\nThanks \n\nLahiru",
    "If \"Serve modules without publishing\" had been checked and the server JVM failed to exit for some reason, then it\u0027s conceivable that the project\u0027s jars would have been locked due to a server related problem. That\u0027s the only way I can envision that problems deleting project jars would be due to a server problem.\n\nAndrew,\n\nI assume with the newer version, when you get the errors because Tomcat is still running, the jars that can\u0027t be deleted aren\u0027t the project jars but the deployed jars down under the \".metadata\" directory of your workspace.  If so, this is a known issue with respect to Tomcat servers running on Windows.  \n\nI don\u0027t think server publishing is currently able to determine on the fly whether a publish operation should first stop a particular type of server if the publish contains a certain type of change, i.e. project removal. (Tim, you are welcome to comment.) Perhaps something could be done in WTP 3.0. WTP 2.0, it is currently necessary to stop the Tomcat server on Windows before publishing a change that removes a project from the server.\n\n",
    "(In reply to comment #12)\n\u003e If \"Serve modules without publishing\" had been checked and the server JVM\n\u003e failed to exit for some reason, then it\u0027s conceivable that the project\u0027s jars\n\u003e would have been locked due to a server related problem. That\u0027s the only way I\n\u003e can envision that problems deleting project jars would be due to a server\n\u003e problem.\n\nI found this on the Tomcat 5.5 documents, there is a attribute that we can configure in the $TOMCAT_HOME/conf/context.xml as \n\nantiJARLocking\t\n\nIf true, the Tomcat classloader will take extra measures to avoid JAR file locking when resources are accessed inside JARs through URLs. This will impact startup time of applications, but could prove to be useful on platforms or configurations where file locking can occur. If not specified, the default value is false\n\nThe default value is false in this on 5.5 server. \n\n\u003e \n\u003e Andrew,\n\u003e \n\u003e I assume with the newer version, when you get the errors because Tomcat is\n\u003e still running, the jars that can\u0027t be deleted aren\u0027t the project jars but the\n\u003e deployed jars down under the \".metadata\" directory of your workspace.  If so,\n\u003e this is a known issue with respect to Tomcat servers running on Windows.  \n\u003e \nNo, I am getting the error message clearly as there is a lock for the jars which was in the project class path. \n\n\n\u003e I don\u0027t think server publishing is currently able to determine on the fly\n\u003e whether a publish operation should first stop a particular type of server if\n\u003e the publish contains a certain type of change, i.e. project removal. (Tim, you\n\u003e are welcome to comment.) Perhaps something could be done in WTP 3.0. WTP 2.0,\n\u003e it is currently necessary to stop the Tomcat server on Windows before\n\u003e publishing a change that removes a project from the server.\n\nChris, seems this is related to the server, Please have a look and reassign the bug to the related component. \n\nThanks \n\nLahiru. \n\n",
    "It\u0027s not clear exactly who is locking the project\u0027s jars.  Tomcat should only be locking the deployed jars.  What might be helpful would be a zip of a simple workspace has this problem.  It should include the \"Axis2\" and Servers project plus the \".metadata\\.plugins\\org.eclipse.wst.server.core\" directory and \".metadata/.log\" file, if present. Also, it would be helpful to know which JDK/JRE is being used.\n\nIt would be interesting see if the \"antiJARLocking\" attribute affects project jar locking.  It should help avoid locking of the deployed jars, but has the side effect of lengthening the startup time and will force you to restart the server before changes to dependent jars and utility projects will be visible in the server.\n\nChris, I\u0027ll go ahead and assign this bug to me while I try to investigate the Tomcat server\u0027s role in locking the project\u0027s jars.\n",
    "Hi Larry, even a simple workspace is quite big zipped (40 mb!) so I couldn\u0027t attach it to this bug.",
    "Andrew, If you left out the WEB-INF\\lib jars and axis2-web folder content of the \"Axis2\" project and the deployed webapp down under the one \".metadata\" directory, how big would it be?  I don\u0027t need your copies of those files and I would hope it would reduce the size of the zip sufficiently.\n\nAlso let me confirm, this is from a workspace that is still shows the project\u0027s jars getting locked, not the deployed copies under the \".metadata\" directory.",
    "Sorry, my workspace only shows the .metadata jar locking (I could not reproduce the original symptom).\n\nLahiru, in comment #13 you said you still get the project jars locking, if that\u0027s the case could you provide the workspace for Larry?",
    "Created an attachment (id\u003d67008)\nattaching the org.eclipse.wst.server.core\n\nsorry that my comment13 implied in that was, this is because that the UI error message was actually for the libs in the Project/WEB-INF/lib but actually the things which were locked in are the libs where org.eclipse.wst.server.core deployed libs under .metadata\nSo I am attaching that to have a look \n\nThanks \n\nLahiru",
    "Created an attachment (id\u003d67009)\nAttachig the server configuration in my workspace\n\nPlease have a look. ",
    "The two attachments only show evidence of the \"normal\" locking of the deployed jars.  The associated \"work\" directory also could not be deleted due to similar locking.\n\nLahiru, would the \".metadata/.log\" file still be available?  If so, could you attach that as well.  Thanks.\n",
    "Created an attachment (id\u003d67347)\nattaching the matadata log \n\nThanks \n\nLahiru ",
    "All of the \"Could not delete\" errors in the log except for those at the end are the \"normal\" errors you get when trying to remove a project from a running Tomcat server.  Those at the end of the are errors where the project\u0027s WebContent/WEB-INF/lib jars could not be deleted.  However, the errors occurred on 5/15, after the other attachments were added.\n\nLahiru, Do you recall what you did on 5/15 to cause those project deletion errors? Were these also related to deleting a project on a running Tomcat server?  If so, I need a new copy of the org.eclipse.wst.server.core directory.\n",
    "(In reply to comment #22)\n \n\u003e Lahiru, Do you recall what you did on 5/15 to cause those project deletion\n\u003e errors? Were these also related to deleting a project on a running Tomcat\n\u003e server?  If so, I need a new copy of the org.eclipse.wst.server.core directory.\n\nYep, I Will try to reproduce this and attach the all the items you need. \n\nThanks \n\nLahiru\n\n",
    "(In reply to comment #23)\n\u003e (In reply to comment #22)\n\u003e \n\u003e \u003e Lahiru, Do you recall what you did on 5/15 to cause those project deletion\n\u003e \u003e errors? Were these also related to deleting a project on a running Tomcat\n\u003e \u003e server?  If so, I need a new copy of the org.eclipse.wst.server.core directory.\n\u003e \n\u003e Yep, I Will try to reproduce this and attach the all the items you need. \n\u003e \n\u003e Thanks \n\u003e \n\u003e Lahiru\n\u003e  \n\nLatest results with driver 20070509,\n\nI have upgraded the Eclipse WTP to 20070509, and now I am doing testing on this deriver. Now when I try to delete a project which was deployed under Tomcat sevlet container, It will prompt the errors of locking the jar files under .metadata/.plugins [will attach the image]\n\nWhen accept the bug clicking ok, the project was removed from the Project/Package explorer. \n\nBut the project exists under the workspace and we can not create another project with the same name. \n\nthanks \n\nLahiru",
    "Is the complete project still in the workspace or just its WEB-INF/lib jars?  If the complete project, are you sure you selected the option to \"Also delete contents...\"? ",
    "(In reply to comment #25)\n\u003e Is the complete project still in the workspace or just its WEB-INF/lib jars? \n\u003e If the complete project, are you sure you selected the option to \"Also delete\n\u003e contents...\"? \n\u003e \n\nComplete Project was there. Yes with the also delete contents enabled. Otherwise I would not try to create another one with the same name.\n\nThanks \n\nLahiru",
    "Thanks.  However, having the complete project remain implies that files aren\u0027t deleted which the server handling never touches.  I\u0027m not sure how the server could be involved with those file.  Even the log only complains about being unable to delete the project\u0027s jars and their parent folders.  Thus, it\u0027s not clear to me what exactly is going on.\n\nSince I\u0027m not seeing the same behavior, there must be some detail that\u0027s different about what you are doing and/or something with respect to your environment.  The workspace name in the log file (i.e. \"runtime-New_configuration\") suggests the session may be from a development environment, where I\u0027ve been using a downloaded copy of WTP.  Can you try your tests with the latest RC0 and attach the results from that so I can be sure to test it with same driver.",
    "Targeting to WTP 2.0 in general as we haven\u0027t identified the cause for the project jar locking.  At this point, I\u0027m doubtful it is Tomcat doing the locking since \"Serve modules without publishing\" isn\u0027t being enabled. One possibility might be that the project jar locking might have something to do with validation, but that is just a blind guess.  I\u0027m not sure who else might be locking the jars.",
    "Let\u0027s target to RC4 so we don\u0027t overlook, if we need to defer we can.",
    "Given the severity and looming release, should we continue investigation but defer to 2.0.1?",
    "Deferring to WTP 2.0.1.",
    "Since the cause for project jar locking hasn\u0027t been determined, nor a way to reproduce the problem, I\u0027ll go ahead and defer to next maintenance release.  At this point, we don\u0027t have firm evidence that the problem is server related, but without more info, we can\u0027t say which component is at fault or what sequence of steps is the trigger.",
    "Since I was not able to duplicate the workspace jar locking, and no additional data has been made available, I\u0027m resolving this as WORKSFORME.  I assume the source of this problem was either transient or has been fixed.  Either way, it doesn\u0027t appear to be occurring in any 2.0.x releases.",
    "I\u0027m still seeing this problem when deleting Web projects containing Axis2 Web service that had been added to a running Tomcat server using the WTP 2.0.2 12/13 M-build.  I\u0027m getting errors such as:\n\norg.eclipse.core.runtime.CoreException: Publishing failed with multiple errors\n        at org.eclipse.jst.server.tomcat.core.internal.PublishOperation2.throwException(PublishOperation2.java:161)\n        at org.eclipse.jst.server.tomcat.core.internal.PublishOperation2.execute(PublishOperation2.java:72)\n        at org.eclipse.wst.server.core.model.ServerBehaviourDelegate.performTasks(ServerBehaviourDelegate.java:885)\n        at org.eclipse.wst.server.core.model.ServerBehaviourDelegate.publish(ServerBehaviourDelegate.java:649)\n        at org.eclipse.wst.server.core.internal.Server.doPublish(Server.java:887)\n        at org.eclipse.wst.server.core.internal.Server.publish(Server.java:874)\n        at org.eclipse.jst.ws.internal.consumption.ui.command.StartServerCommand$1.run(StartServerCommand.java:132)\n        at org.eclipse.jface.operation.ModalContext$ModalContextThread.run(ModalContext.java:113)\n!SUBENTRY 1 org.eclipse.jst.server.tomcat.core 4 0 2007-12-13 20:34:45.609\n!MESSAGE Publishing failed with multiple errors\n!SUBENTRY 2 org.eclipse.wst.server.core 4 0 2007-12-13 20:34:45.609\n!MESSAGE Could not delete D:\\wtp\\wtp202_1213\\eclipse\\workspace\\.metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\wtpwe\nbapps\\a4\\WEB-INF\\lib\\activation-1.1.jar. May be locked by another process.\n!SUBENTRY 2 org.eclipse.wst.server.core 4 0 2007-12-13 20:34:45.609\n!MESSAGE Could not delete D:\\wtp\\wtp202_1213\\eclipse\\workspace\\.metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\wtpwe\nbapps\\a4\\WEB-INF\\lib\\annogen-0.1.0.jar. May be locked by another process.\n\nAfter the error occurs, when the server tries to publish another Web project, it would fail with the same publish error.  I need to stop the server before being able to publish another project.  Is this expected?",
    "Seems its not working for me, with the 2.0.2 build of WTP. I am seeing the same error as Kathy has published. \nLahiru ",
    "Hi Kathy \u0026 Lahiru,\n\nThere have been two separate issues mentioned in this bug.  For the first and original issue, Andrew reported that a project could not be deleted from his workspace because some jars the project contained were locked for reasons unknown.  Note that the locked jar is in the \"WebContent\\WEB-INF\\lib\" folder of the \"TD\" project.  This is what I marked as WORKSFORME.\n\nThe second is a known issue that Windows tends to lock open files, and for SUN JDKs/JREs this results in jars being locked while open.  Thus, Tomcat\u0027s locking of jars while running, while undesirable, is expected behavior on Windows.  This is the case in comment #34 as shown by the locked jar being in \".metadata\\.plugins\\org.eclipse.wst.server.core\\tmp0\\wtpwe\nbapps\\a4\\WEB-INF\\lib\", which implies that Tomcat did the locking.  We solved re-publishing projects by rewriting the jar since it can\u0027t be deleted and replaced.  However, I\u0027m not aware of any workaround for removing a project from a running Tomcat server without stopping it first, other than switching to a different operating system.\n\nWTP 2.0 did introduce a feature which has the ability to combine these two issues.  The \"Serve modules without publishing\" option in the Tomcat server editor can make the jars that Tomcat locks be the ones in the project.  However, according to comment #10, this option wasn\u0027t in effect.  Without this option being enabled, why Andrew\u0027s project jars were locked remains a mystery, and the Tomcat jar locking isn\u0027t something we can do anything about in WTP.\n\nHope this clarifies things a little.  Since the Tomcat locking isn\u0027t really a WTP bug and we don\u0027t seem to be able to duplicate Andrew\u0027s original project jar locking, I figured we might as well resolve this report rather than leave it hanging.  Are either of you able to duplicate the _project_ jar locking?\n\nCheers,\nLarry"
  ],
  "commentCreationDates": [
    "2007-04-30T18:16:48+02:00",
    "2007-05-06T17:03:04+02:00",
    "2007-05-08T06:16:22+02:00",
    "2007-05-08T15:52:41+02:00",
    "2007-05-08T18:09:22+02:00",
    "2007-05-08T18:52:33+02:00",
    "2007-05-10T06:59:08+02:00",
    "2007-05-10T16:36:53+02:00",
    "2007-05-10T17:27:29+02:00",
    "2007-05-10T17:52:35+02:00",
    "2007-05-10T19:54:19+02:00",
    "2007-05-10T20:03:42+02:00",
    "2007-05-10T22:07:06+02:00",
    "2007-05-11T05:09:10+02:00",
    "2007-05-11T14:33:57+02:00",
    "2007-05-11T16:15:30+02:00",
    "2007-05-11T16:58:50+02:00",
    "2007-05-11T17:43:41+02:00",
    "2007-05-14T08:52:04+02:00",
    "2007-05-14T08:55:05+02:00",
    "2007-05-15T15:56:11+02:00",
    "2007-05-16T06:24:32+02:00",
    "2007-05-16T19:36:08+02:00",
    "2007-05-16T20:04:52+02:00",
    "2007-05-18T06:24:21+02:00",
    "2007-05-18T13:59:49+02:00",
    "2007-05-18T15:28:32+02:00",
    "2007-05-18T15:53:11+02:00",
    "2007-05-24T16:40:05+02:00",
    "2007-06-13T20:54:26+02:00",
    "2007-06-13T21:12:58+02:00",
    "2007-06-13T22:01:52+02:00",
    "2007-09-18T14:21:04+02:00",
    "2007-12-13T19:29:00+01:00",
    "2007-12-14T02:02:15+01:00",
    "2007-12-14T03:22:07+01:00",
    "2007-12-14T13:14:59+01:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.core.runtime.CoreException",
      "message": "Publishing failed with multiple errors",
      "elements": [
        {
          "method": "org.eclipse.jst.server.tomcat.core.internal.PublishOperation2.throwException",
          "source": "PublishOperation2.java:161"
        },
        {
          "method": "org.eclipse.jst.server.tomcat.core.internal.PublishOperation2.execute",
          "source": "PublishOperation2.java:72"
        },
        {
          "method": "org.eclipse.wst.server.core.model.ServerBehaviourDelegate.performTasks",
          "source": "ServerBehaviourDelegate.java:885"
        },
        {
          "method": "org.eclipse.wst.server.core.model.ServerBehaviourDelegate.publish",
          "source": "ServerBehaviourDelegate.java:649"
        },
        {
          "method": "org.eclipse.wst.server.core.internal.Server.doPublish",
          "source": "Server.java:887"
        },
        {
          "method": "org.eclipse.wst.server.core.internal.Server.publish",
          "source": "Server.java:874"
        },
        {
          "method": "org.eclipse.jst.ws.internal.consumption.ui.command.StartServerCommand$1.run",
          "source": "StartServerCommand.java:132"
        },
        {
          "method": "org.eclipse.jface.operation.ModalContext$ModalContextThread.run",
          "source": "ModalContext.java:113"
        }
      ],
      "number": 0,
      "commentIndex": 34,
      "bugId": "184727",
      "date": "2007-12-14T02:02:15+01:00",
      "product": "Web Tools",
      "component": "jst.server",
      "severity": "normal"
    }
  ],
  "groupId": "184727",
  "bugId": "184727",
  "date": "2007-04-30T18:16:48+02:00",
  "product": "Web Tools",
  "component": "jst.server",
  "severity": "normal"
}