{
  "comments": [
    "I20070430-0800\nI have not been able to reproduce this, but while testing out the new eclipsec console launcher with redirected output.  I launched an eclipse that crashed on startup.\n\nThe resulting log I got contained \njava.lang.RuntimeException: Widget disposed too early!\n\tat org.eclipse.ui.internal.WorkbenchPartReference$1.widgetDisposed(WorkbenchPartReference.java:169)\n\nSee attached log.txt for full stack trace.",
    "Created an attachment (id\u003d65694)\ncrash log\n\n",
    "It seems that the window could not be restored, and then something happened while closing it.",
    "Something happened to kill your launch.\n\nThe \"Widget disposed too early!\" just indicates that the window never came up properly (it died for some reason) and we\u0027re asking it close now.\n\nThere doesn\u0027t seem to be anything in the log that indicates what problem caused the workbench window to not open.\n\nPW\n",
    "I still haven\u0027t had time to investigate this. ",
    "Not a lot to go on here.  If you can reproduce it again please let me know.",
    "I have been able to reproduce this bug consistently by quickly clicking multiple times on the \u0027X\u0027 exit button to terminate. The only special scenario here seems to be when the viewpart has a Jface ModelContext operation running when closing itself. This results in entertaining second request for terminating eclipse and there by reaching a state where it finds the SWT composite already disposed.",
    "Hafiz, could you please attach the relevant part of your log file containing the stack trace(s)?",
    "Hafiz, please see the previous comment.",
    "I am using the Eclipse version identified in this bug report with the build ID: I20070625-1500 and receiving the widget disposed too early error message when performing certain actions within the workspace. The only message prior to this error was:\n\n!ENTRY org.eclipse.ui 4 4 2007-08-14 15:51:52.703\n!MESSAGE Unable to find Action Set: org.eclipse.jdt.ui.DLTKActionSet\n\nThe error received was:\n\n!ENTRY org.eclipse.ui.workbench 4 0 2007-08-14 15:52:29.312\n!MESSAGE Widget disposed too early!\n\nThis tends to happen frequently when several things are processing (a workspace build plus a perspective switch). The workbench hangs, then the UI disappears, followed by the eclipse process a minute or so later. When restarting the workbench, I receive the message:\n\n!ENTRY org.eclipse.core.resources 2 10035 2007-08-14 15:59:07.765\n!MESSAGE The workspace exited with unsaved changes in the previous session; refreshing workspace to recover changes.\n\nI would love to have this fixed so that I do not have to revert to 3.2."
  ],
  "commentCreationDates": [
    "2007-05-02T23:12:45+02:00",
    "2007-05-02T23:13:30+02:00",
    "2007-05-03T17:39:01+02:00",
    "2007-05-03T18:11:07+02:00",
    "2007-05-24T16:11:27+02:00",
    "2007-05-29T16:06:55+02:00",
    "2007-06-27T07:00:15+02:00",
    "2007-06-27T12:31:07+02:00",
    "2007-06-27T12:32:05+02:00",
    "2007-08-14T23:20:25+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.RuntimeException",
      "message": "Widget disposed too early!",
      "elements": [
        {
          "method": "org.eclipse.ui.internal.WorkbenchPartReference$1.widgetDisposed",
          "source": "WorkbenchPartReference.java:169"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "185232",
      "date": "2007-05-02T23:12:45+02:00",
      "product": "Platform",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "185232",
  "bugId": "185232",
  "date": "2007-05-02T23:12:45+02:00",
  "product": "Platform",
  "component": "UI",
  "severity": "normal"
}