{
  "comments": [
    "When I upgraded Mylar Task List from 0.7.0.1 to 2.0.0.v20070403, the Task List no longer loads with the error:\n\nUnable to create view: Plug-in org.eclipse.mylar.tasks.ui was unable to load class org.eclipse.mylar.internal.tasks.ui.views.TaskListView.\n\nInpecting the error log reveals:\n\n!ENTRY org.eclipse.osgi 4 0 2007-05-04 15:26:02.377\n!MESSAGE An error occurred while automatically activating bundle org.eclipse.mylar.tasks.ui (1389).\n!STACK 0\norg.osgi.framework.BundleException: Exception in org.eclipse.mylar.tasks.ui.TasksUiPlugin.start() of bundle org.eclipse.mylar.tasks.ui.\n\tat org.eclipse.osgi.framework.internal.core.BundleContextImpl.startActivator(BundleContextImpl.java:1010)\n.\n.\n.\nCaused by: java.lang.NoClassDefFoundError: org/eclipse/mylar/tasks/core/IOfflineTaskHandler\n\tat java.lang.Class.getDeclaredConstructors0(Native Method)\n\tat java.lang.Class.privateGetDeclaredConstructors(Class.java:2357)\n\n\nIf I revert to Mylar Task List 0.7.0.1, it works again.  I am trying to get the Mylar Trac Connector working, but it requires Task List 2.0, so I don\u0027t see how to proceed.\n\nI am using:\nEclipse 3.2.2.r322_v20070119\njava.vm.version\u003d1.5.0_09-b3",
    "Which Eclipse build are you using?",
    "Sorry, just noticed that are using 3.2.2.  It looks like you have a partial install, please uninstall mylar and update to the latest, making sure that all components are downloaded.  After that if the problem persists run Eclispe with -clean.  Also see: \n\nhttp://wiki.eclipse.org/index.php/Mylar_FAQ#Installation_Troubleshooting\n\nIf the problem persists please reopen the bug.",
    "(Codegear) Hi Jay.  Yes, this should be an issue submitted to CodeGear, so we can try to isolate what happened in this scenario (try http://qc.codegear.com/wc/qcmain.aspx).  Do you possibly remember what exactly got updated during your update process?  It looks like various Eclipse pieces got updated, in addition to Mylar, since JBuilder 2007 shipped with Eclipse 3.2.1, and it looks like you have version 3.2.2.  I think Mik is right that an incomplete update somehow happened, but I just want to try to replicate your scenario here.  \n\nThanks ",
    "The sequence to reproduce is: install JBuilder 2007, update all installed components using Eclipse updater, then search the Mylar update site for new features, and install the connector.  This fails as submitted previously.  I was able to get past this issue by deleting all files/folders with \"mylar\" in the name under the Eclipse plugin and workspace directories.  At that point I could install the Mylar features again, including the connector.\n\nI was able to reproduce this sequence on both Windows Vista and XP, and multiple times on Vista.\n\n(In reply to comment #3)\n\n\u003e (Codegear) Hi Jay.  Yes, this should be an issue submitted to CodeGear, so we\n\u003e can try to isolate what happened in this scenario (try\n\u003e http://qc.codegear.com/wc/qcmain.aspx).  Do you possibly remember what exactly\n\u003e got updated during your update process?  It looks like various Eclipse pieces\n\u003e got updated, in addition to Mylar, since JBuilder 2007 shipped with Eclipse\n\u003e 3.2.1, and it looks like you have version 3.2.2.  I think Mik is right that an\n\u003e incomplete update somehow happened, but I just want to try to replicate your\n\u003e scenario here.  \n\u003e Thanks \n\n",
    "Jay, it looks like the culprit is our XPlanner Mylar Connector (part of JBuilder\u0027s TeamInsight features), which was unfortunately not defined with a stringent enough dependency on a Mylar version (should have been .7 only).   If this was done properly, though, you might have gotten even more frustrated, because you probably would not have been allowed to update your Mylar at all.  As it is, you are allowed to update to a version of Mylar that the XPlanner connector is too old for, and when the Task List tries to open, it looks like all the connectors try to register themselves, and ours doesn\u0027t fare so well :-), causing further problems along the line.\nIdeally, you could turn off XPlanner Mylar Connector as a feature in your \"Manage Configuration\" dialog, but it was not defined to be turned off separately.  So, you could try the brute force method, and go to your \u003cjbuilder install dir\u003e\\jbuilder\\eclipse\\features and eclipse\\plugins directories, and remove any jars that start with com.borland.mylar.xplanner.  This will, obviously, remove any  Mylar XPlanner functionality, but it sounds like you are most interested in getting the Trac Mylar connector to work, so this should take care of your problem.\n\nLet me know if this works for you.  Sorry -- we are trying to get the dependencies better defined in our next release.\n\n-Helen",
    "Helen: note that it is probably best for you to specify a \"Perfect\" dependency on any Mylar versions prior to 2.0, and after that to specify \"Compatible\".  This can prevent problems of this sort."
  ],
  "commentCreationDates": [
    "2007-05-04T17:43:59+02:00",
    "2007-05-04T20:05:30+02:00",
    "2007-05-04T20:22:00+02:00",
    "2007-05-24T20:31:00+02:00",
    "2007-05-24T21:55:11+02:00",
    "2007-05-25T00:34:03+02:00",
    "2007-05-25T23:56:28+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.osgi.framework.BundleException",
      "message": "Exception in org.eclipse.mylar.tasks.ui.TasksUiPlugin.start() of bundle org.eclipse.mylar.tasks.ui.",
      "elements": [
        {
          "method": "org.eclipse.osgi.framework.internal.core.BundleContextImpl.startActivator",
          "source": "BundleContextImpl.java:1010"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "185571",
      "date": "2007-05-04T17:43:59+02:00",
      "product": "Mylyn",
      "component": "Tasks",
      "severity": "blocker"
    },
    {
      "exceptionType": "java.lang.NoClassDefFoundError",
      "message": "org/eclipse/mylar/tasks/core/IOfflineTaskHandler",
      "elements": [
        {
          "method": "java.lang.Class.getDeclaredConstructors0",
          "source": "Native Method"
        },
        {
          "method": "java.lang.Class.privateGetDeclaredConstructors",
          "source": "Class.java:2357"
        }
      ],
      "number": 1,
      "commentIndex": 0,
      "bugId": "185571",
      "date": "2007-05-04T17:43:59+02:00",
      "product": "Mylyn",
      "component": "Tasks",
      "severity": "blocker"
    }
  ],
  "groupId": "185571",
  "bugId": "185571",
  "date": "2007-05-04T17:43:59+02:00",
  "product": "Mylyn",
  "component": "Tasks",
  "severity": "blocker"
}