{
  "comments": [
    "I20070511-0010\n\n- New Keys preference page\n- select Build All\n- clear filter\n- sort by Binding\n- change to Ctrl+3\n\u003d\u003e Build All with binding *Ctrl+3 is on top\n\u003d\u003e Conflicting binding for Quick Access is somewhere below\n\u003d\u003e Expected: Binding column should properly resort such that conflicts are visible",
    "+1 as it is still not as easy to detect conflicts as it is with the legacy \u0027Keys\u0027 preference page.",
    "Actually I am not sure whether I would like this auto-resorting. A better approach would be to show the conflicts directly below the binding that I just entered.",
    "... and not only to show the real conflicts but also all other related bindings separated either by\n- sequence\n- context\ne.g if i want to assign a cmd to CTRL+W then i\u0027d like to see *all* bindings that use CTRL+W also in another context or as part of a sequence -- or at least when the sequence start with it\n",
    "(In reply to comment #2)\n\u003e Actually I am not sure whether I would like this auto-resorting. A better\n\u003e approach would be to show the conflicts directly below the binding that I just\n\u003e entered.\n\nIn 3.4 I\u0027m trying out replacing the Description box with a table of conflicts for the current selection.  The description can become a tooltip.\n\nPW\n",
    "*** Bug 197801 has been marked as a duplicate of this bug. ***",
    "\u003e In 3.4 I\u0027m trying out replacing the Description box with a table of conflicts\n\u003e for the current selection.  The description can become a tooltip.\n\ni dont like tooltips for things i usually want to see right a way. \nplease find some area in the dialog to show the description of the command somewhere.\nsuggestion: \n1. rename the current [Advanced...] button to [Filter Settings...] \n2. move that button on the same row as the context filter text box, which doesnt have to be that wide anyhow. \nthis has the advantage of being more intuitive.\n3. then you can display the description in a text box or just a text area in the whole width of the dialog on the vertical position where the advanced button was. that gives you about two rows and should be enough in most cases.\n4. the current description TB can then be used to show the conflicts",
    "(In reply to comment #6)\n\u003e \n\u003e i dont like tooltips for things i usually want to see right a way. \n\nMost of the descriptions contain very little information, which is why I think a tooltip is adequate.\n\n\u003e 1. rename the current [Advanced...] button to [Filter Settings...] \n\u003e 2. move that button on the same row as the context filter text box, which\n\u003e doesnt have to be that wide anyhow. \n\u003e this has the advantage of being more intuitive.\n\u003e 3. then you can display the description in a text box or just a text area in\n\u003e the whole width of the dialog on the vertical position where the advanced\n\u003e button was. that gives you about two rows and should be enough in most cases.\n\u003e 4. the current description TB can then be used to show the conflicts\n\nHmmm, that might be possible.  I\u0027ll consider it while making my model work.\n\nPW\n",
    "Created an attachment (id\u003d75987)\nKey Preference Page Model v06\n\nThis is the prototype for the model based key preference page with better conflict display.\n\n1) it is not going to be called the NewNewKeysPreferencePage :-)\n2) The conflict update correctly with changes only about half the time.  I\u0027m still working on that.\n3) not all of the functionality has been propogated across yet (you cannot open the page to a specific binding, modify any of the preference filters or use filtering properly)\n4) start up time is currently horrible ... but changes, copy, remove, and restore is reasonably quick\n\nPW\n",
    "Created an attachment (id\u003d77169)\norg.eclipse.ui.tests patch to overlay on top of Paul\u0027s\n\nThis patch should apply cleanly on top of attachment #75987.",
    "Created an attachment (id\u003d77170)\norg.eclipse.ui.workbench patch on top of Paul\u0027s patch.\n\nThis fixes the conflict issues that were described in comment #8. You will probably have to remove a leading patch segment or whatever to apply this one I think.\n\nThe conflicting code is quite bad but should illustrate the problem and how it could potentially be fixed.",
    "Created an attachment (id\u003d79404)\nKey Preference Page Model v07\n\nRoll in Remy\u0027s patches\nPW\n",
    "Tim, please look at:\n\n1) applyData(*) should set selection on the binding model\n\n2) move the advanced button and filtering code over.  Add show unbound commands to the Advanced button, and make its default \"true\"\n\n3) move the perform OK code over so that the dialog saves any changes\n\nLet\u0027s start with those 3.\n\nPW\n",
    "Created an attachment (id\u003d81188)\nKey Preference Page Model v08\n\nChanges:\n\n- applyData(*) sets selection in binding model\n\n- added Advanced... button, moved \u0027show unbound commands\u0027 to Advanced dialog, and code to filter internal, action sets, uncategorized, and unbound commands\n\n- show unbound commands is true by default\n\n- key preference changes are saved when performOK is executed\n\n- fixed bug with showing multi-key sequences in KeySequenceText",
    "Created an attachment (id\u003d82096)\nKey Preference Page Model v09\n\n+ Fixed a bug with restore binding\n+ Added restore defaults\n- Filter unbound commands\n\nTODO: add CSV import/export",
    "Created an attachment (id\u003d82556)\nKey Preference Page Model v10\n\n+ Added CSV export\n\nThere\u0027s still a bug with changing the context of a BindingElement. Whenever the context, and only the context, of a prebound command is changed restoring the command will remove it completely from the BindingModel. I tried using the system binding to add it back to the BindingModel after the user context binding was deleted but it caused duplicate BindingElement entries. I\u0027ll have to let this ferment a bit before taking another stab at it.",
    "Created an attachment (id\u003d83251)\nKey Preference Page Model v11\n\n",
    "Updates to the v11 model\n\n* protect against NPEs from:\njava.lang.NullPointerException\nat org.eclipse.ui.internal.keys.model.ConflictModel.updateConflictsFor(ConflictModel.java:177)\nat org.eclipse.ui.internal.keys.model.ConflictModel.updateConflictsFor(ConflictModel.java:81)\nat org.eclipse.ui.internal.keys.model.ConflictModel.access$1(ConflictModel.java:80)\nat org.eclipse.ui.internal.keys.model.ConflictModel$1.propertyChange(ConflictModel.java:214)\nat org.eclipse.ui.internal.keys.model.KeyController.firePropertyChange(KeyController.java:99)\nat org.eclipse.ui.internal.keys.model.BindingModel.restoreBinding(BindingModel.java:358)\nat org.eclipse.ui.internal.keys.model.BindingModel.restoreBinding(BindingModel.java:262)\n\n* Update applyData(*) so that it converts an incoming Binding to the Model element before calling setSelection(*)\n\n* using the filter and then selecting a conflict causes the conflicts to disappear and the binding model to have no selection.\n\n* protect the setRedraw(false) when restoring a command with a try/finally\n\nPW\n",
    "Created an attachment (id\u003d83767)\nKey Preference Page Model v12\n\nSnapshot patch\n\nSystem bindings with conflicts are cleared completely when the binding is removed. When restoring one of the commands, the other commands in conflict will be restored to reflect the binding manager\u0027s removal of the delete binding. Performance is slow since it fires PROP_BINDING_REMOVE events for every parameterized command in #restore().",
    "Created an attachment (id\u003d84219)\nKey Preference Page Model v13\n\n+ Fixed performance issue.\n+ Fixed bug with changing a system bind that has conflicts. The removing the delete binding did not remove the trigger for all the commands affected by the delete binding. There is still a selection issue when changing the system bind; the selection is changed to one of the other commands in conflict."
  ],
  "commentCreationDates": [
    "2007-05-11T10:28:51+02:00",
    "2007-05-14T13:01:18+02:00",
    "2007-05-14T13:06:31+02:00",
    "2007-07-25T17:01:32+02:00",
    "2007-07-31T15:43:44+02:00",
    "2007-07-31T15:44:23+02:00",
    "2007-08-02T04:01:50+02:00",
    "2007-08-02T13:51:23+02:00",
    "2007-08-13T20:51:54+02:00",
    "2007-08-28T21:30:49+02:00",
    "2007-08-28T21:32:59+02:00",
    "2007-09-28T16:56:56+02:00",
    "2007-10-22T20:18:36+02:00",
    "2007-10-25T21:04:30+02:00",
    "2007-11-05T15:11:25+01:00",
    "2007-11-09T18:54:44+01:00",
    "2007-11-19T16:41:00+01:00",
    "2007-11-20T15:56:39+01:00",
    "2007-11-26T13:52:22+01:00",
    "2007-11-30T19:39:10+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.ui.internal.keys.model.ConflictModel.updateConflictsFor",
          "source": "ConflictModel.java:177"
        },
        {
          "method": "org.eclipse.ui.internal.keys.model.ConflictModel.updateConflictsFor",
          "source": "ConflictModel.java:81"
        },
        {
          "method": "org.eclipse.ui.internal.keys.model.ConflictModel.access$1",
          "source": "ConflictModel.java:80"
        },
        {
          "method": "org.eclipse.ui.internal.keys.model.ConflictModel$1.propertyChange",
          "source": "ConflictModel.java:214"
        },
        {
          "method": "org.eclipse.ui.internal.keys.model.KeyController.firePropertyChange",
          "source": "KeyController.java:99"
        },
        {
          "method": "org.eclipse.ui.internal.keys.model.BindingModel.restoreBinding",
          "source": "BindingModel.java:358"
        },
        {
          "method": "org.eclipse.ui.internal.keys.model.BindingModel.restoreBinding",
          "source": "BindingModel.java:262"
        }
      ],
      "number": 0,
      "commentIndex": 17,
      "bugId": "186522",
      "date": "2007-11-20T15:56:39+01:00",
      "product": "Platform",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "186522",
  "bugId": "186522",
  "date": "2007-05-11T10:28:51+02:00",
  "product": "Platform",
  "component": "UI",
  "severity": "normal"
}