{
  "comments": [
    "after starting weblogic server 9.2 mp1 from within eclipse sdk 3.2.2 \nbuild M20070212-1330 for solaris gtk, something in the wtp system programatically requests weblogic server 9.2 to shut itself down \nonly seconds after the server is started. \n\n\nsteps to reproduce:\n\n1. download \u0026 install eclipse sdk 3.2.2 build M20070212-1330 for solaris (eclipse-SDK-3.2.2-solaris-gtk.zip)\n\n     http://download.eclipse.org/eclipse/downloads/drops/R-3.2.2-200702121330/\n\n2. update eclipse sdk with the Web Tools Platform (WTP) 1.5.3 plus all of the WTP 1.5.3 pre-reqs:\n \n       http://download.eclipse.org/webtools/downloads/drops/R1.5/R-1.5.3-200702082048/\n\n3. download \u0026 install bea weblogic server 9.2 mp1 binary package installer for solaris 9 sparc:\n\n   http://commerce.bea.com/showallversions.jsp?family\u003dWLS\n\n4. confirm that bea weblogic server\u0027s sample domain can be started from the solaris 9\u0027s shell:\n\n   $ $BEA_HOME/weblogic92/samples/domains/workshop/startWebLogic.sh\n\n5. create a j2ee enterprise application by following the instructions in the following WTP tutorial:\n\n    http://www.eclipse.org/webtools/community/tutorials/BuildJ2EEWebApp/BuildJ2EEWebApp.html\n\n    a. in the \"Choose a Server Runtime Environment\" step, choose BEA WebLogic 9.2 server\n         instead of Tomcat.\n\n6. start the generic bea weblogic server v9.2.1 from the servers view as instructed in the tutorial.\n\nthe eclipse status bar in the bottom right hand corner of eclipse indicates that weblogic server 9.2 is starting. eclipse then switches focus from the servers view to the console view. the console view lists the typical weblogic server startup console entries:\n\n...\n...\u003cServer state changed to STANDBY\u003e \n...\u003cServer state changed to STARTING\u003e\n...\u003cNo test table set up for pool \"cgDataSource\". Connections will not be tested.\u003e \n...\u003cNo test table set up for pool \"cgDataSource-nonXA\". Connections will not be tested.\u003e \n...\u003cNo test table set up for pool \"samplesDataSource\". Connections will not be tested.\u003e \n... [see 13_05_07_eclipse_wls_startup.txt in comment #1 attachment for full console output]\n\neventually - but only for a few seconds - the servers view indicates the state of the weblogic server as \"Started\". the following log entries snipped from weblogic server 9.2\u0027s filesystem logs confirm that the wls did actually start at some point:\n\n...\n...\u003cServer state changed to RUNNING\u003e \n...\u003cServer started in RUNNING mode\u003e \n...\u003c78% of the total memory in the server is free\u003e \n... [see cgServer.log in comment #1 attachment for full log output]\n\nthen eclipse automatically switches focus to the console view again; displaying \nthe following:\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n$BEA_HOME/weblogic92/samples/domains/workshop/bin/stopWebLogic.sh:  \n\nStopping Weblogic Server...\n\nInitializing WebLogic Scripting Tool (WLST) ...\n\nWelcome to WebLogic Server Administration Scripting Shell\n\nType help() for help on available commands\n\nConnecting to t3://localhost:7001 with userid weblogic ...\nThis Exception occured at Sun May 13 12:35:42 BST 2007.\njavax.naming.CommunicationException [Root exception is java.net.ConnectException: t3://localhost:7001: Destination unreachable; nested exception is: \n\tjava.net.ConnectException: Connection refused; No available router to destination]\n...[see 13_05_07_eclipse_wls_shutdown.txt in comment #1 attachment for full stack trace]\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nthe servers view eventually indicates the server has transitioned to the \"Stopped\"  state. the problem is, i never commanded neither eclipse or wls to shutdown the wls server. \n\nsince the wls server can be successfully started outside of eclipse from the shell, and since - once it is successfully started outside of eclipse - wls doesn\u0027t automatically shutdown as soon as it starts; i suspect there is something in eclipse|wtp that is triggering the automatic shutdown.\n\ni encounter this exact same bug using wls 9.0 with eclipse 3.2.2/wtp 1.5.3 on solaris 9 sparc (which is what prompted me to upgrade to wls 9.2 on solaris 9 sparc; see bug #169197); and i encounter this exact same bug with wls 9.2 with eclipse 3.2.2/wtp 1.5.3 in mac os x 10.4.9! in all cases, i have done nothing more and nothing less than what the eclipse/wtp and weblogic documentation has instructed me to do. \n\nplease, provide a fix or a workaround. thanks in advance.",
    "Created an attachment (id\u003d66989)\neclipse logs and wls logs\n\nplease refer to these logs for details related to comment #0",
    "Just to clarify, you say 1.5.3, but did you mean 1.5.4? That was just released? \n\nIf not ... I wonder if you\u0027d see the same behavior in 1.5.4? \n\nPlease confirm if the behavior you report is from our most recent maintenance release.\n\n",
    "Created an attachment (id\u003d66997)\neclipse 3.2.2 logs + wls 9.2 logs after updating to wtp 1.5.4 \n\n(In reply to comment #2)\n\u003e Just to clarify, you say 1.5.3, but did you mean 1.5.4? That was just released? \n\u003e \n\u003e If not ... I wonder if you\u0027d see the same behavior in 1.5.4? \n\u003e \n\u003e Please confirm if the behavior you report is from our most recent maintenance\n\u003e release.\n\u003e \n\nthanks for your reply david,\n\nyeah. i did say 1.5.3. however on your suggestion, i updated both my solaris 9 and my os x installation to wtp 1.5.4 - using the update manager. unfortunately,   wtp 1.5.4 also produces the exact same behavior on both os-es. please see attached logs for details.\n\nalthough it might be a red herring, there is a slight difference in what happens in solaris vs what happens on the mac. on the mac, the exception appears to\nbe thrown at a different point (when a wldeploy.xml ant script\nis executed; not at the point of \"Initializing WebLogic\nScripting Tool (WLST)\" like in the solaris installation):\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\nBuildfile: /Applications/eclipse/plugins/org.eclipse.jst.server.generic.weblogic_1.5.1.v200609141504/buildfiles/wldeploy.xml\ninit:\ndeploy:\n     [echo] Deploying module WTP_WebApp_Tutorial\n [wldeploy] weblogic.Deployer -debug -verbose -noexit -name WTP_WebApp_Tutorial -source /Users/bilbo/development/projects/eclipse_3.2.2_tutorial/.metadata/.plugins/org.eclipse.wst.server.core/tmp0/WTP_WebApp_Tutorial -adminurl t3://localhost:7001 -user weblogic -password ******** -deploy\n [wldeploy] weblogic.Deployer invoked with options:  -debug -verbose -noexit -name WTP_WebApp_Tutorial -source /Users/bilbo/development/projects/eclipse_3.2.2_tutorial/.metadata/.plugins/org.eclipse.wst.server.core/tmp0/WTP_WebApp_Tutorial -adminurl t3://localhost:7001 -user weblogic -deploy\n [wldeploy] [WebLogicDeploymentManagerImpl.\u003cinit\u003e():103] : Constructing DeploymentManager for J2EE version V1_4 deployments\n [wldeploy] [WebLogicDeploymentManagerImpl.getNewConnection():146] : Connecting to admin server at localhost:7001, as user weblogic\n [wldeploy] [ServerConnectionImpl.getEnvironment():288] : setting environment\n [wldeploy] [ServerConnectionImpl.getEnvironment():291] : getting context using t3://localhost:7001\n [wldeploy] [ServerConnectionImpl.close():334] : Closing DM connection\n [wldeploy] [ServerConnectionImpl.close():354] : Unregistered all listeners\n [wldeploy] weblogic.deploy.api.tools.deployer.DeployerException: Unable to connect to \u0027t3://localhost:7001\u0027: Destination unreachable; nested exception is:\n [wldeploy] java.net.ConnectException: Connection refused; No available router to destination. Ensure the url represents a running admin \n...\n[see \"13_05_07_wst_1.5.4_mac_os_x_wldeploy_echos.txt\" in the attachment for the full stack trace]\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nalso, on the mac the cgServer.log has the following additional log entries which didn\u0027t appear in the solaris cgServer.log:\n\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n...\n...\u003cGraceful shutdown of cgServer was issued remotely from 10.0.0.9\u003e \n...\u003cServer shutdown has been requested by weblogic\u003e \n...\u003cServer state changed to SUSPENDING\u003e\n... \n... \u003cServer state changed to ADMIN\u003e \n...\u003cServer state changed to SHUTTING_DOWN\u003e \n...\n...\u003cChannel \"Default[2]\" listening on 127.0.0.1:7001 was shutdown.\u003e \n...\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nthanks in advance for any other suggestions you can think of. \n\nbtw, in case you were gonna suggest updating to a newer version of eclipse: i downloaded and installed an integration build for solaris sparc gtk a couple days ago (eclipse-SDK-I20070508-0800). i updated that integration build by adding wst 2.0 plus its pre-reqs. and it doesn\u0027t even display the j2ee perspective! also, wst 2.0 for eclipse-SDK-I20070508-0800 does not provide an option to download the bea weblogic 9.2 server in the \"download new server runtime\" wizard (or whatever its called). there also aren\u0027t any options to create j2ee projects. what\u0027s up with that? do i need to file a bug for that too? or has there already been one filed?\n\nmany thanks,\nsun-certified",
    "Assigning to Rob since he appears to have been the lead on most WLS server adapter bugs in 1.5.x.",
    "*** Bug 169197 has been marked as a duplicate of this bug. ***",
    "I do not have immediate access to a Solaris environment but just tried the scenario on Windows to determine if this is a general issue with 1.5.4 and WLS - it is not (the issue did not repro).\n\nThe following IOException is included in the both Solaris logs:\n\n...\n!ENTRY org.eclipse.debug.core 4 120 2007-05-13 12:36:32.645\n!MESSAGE Error logged from Debug Core: \n!STACK 0\njava.io.IOException: Stream closed\n\tat java.io.BufferedInputStream.getBufIfOpen(BufferedInputStream.java:145)\n\tat java.io.BufferedInputStream.read1(BufferedInputStream.java:253)\n\tat java.io.BufferedInputStream.read(BufferedInputStream.java:313)\n\tat java.io.BufferedInputStream.read1(BufferedInputStream.java:254)\n\tat java.io.BufferedInputStream.read(BufferedInputStream.java:313)\n\tat java.io.FilterInputStream.read(FilterInputStream.java:90)\n\tat org.eclipse.debug.internal.core.OutputStreamMonitor.read(OutputStreamMonitor.java:138)\n\tat org.eclipse.debug.internal.core.OutputStreamMonitor.access$1(OutputStreamMonitor.java:128)\n\tat org.eclipse.debug.internal.core.OutputStreamMonitor$1.run(OutputStreamMonitor.java:194)\n\tat java.lang.Thread.run(Thread.java:595)\n...\n\nI believe this reflects the following sequence of events:\n\n-ExternalLaunchConfigurationDelegate.launch() is creating an org.eclipse.debug.core.model.RuntimeProcess object for the java.lang.Process object that is created when the startWeblogic.* script is launched.\n\n-RuntimeProcess creates a StreamsProxy object that monitors the process streams\n\n-One of the OutputStreamMonitors (for either the InputStream or ErrorStream) is failing to get created with that error.\n\n-This error is causing creation of the RutimeProcess object to fail and triggering automatic shutdown of the server instance.\n\nI also noticed in the Eclipse log for the other bug the following: \n\n...\n!ENTRY org.eclipse.core.filesystem 1 1 2007-03-15 13:15:28.606\n!MESSAGE Could not load library: liblocalfile_1_0_0.so.  This library provides platform-specific optimizations for certain file system operations.  This library is not present on all platforms, so this may not be an error.  The resources plug-in will safely fall back to using java.io.File functionality.\n...\n\nI am not familiar with Solaris or the Eclipse packaging for this OS so do not know for certain if a liblocalfile should be available (I suspect it should...); this error may indicate a problem with the Eclipse build/installation.\n\nThe mac issue looks distinct (can you verify that the configured admin URL of t3://localhost:7001 for the server instance is valid)\n\nGiven all of this, I suspect that something platform-specific (or installation/configuration specific) is happening in this case and am going to drop this from blocker to critical. \n\nCan you answer/try a few things for me:\n\n-are you able to successfully launch external Java processed from your Eclipse instance? (e.g. another Eclipse instance)\n-are you able to successfully use any other WTP server adapters?\n",
    "cancel the interpretation of that stack: it is not failing during creation of the monitor but after the thread has been started; other questions still apply.",
    "searching bugzilla for similar OS-related issues (search for \"solaris gtk\") did turn up some potentially related bugs (e.g. https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d184403); if you try out that search and scan the issues to see if any of those might also apply to your installation (and therefore impact this issue), that would be much appreciated",
    "OK, fairly certain the OS-dependency was a false lead it is better to focus instead and the standard reasons why this would happen: server start-up simply timed out (and the default behavior on timeout is to execute the \"stop\" logic for the server). \n\nThe shutdown is either being called when a \"timeout\" is detected within PingThread.ping() or Server.start(); since you are getting a ConnectionException running stopWeblogic.sh, that indicates that perhaps nothing is listening on localhost:7001 (i.e. PingThread failed to successfully estabilish an HttpURLConnection to the server at http://localhost:7001 and, after the designated number of attempts, \"stops\" the server).\n\nThis is consistent with the WLS startup log you provided:\n\n-the last server state I see is \"STARTING\" and I don\u0027t see an entry indicating it is listening on port 7001; i.e. I would expect to see entries like the following:\n\n...\n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cServer\u003e \u003cBEA-002613\u003e \u003cChannel \"Default[2]\" is now listening on 127.0.0.1:7001 for protocols iiop, t3, ldap, http.\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cServer\u003e \u003cBEA-002613\u003e \u003cChannel \"DefaultSecure[1]\" is now listening on 192.168.15.111:7002 for protocols iiops, t3s, ldaps, https.\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cServer\u003e \u003cBEA-002613\u003e \u003cChannel \"Default\" is now listening on 172.24.28.224:7001 for protocols iiop, t3, ldap, http.\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cServer\u003e \u003cBEA-002613\u003e \u003cChannel \"DefaultSecure\" is now listening on 172.24.28.224:7002 for protocols iiops, t3s, ldaps, https.\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cServer\u003e \u003cBEA-002613\u003e \u003cChannel \"DefaultSecure[2]\" is now listening on 127.0.0.1:7002 for protocols iiops, t3s, ldaps, https.\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cServer\u003e \u003cBEA-002613\u003e \u003cChannel \"Default[1]\" is now listening on 192.168.15.111:7001 for protocols iiop, t3, ldap, http.\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cWebLogicServer\u003e \u003cBEA-000331\u003e \u003cStarted WebLogic Admin Server \"examplesServer\" for domain \"wl_server\" running in Development Mode\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cWebLogicServer\u003e \u003cBEA-000365\u003e \u003cServer state changed to RUNNING\u003e \n\u003cMay 14, 2007 10:01:05 AM EDT\u003e \u003cNotice\u003e \u003cWebLogicServer\u003e \u003cBEA-000360\u003e \u003cServer started in RUNNING mode\u003e \n...\n\nI thought it was odd that this shutdown was happening after only a few seconds (the configured timeout duration for that server type is 120 seconds - longer than the standard for most of the other generic servers), however, your eclipse_wls_startup log has an initial time of \u003cMay 13, 2007 12:32:14 PM \nBST\u003e and a last time of \u003cMay 13, 2007 12:34:11 PM BST\u003e: about two minutes.\n\nAre you experiencing equivalently slow startup times when you launch WLS independently?\n\nI\u0027m not clear why the server state was transitioning into \"Started\" before the shutdown (that call should be getting made by PingThread after a successful connection).\n\nYour attempt with 1.5.4 fails due to the following:\n\nFATAL ERROR in native method: JDWP No transports initialized, jvmtiError\u003dJVMTI_ERROR_INTERNAL(113)\nStopping PointBase server...\nPointBase server stopped.\nERROR: transport error 202: bind failed: Address already in use [\"transport.c\",L41]\nERROR: JDWP Transport dt_socket failed to initialize, TRANSPORT_INIT(510) [\"debugInit.c\",L500]\nJDWP exit error JVMTI_ERROR_INTERNAL(113): No transports initializedERROR: transport error 202: bind failed: Address already in use [\"transport.c\",L41]\nERROR: JDWP Transport dt_socket failed to initialize, TRANSPORT_INIT(510) [\"debugInit.c\",L500]\nJDWP exit error JVMTI_ERROR_INTERNAL(113): No transports initialized\n\nI\u0027m changing the bug title and severity accordingly. \n\n\n\n\n ",
    "(In reply to comment #6)\n\nthanks for your reply rob,\n\n\u003e...liblocalfile_1_0_0.so.  This library provides\nplatform-specific optimizations for certain file system operations.  This\nlibrary is not present on all platforms, so this may not be an error.  The\nresources plug-in will safely fall back to using java.io.File functionality.\n\ni read that as, \"The resources plug-in will safely fall back to using java.io.File functionality.\" as the message suggests, i believe the missing liblocalfile_1_0_0.so is not an error; more of a \"notice\" maybe?.\n\n\n\u003e The mac issue looks distinct (can you verify that the configured admin URL of\n\u003e t3://localhost:7001 for the server instance is valid)\n\n\ni did a couple things to confirm that t3://localhost:7001 is a valid admin url on the mac:\n\n  1. removed all applications from the server instance under test so that there was nothing to deploy or undeploy \n\nwhen there aren\u0027t any apps to deploy or undeploy, that \"java.net.ConnectException: Connection refused; No available router\nto destination.\" exception is never thrown on the mac. instead, WSLT successfully completes whatever it was commanded to do and the following gets written to the cgServer.log:\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n...\n...\u003cGraceful shutdown of cgServer was issued remotely from 10.0.0.9\u003e \n...\u003cServer shutdown has been requested by weblogic\u003e \n...\u003cServer state changed to SUSPENDING\u003e\n... \n... \u003cServer state changed to ADMIN\u003e \n...\u003cServer state changed to SHUTTING_DOWN\u003e \n...\n...\u003cChannel \"Default[2]\" listening on 127.0.0.1:7001 was shutdown.\u003e \n...\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\n  2. changed the protocol of the \"adminurl\" attrs of the \"deploy\" and \"undeploy\" targets of this ant script from \"t3\" to \"http\":\n\n  \"/Applications/eclipse/plugins/org.eclipse.jst.server.generic.weblogic_1.5.1.v200609141504/buildfiles/wldeploy.xml\"\n  \nwhen there aren\u0027t any apps to deploy or undeploy; and the protocol is \"t3\", all is right with the world. but when the protocol is changed to \"http\", it chokes regardless (even if \"Enable Tunneling\" is true).\n\ni haven\u0027t checked for sure; but if i\u0027m not mistaken i think that is the same admin url that workshop for weblogic 9.2 uses in its integration with wtp. i am assuming that if that admin url works for workshop 9.2, then it is good to go for eclipse 3.2.2. please, correct me if i\u0027m wrong?\n\nanyway, i think that \"java.net.ConnectException\" stacktrace is a red herring. i believe it is a _symptom_ of the premature server shutdown; not a cause of the shutdown. i posted it only for the sake of completeness. but of course, i could be totally wrong about that.\n\n\n\u003e -are you able to successfully launch external Java processed from your Eclipse\n\u003e instance? (e.g. another Eclipse instance)\n\ni can confirm that i am able to successfully launch external java processes from both eclipse installations (solaris 9 and os x).\n\nin the main method of a test class, i simply coded \u0027Runtime.getRuntime().exec(\"[path to a different eclipse installation]\")\u0027; \nthen, with that class open in the eclipse 3.2.2 installation\u0027s java editor, i right-clicked on the test class and selected \"Run As -\u003e Java Application\";\nand in both cases (on solaris \u0026 mac). the instances of the different eclipse installations successfully launched on both os-es.\n\n\u003e -are you able to successfully use any other WTP server adapters?\n\nalso able to succesfully start tomcat 5.5 from eclipse 3.2.2/wtp 1.5.4 on solaris (haven\u0027t tried it on the mac, but i suspect it would be the same result).there was a minor snag though when i shutdown tomcat from eclipse. but i won\u0027t confuse the issue with too many more details.\n\nthanks again for your help, rob.\n\nmany thanks,\nsun_certified",
    "Per comment #9, I\u0027m going to resolve this as WORKSFORME; please try changing your server timeout delay preference to increase the allowable server timeout:\n\nWindow-\u003ePreferences-\u003eServer-\u003eServer timeout delay: \"Longer\" (Gorkem: appears that PingThread just uses it\u0027s internal default if \"Unlimited\" is specified)\n\nIf that doesn\u0027t work for you, please reopen",
    "(In reply to comment #10)\nsorry rob,\n\nlooks like our messages crossed each other enroute.",
    "(In reply to comment #9)\n\u003e \n\u003e Your attempt with 1.5.4 fails due to the following:\n\u003e \n\u003e FATAL ERROR in native method: JDWP No transports initialized,\n\u003e jvmtiError\u003dJVMTI_ERROR_INTERNAL(113)\n\u003e Stopping PointBase server...\n\u003e PointBase server stopped.\n\u003e ERROR: transport error 202: bind failed: Address already in use\n\u003e [\"transport.c\",L41]\n\u003e ERROR: JDWP Transport dt_socket failed to initialize, TRANSPORT_INIT(510)\n\u003e [\"debugInit.c\",L500]\n\u003e JDWP exit error JVMTI_ERROR_INTERNAL(113): No transports initializedERROR:\n\u003e transport error 202: bind failed: Address already in use [\"transport.c\",L41]\n\u003e ERROR: JDWP Transport dt_socket failed to initialize, TRANSPORT_INIT(510)\n\u003e [\"debugInit.c\",L500]\n\u003e JDWP exit error JVMTI_ERROR_INTERNAL(113): No transports initialized\n\u003e\nthanks rob,\n\ni will try that timeout setting you suggested and get back to you. \n\nin the meantime, please remind me: where did the above snippet come from? i don\u0027t recall seeing that before.\n",
    "That snippet came from the 13_05_07_wtp.1.5.4_wls_startup.txt file in your second attachment zip.\n\n(In reply to comment #13)\n\u003e (In reply to comment #9)\n\u003e \u003e \n\u003e \u003e Your attempt with 1.5.4 fails due to the following:\n\u003e \u003e \n\u003e \u003e FATAL ERROR in native method: JDWP No transports initialized,\n\u003e \u003e jvmtiError\u003dJVMTI_ERROR_INTERNAL(113)\n\u003e \u003e Stopping PointBase server...\n\u003e \u003e PointBase server stopped.\n\u003e \u003e ERROR: transport error 202: bind failed: Address already in use\n\u003e \u003e [\"transport.c\",L41]\n\u003e \u003e ERROR: JDWP Transport dt_socket failed to initialize, TRANSPORT_INIT(510)\n\u003e \u003e [\"debugInit.c\",L500]\n\u003e \u003e JDWP exit error JVMTI_ERROR_INTERNAL(113): No transports initializedERROR:\n\u003e \u003e transport error 202: bind failed: Address already in use [\"transport.c\",L41]\n\u003e \u003e ERROR: JDWP Transport dt_socket failed to initialize, TRANSPORT_INIT(510)\n\u003e \u003e [\"debugInit.c\",L500]\n\u003e \u003e JDWP exit error JVMTI_ERROR_INTERNAL(113): No transports initialized\n\u003e \u003e\n\u003e thanks rob,\n\u003e \n\u003e i will try that timeout setting you suggested and get back to you. \n\u003e \n\u003e in the meantime, please remind me: where did the above snippet come from? i\n\u003e don\u0027t recall seeing that before.\n\u003e \n\n",
    "Created an attachment (id\u003d67131)\nlogs for \"Longer\" timeout setting in eclipse 3.2.2 on solaris 9 sparc\n\n\n(In reply to comment #11)\n\nis there a configuration file/deployment descriptor somewhere\nwhere i can set the timeout to \"Never\" or something?\n\ni changed the timeout to \"Longer\" in Window | Preferences | Servers.\n\ni added a fresh wls in a different domain to the Servers view:\n\n  \"/development/bea/weblogic92/samples/domains/wl_server\"\n  \nnow it gets a little further along in the startup \nprocess (see attached 14_05_07_longer_timeout_startup.txt)\n\nthe Servers view blinks the state as \"Starting\" for ages.\n\nthen eventually - after maybe 3-4 mins - stopWebLogic.sh\npops up in the console with:\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\nStopping Weblogic Server...\n\nInitializing WebLogic Scripting Tool (WLST) ...\n\nWelcome to WebLogic Server Administration Scripting Shell\n\nType help() for help on available commands\n\nConnecting to t3://localhost:7001 with userid weblogic ...\nSuccessfully connected to Admin Server \u0027examplesServer\u0027 that belongs to domain \u0027wl_server\u0027.\n\nWarning: An insecure protocol was used to connect to the \nserver. To ensure on-the-wire security, the SSL port or \nAdmin port should be used instead.\n\nShutting down the server examplesServer with force\u003dfalse while connected to examplesServer ...\nDisconnected from weblogic server: examplesServer\n\n\nExiting WebLogic Scripting Tool.\n\nDone\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nno exceptions this time at least.\n\nthen the state of the wls changes to \"Stopped\" in the Servers view.\n\nfor what its worth, wl_server.log reports:\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n...\u003cChannel \"Default\" is now listening on 127.0.0.1:7001 for protocols iiop, t3, ldap, http.\u003e\n... [see attached 14_05_07_longer_timeout_wl_server.log for full log]\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d \n\n\n\nexamplesServer.log reports:\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n ...\n \u003cNetwork Configuration for Channel \"examplesServer\"\n Listen Address\t\t :7001\n Public Address\t\t N/A\n Http Enabled\t\t true\n Tunneling Enabled\t false\n Outbound Enabled\t false\n Admin Traffic Enabled\t true\u003e \n####\u003cMay 14, 2007 8:47:16 PM BST\u003e \u003cInfo\u003e \u003cRJVM\u003e \u003cbebop\u003e \u003cexamplesServer\u003e \u003c[STANDBY] ExecuteThread: \u00273\u0027 for queue: \u0027weblogic.kernel.Default (self-tuning)\u0027\u003e \u003c\u003cWLS Kernel\u003e\u003e \u003c\u003e \u003c\u003e \u003c1179172036644\u003e \u003cBEA-000570\u003e \u003cNetwork Configuration for Channel \"examplesServer\"\n Listen Address\t\t :7002 (SSL)\n Public Address\t\t N/A\n Http Enabled\t\t true\n Tunneling Enabled\t false\n Outbound Enabled\t false\n Admin Traffic Enabled\t true\u003e \n####\u003cMay 14, 2007 8:47:16 PM BST\u003e \u003cDebug\u003e \u003cRJVM\u003e \u003cbebop\u003e \u003cexamplesServer\u003e \u003c[STANDBY] ExecuteThread: \u00273\u0027 for queue: \u0027weblogic.kernel.Default (self-tuning)\u0027\u003e \u003c\u003cWLS Kernel\u003e\u003e \u003c\u003e \u003c\u003e \u003c1179172036680\u003e \u003cBEA-000571\u003e \u003cNetwork Configuration Detail for Channel \"examplesServer\"\n Channel Weight\t\t 50\n Accept Backlog\t\t 50\n Login Timeout\t\t 5000ms\n Max Message Size\t 10000000\n Message Timeout\t 60s\n Idle Timeout\t\t 65s\n Tunneling Timeout\t 40s\n Tunneling Ping\t\t 45s\u003e \n ... [see attached 14_05_07_longer_timeout_examplesServer.log for full log]\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\n\n\nthe .metadata/.log again has those same msgs as before:\n\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\nENTRY org.eclipse.core.filesystem 1 1 2007-05-14 20:41:25.767\n!MESSAGE Could not load library: liblocalfile_1_0_0.so.  This library provides platform-specific optimizations... \n\n  ...\n  \n!ENTRY org.eclipse.debug.core 4 120 2007-05-14 20:56:00.240\n!MESSAGE Error logged from Debug Core: \n!STACK 0\n  java.io.IOException: Stream closed\n\tat java.io.BufferedInputStream.getBufIfOpen(BufferedInputStream.java:145)\n\tat java.io.BufferedInputStream.read1(BufferedInputStream.java:253)\n  ...\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n  \n",
    "One of those property values is \"Unlimited\", however, the current implementation of the GenericServer PingThread incorrectly uses a default value of \"60\" pings (equivalent to about 15 seconds) if the ServerType.getStartTimeout() returns -1 (the value for no timeout).\n\nCould still be a timeout issue, however, based on your latest logs, it appears something else is happening; server state changes to RUNNING and the following is logged:\n\n\u003cMay 14, 2007 8:50:29 PM BST\u003e \u003cNotice\u003e \u003cServer\u003e \u003cBEA-002613\u003e \u003cChannel \"Default\" is now listening on 127.0.0.1:7001 for protocols iiop, t3, ldap, http.\u003e\n\nJust to verify, could you try starting that server domain independent from WTP and verifying that you can connect to http://localhost:7001?\n\nYou might also want to try things out with a \"stripped down\" domain (so that it will start up more quickly) to see if in fact the WTP server logic is timing out.\n\n ",
    "Created an attachment (id\u003d67153)\nconsole output, log files and screenshot of http://localhost:7001\n\n(In reply to comment #16)\n\nthanks rob,\n\ni really appreciate you looking into this!\n\ni can confirm that http://localhost:7001 is reachable. \ni can start the wls with the following command from the shell:\n\n $BEA_HOME/weblogic92/samples/domains/wl_server/bin/startWebLogic.sh \u0026\n\nas you can see from timestamps in the attached console output, it \ntook about 2.5 minutes for examplesServer in the wl_server domain to startup \nfrom the shell.\n \nas soon as the server started up - without even having to do anything - \nthe browser loaded with the \"Welcome to BEA WebLogic Server\" at the following url:\n \n   http://127.0.0.1:7001/index.jsp\n   \nit goes without saying (but i will say it anyway ;?), http://localhost:7001/index.jsp \nworks too (see attached \"http_localhost_7001.gif\").\n\ni will try a stripped down server and let you know what happens. but if it turns out that i can only deploy a limited number of components, or have the server fail to start up, that\u0027s not scalable is it?\n\nmany thanks,\nsun_certified\n",
    "Created an attachment (id\u003d67154)\nconsole output, log files of a stripped-down non-workshop domain\n\n(In reply to comment #16)\n\nhi rob,\n\nas you suggested, i tried with a stripped-down domain (freshly created with configuration wizard, no apps deployed to it, no workshop-related stuff). \n\nas you can see from the console output, it started up in 1.5 mins. it\u0027s been running for about 20 mins now and it hasn\u0027t been shutdown (yet ;?).\n\nthe Servers view indicates it is in the \"Started\" state; no error events were written to .metadata/.log. \n\nare we out of the woods? thanks for all your help, rob!\n\nmany thanks,\nsun_certified\n",
    "Yes, I think we can call this particular issue resolved; I went ahead and opened a separate bug (https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d186902) on support for \"unlimited\" server timeouts in PingThread. ",
    "(In reply to comment #19)\n\u003e Yes, I think we can call this particular issue resolved; I went ahead and\n\u003e opened a separate bug (https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d186902) on\n\u003e support for \"unlimited\" server timeouts in PingThread. \n\u003e \n\nthanks rob,\n\ni\u0027m grateful that i now know what to do to avoid an unwanted shutdown.  am i \ncorrect in my understanding that \"Resolution: WORKSFORME / Status: RESOLVED\" \nsuggests this is not expected to happen to other users under similar circumstances? \n\nthe reason i am making extra effort to fully understand this issue, is because \nas a contractor i work with lots of different dev shops that are _licensed_ bea \nwls customers; between engagements, i proactively investigate scenarios like \nthe one described in this thread; so that if i encounter similar circumstances on a paid engagement i will be that much further ahead of the game.\n\nfor example, say a licensed user\u0027s non-workshop _production_ domain has similar types and similar amounts of components deployed to it as the bea sample wl_server domain has. and say this licensed customer has architectural \nconstraints defined for their production system that dictate they MUST HAVE \nweblogic server 9.2 mp1 deployed on solaris 9 sparc oe; and say - for whatever reason - their developers MUST code, build and deploy using the eclipse 3.2.2 \nide, with wtp 1.5.4, etc. and say - for whatever reason - eclipse.org\u0027s wtp \ndevelopers can\u0027t get around to looking at bug #186902 for six months.  given the above constraints, what would bea recommend their licensed wls 9.2 mp1 customers \ndo if they encounter the timed-out shutdown behavior?\n\nthanks again, rob, for your expert help.\n\nmany thanks,\nsun_certified\n\np.s. others encountering similar behavior might consider monitoring the following related bea dev2dev threads for other suggested solutions: \n\nBea Workshop for Weblogic10 Platform App. Server\nhttp://forums.bea.com/bea/thread.jspa?forumID\u003d2037\u0026threadID\u003d400001365\u0026messageID\u003d400004263#400004263\n\nExtremely long deploy times in Portal 9.2 in dev\nhttp://forums.bea.com/bea/thread.jspa?threadID\u003d400003805\u0026tstart\u003d0\u0026mod\u003d1178907986498\n\n\nTimeout on Deployment of the Portal from Workshop\nhttp://forums.bea.com/bea/thread.jspa?threadID\u003d400001799\u0026tstart\u003d45\u0026mod\u003d1172531025734",
    "(In reply to comment #20)\n\nSee answers below\n\n\u003e thanks rob,\n\u003e \n\u003e i\u0027m grateful that i now know what to do to avoid an unwanted shutdown.  am i \n\u003e correct in my understanding that \"Resolution: WORKSFORME / Status: RESOLVED\" \n\u003e suggests this is not expected to happen to other users under similar\n\u003e circumstances? \n\u003e \n\nIt is really \"by design\"; that particular server domain/machine combination was timing out on startup and, by design, that triggers the execution of the shutdown logic. WTP supports configurable timeout delays (using the preference I mentioned earlier),  and that allows most users to set things appropriately for their environment. In your case, however, you need the \"unlimited\" delay but that is not supported by the generic server PingThread. That is a separate issue, however, so I opened a new bug.\n\n\u003e the reason i am making extra effort to fully understand this issue, is because \n\u003e as a contractor i work with lots of different dev shops that are _licensed_ bea \n\u003e wls customers; between engagements, i proactively investigate scenarios like \n\u003e the one described in this thread; so that if i encounter similar circumstances\n\u003e on a paid engagement i will be that much further ahead of the game.\n\u003e \n\u003e for example, say a licensed user\u0027s non-workshop _production_ domain has similar\n\u003e types and similar amounts of components deployed to it as the bea sample\n\u003e wl_server domain has. and say this licensed customer has architectural \n\u003e constraints defined for their production system that dictate they MUST HAVE \n\u003e weblogic server 9.2 mp1 deployed on solaris 9 sparc oe; and say - for whatever\n\u003e reason - their developers MUST code, build and deploy using the eclipse 3.2.2 \n\u003e ide, with wtp 1.5.4, etc. and say - for whatever reason - eclipse.org\u0027s wtp \n\u003e developers can\u0027t get around to looking at bug #186902 for six months.  given\n\u003e the above constraints, what would bea recommend their licensed wls 9.2 mp1\n\u003e customers \n\u003e do if they encounter the timed-out shutdown behavior?\n\u003e \n\nBEA would first recommend the use, where supported, of the custom WLS server adapter bundled with Workshop (we are planning on making that available as a downloadable server adapter for WTP - see Konstantin\u0027s note to the mailing list on that topic).\n\nAs a general rule, deployment from the IDE should be only performed against development domains; for production domain, users often create a module archive (using command-line build scripts, exporting as an EAR/WAR/JAR from the IDE) and deploy to the production WLS domain via a separate mechanism (script, etc.) once the application has been throughly tested on the development domain. \n\nUse of external start/stop/deployment tools can be used as a workaround for issues with IDE integration.\n\n\u003e thanks again, rob, for your expert help.\n\u003e \n\u003e many thanks,\n\u003e sun_certified\n\u003e \n\u003e p.s. others encountering similar behavior might consider monitoring the\n\u003e following related bea dev2dev threads for other suggested solutions: \n\u003e \n\u003e Bea Workshop for Weblogic10 Platform App. Server\n\u003e http://forums.bea.com/bea/thread.jspa?forumID\u003d2037\u0026threadID\u003d400001365\u0026messageID\u003d400004263#400004263\n\u003e \n\u003e Extremely long deploy times in Portal 9.2 in dev\n\u003e http://forums.bea.com/bea/thread.jspa?threadID\u003d400003805\u0026tstart\u003d0\u0026mod\u003d1178907986498\n\u003e \n\u003e \n\u003e Timeout on Deployment of the Portal from Workshop\n\u003e http://forums.bea.com/bea/thread.jspa?threadID\u003d400001799\u0026tstart\u003d45\u0026mod\u003d1172531025734\n\u003e \n\n",
    "sun_certified, are you comfortable marking this one as verified now? (would like to get all of the \"blockers\" verified and closed for the RC0 release)\n\nthanks, Rob ",
    "(In reply to comment #22)\n\u003e sun_certified, are you comfortable marking this one as verified now? (would\n\u003e like to get all of the \"blockers\" verified and closed for the RC0 release)\n\u003e \n\u003e thanks, Rob \n\u003e \nsure. go for it! thanks again, rob.",
    "closing"
  ],
  "commentCreationDates": [
    "2007-05-13T15:22:02+02:00",
    "2007-05-13T15:26:08+02:00",
    "2007-05-13T19:31:01+02:00",
    "2007-05-13T23:16:05+02:00",
    "2007-05-14T15:00:55+02:00",
    "2007-05-14T15:55:30+02:00",
    "2007-05-14T16:46:18+02:00",
    "2007-05-14T17:02:22+02:00",
    "2007-05-14T17:31:02+02:00",
    "2007-05-14T20:26:35+02:00",
    "2007-05-14T20:41:08+02:00",
    "2007-05-14T20:46:20+02:00",
    "2007-05-14T20:50:12+02:00",
    "2007-05-14T21:35:12+02:00",
    "2007-05-14T21:48:48+02:00",
    "2007-05-14T22:38:09+02:00",
    "2007-05-14T23:54:28+02:00",
    "2007-05-15T00:37:01+02:00",
    "2007-05-15T01:21:06+02:00",
    "2007-05-15T03:22:47+02:00",
    "2007-05-15T12:07:01+02:00",
    "2007-05-15T15:47:13+02:00",
    "2007-05-17T15:49:28+02:00",
    "2007-05-17T16:36:58+02:00",
    "2007-05-17T16:43:34+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.io.IOException",
      "message": "Stream closed",
      "elements": [
        {
          "method": "java.io.BufferedInputStream.getBufIfOpen",
          "source": "BufferedInputStream.java:145"
        },
        {
          "method": "java.io.BufferedInputStream.read1",
          "source": "BufferedInputStream.java:253"
        },
        {
          "method": "java.io.BufferedInputStream.read",
          "source": "BufferedInputStream.java:313"
        },
        {
          "method": "java.io.BufferedInputStream.read1",
          "source": "BufferedInputStream.java:254"
        },
        {
          "method": "java.io.BufferedInputStream.read",
          "source": "BufferedInputStream.java:313"
        },
        {
          "method": "java.io.FilterInputStream.read",
          "source": "FilterInputStream.java:90"
        },
        {
          "method": "org.eclipse.debug.internal.core.OutputStreamMonitor.read",
          "source": "OutputStreamMonitor.java:138"
        },
        {
          "method": "org.eclipse.debug.internal.core.OutputStreamMonitor.access$1",
          "source": "OutputStreamMonitor.java:128"
        },
        {
          "method": "org.eclipse.debug.internal.core.OutputStreamMonitor$1.run",
          "source": "OutputStreamMonitor.java:194"
        },
        {
          "method": "java.lang.Thread.run",
          "source": "Thread.java:595"
        }
      ],
      "number": 0,
      "commentIndex": 6,
      "bugId": "186716",
      "date": "2007-05-14T16:46:18+02:00",
      "product": "Web Tools",
      "component": "jst.server",
      "severity": "blocker"
    },
    {
      "exceptionType": "java.io.IOException",
      "message": "Stream closed",
      "elements": [
        {
          "method": "java.io.BufferedInputStream.getBufIfOpen",
          "source": "BufferedInputStream.java:145"
        },
        {
          "method": "java.io.BufferedInputStream.read1",
          "source": "BufferedInputStream.java:253"
        }
      ],
      "number": 1,
      "commentIndex": 15,
      "bugId": "186716",
      "date": "2007-05-14T22:38:09+02:00",
      "product": "Web Tools",
      "component": "jst.server",
      "severity": "blocker"
    }
  ],
  "groupId": "186716",
  "bugId": "186716",
  "date": "2007-05-13T15:22:02+02:00",
  "product": "Web Tools",
  "component": "jst.server",
  "severity": "blocker"
}