{
  "comments": [
    "Build ID: I20070503-1400\n\nSteps To Reproduce:\n1. configure stand-alone ACServer for security enabled\n2. profile an external java app.\n3. authenticate *\n4. try to profile StartStop test class\n\n* When I open the launch dialog and click on the configuration\nI am prompted *twice or more* about accepting the certificate and\nchallenged twice or more times for authentication. After authenticating\nthe test connection does indicate success.\n\n\nMore information:\nThe attempt to profile results in an error:\n\"one of the selected launch delegates has failed:\"\n\norg.eclipse.core.runtime.CoreException\nAgent Controller is unavailable under port 10002.  Make sure that the service is started and the port number is correct under preferences.\n\norg.eclipse.tptp.platform.execution.exceptions.AgentControllerUnavailableException: Error: Unable to connect to the Agent Controller.Timeout while waiting for connection to complete\n  at org.eclipse.tptp.platform.execution.client.core.internal.NodeImpl.connect(NodeImpl.java:146)\n  at org.eclipse.tptp.platform.jvmti.client.internal.launcher.util.AgentControllerDelegate$1$EstablishConnection.run(AgentControllerDelegate.java:155)\n  at java.lang.Thread.run(Thread.java:803)\n\n\nThis is using 0508C build of 4.4.0 on windows XP. I also\nsaw this issue on Vista.\n\nStartStop is a test class from the automation framework.",
    "On a different Windows host I am getting the same multiple dialogs\nbut the profiling is working (no connection error)\n\nOne major difference is on this host AC and workbench are using\nIBM JDK 1.4.",
    "This symptom is caused by the UI querying the AC for the JDK version. This needs to be improved.",
    "Created an attachment (id\u003d67854)\nPatch\n\nAlan,\n\nThe inability to profile with JVM1.5 is caused by the JVMTI not being able to connect to a secure Agent Controller.  I have opened another defect to track this problem:  https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d187887.\n\nThe attached patch fixes the multiple user prompts that you have noted in your defect description.",
    "Alan, can you please check to make sure that the attached patch functions correctly?\n\nEugene, can you please review the code (which is merged with the patch for bug 186639) and check to make sure that it functions correctly?\n\nJoanna assuming code review passes, can you please approve this for i4 inclusion?\n\nThank you.",
    "I would like to get this defect fixed.  Alan have you had a chance to test? Eugene have you had a chance to review the code?  ",
    "I have tried it 6-7 times with jre 1.5 and 1.4.2 (the latter can profile and collect data successfully) and with different pauses and incorrect passwords.\n\nThis is on the Vista host which was easy to reproduce the original problem with.\n\nI do not see the multiple dialogs appear anymore.",
    "Good news!  Eugene would you please do the code review so we can include this in the next driver?",
    "I tested with ibm JDK 1.4.2 and 1.5. Tried with not accepting certificate, wrong password and user id, and things work correctly. I cannot complete the test with 1.5 but the authentication and certificate dialogs are prompted in the right order and in the correct amount of occurrence.",
    "I did a code review and the patch looks good as well.",
    "Fix in CVS - HEAD.",
    "In 4.4.0.1 on Vista I am seeing the multiple prompts again. I am running everything\nunder sun jre 1.4.2 and when I try to manually profile an app I am challenged for\nlogin when I launch the profile dialog, test the server, select a analysis \ntype, and when swithing from one item to another (ie: attach to external\napplication). This seems even worse then before.\n\nThe end result of the attempt is the same exception but I don\u0027t think that\nfix is in this build.\n\nI am using 200707090100 build on avista.",
    "I realized that Connection Pool (hyades NodeFactory) is being requested for a connection with addresses 192.168.*.*, 127.0.0.1, localhost. All these addresses belong to the single host, but NodeFactory originates separate connections (and requests for login/psw).",
    "org.eclipse.tptp.platform.common.ui.trace.internal.util.PDCoreUtil.createNode() has redundant unnecessary call to NodeFactory.\nCould by substituted by InetAddress.getByName(name).getHostAddress()",
    "Using the 07090100B build I still get the multiple prompts. \ntwice each time I try to launch and external application and\nwhen I attach I get it twice and then once more after clicking\n\"profile\".\n\nIn these tests the profiling does start and is successful, maybe this\nis because the fix for 187887 is in it.",
    "The multiple prompts can\u0027t be considered as stop ship for 4.4.0.1 (given that the user can profile successfully).  I\u0027m lowering the priority to P2 and re-targeting to 4.4.1",
    "Created an attachment (id\u003d73985)\nSecond version of the patch\n\n",
    "Alan, can you please test to see if the latest patch works as expected.  \n\nEugene, can you review the patch.  The multiple prompts were being caused by the client code disconnecting the connection on a node.  A connection needs to be established every time the node is reused and hence the user prompted for a username and password multiple times.\n\nI\u0027m re-targeting this to 4.4.0.2.",
    "Ali, the following use case fails to work:\n- start RAC with security : on\n- launch an java application\n- detach the java application\n- attach to application via \u0027Attach Java process\u0027 launch configuration.",
    "Eugene,\n\nI\u0027m able to successfully attach after detaching from the agent.  Let\u0027s talk about this once you\u0027re in the office.  Thanks.",
    "With jre 1.4.2 this patch seems to work well. I tried launching, attaching and\nEugene\u0027s case.\n\nWith jre 1.5 the repeated login challenges are fixed but I find I cannot\nattach to a java application, only launch it from the workbench.",
    "Created an attachment (id\u003d74190)\n3rd version of the patch\n\nEugene, as discussed I had disabled attach of the JVMTI agent when AC was detected to run in secure mode.  The use case was throwing an exception in an older version of the workbench that I was using.  I have re-enabled and tested the use case under 4.4.0.1.  Please give the latest patch a try.\nI\u0027ve also made some modifications to jvmti.client to improve the sluggish performance when expanding/checking a JVMTI agent under the attach tab.\n\nAlan, I\u0027m able to attach to a JVMPI and a JVMTI agent using IBM JRE 1.5",
    "Patch looks okay to me.",
    "Created an attachment (id\u003d74257)\n4th version of the patch\n\nAlan reported redundant consoles being created when attaching to a JVMTI agent.  I\u0027ve included a fix under this latest patch but there are other problems inside the new execution framework that does not allow the user to interact with the attached JVMTI agent\u0027s console.  The user would have to select the console of the originally launched process to provide console input.  I\u0027ve opened the following defect against the new execution framework:\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d197297",
    "I\u0027ve tested patch 4 with jre 1.4.2 and 1.5.\nTried cases of both launch and attach using AC and IAC,\nsecurity on and off. \nLooks good.",
    "Fix checked into CVS - HEAD and 4.4.0.2 branch."
  ],
  "commentCreationDates": [
    "2007-05-18T05:47:00+02:00",
    "2007-05-18T15:48:23+02:00",
    "2007-05-18T15:51:24+02:00",
    "2007-05-18T21:21:07+02:00",
    "2007-05-18T21:24:35+02:00",
    "2007-05-22T22:30:17+02:00",
    "2007-05-23T17:16:37+02:00",
    "2007-05-23T17:22:46+02:00",
    "2007-05-23T17:33:05+02:00",
    "2007-05-23T17:33:20+02:00",
    "2007-05-23T18:18:01+02:00",
    "2007-07-11T21:32:31+02:00",
    "2007-07-12T07:51:13+02:00",
    "2007-07-12T12:13:47+02:00",
    "2007-07-13T16:36:32+02:00",
    "2007-07-13T17:52:57+02:00",
    "2007-07-17T20:21:36+02:00",
    "2007-07-17T20:25:58+02:00",
    "2007-07-19T00:38:20+02:00",
    "2007-07-19T17:28:16+02:00",
    "2007-07-19T19:25:02+02:00",
    "2007-07-19T22:39:03+02:00",
    "2007-07-19T23:37:32+02:00",
    "2007-07-20T16:01:25+02:00",
    "2007-07-20T17:07:44+02:00",
    "2007-07-23T20:20:53+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.tptp.platform.execution.exceptions.AgentControllerUnavailableException",
      "message": "Error: Unable to connect to the Agent Controller.Timeout while waiting for connection to complete",
      "elements": [
        {
          "method": "org.eclipse.tptp.platform.execution.client.core.internal.NodeImpl.connect",
          "source": "NodeImpl.java:146"
        },
        {
          "method": "org.eclipse.tptp.platform.jvmti.client.internal.launcher.util.AgentControllerDelegate$1$EstablishConnection.run",
          "source": "AgentControllerDelegate.java:155"
        },
        {
          "method": "java.lang.Thread.run",
          "source": "Thread.java:803"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "187744",
      "date": "2007-05-18T05:47:00+02:00",
      "product": "TPTP Profiling",
      "component": "Platform.UI",
      "severity": "critical"
    }
  ],
  "groupId": "187744",
  "bugId": "187744",
  "date": "2007-05-18T05:47:00+02:00",
  "product": "TPTP Profiling",
  "component": "Platform.UI",
  "severity": "critical"
}