{
  "comments": [
    "Description:\nFirstly, we should make sure the measure has been used in crosstab, and we removed the measure from crosstab, then remove it from cube. Because of the measure has been used in crosstab, so the binding of measure are still in crosstab whether the measure has been removed from crosstab. But, if remove the measure from the cube, the binding are still in crosstab, it will lead the \"can not found the measure\" exception when preview. The user must remove the binding by himself to make sure the preview successfully. So I hope GUI can make some enhance when remove the measure from cube, all the measure\u0027s binding of crosstab also removed automatically.\n\nBuild number: \n2.2.0.v20070522-0630\n\nSteps to reproduce:\n1, New a crosstab with two measures: m1 and m2\n2, Remove the m1 from crosstab\n3, Preview\n4, Remove the m1 from cube\n5, Preview\n\nExpected result:\nAfter step4, all the m1\u0027s binding in crosstab has been removed and after step5, the preview is successful\n\nActual result:\nAfter step4, all the m1\u0027s binding are still in crosstab\u0027s databinding, and after step5, exception occurs.\n\nError log:\nThe measure name \"QUANTITYORDERED\" is not found. \nThe measure name \"QUANTITYORDERED\" is not found. ( 1 time(s) )\ndetail : org.eclipse.birt.data.engine.core.DataException: The measure name \"QUANTITYORDERED\" is not found. at org.eclipse.birt.data.engine.olap.impl.query.CubeQueryResults.getCubeCursor(CubeQueryResults.java:82) at org.eclipse.birt.report.engine.data.dte.CubeResultSet.\u003cinit\u003e(CubeResultSet.java:78) at org.eclipse.birt.report.engine.data.dte.DteDataEngine.doExecuteCube(DteDataEngine.java:234) at org.eclipse.birt.report.engine.data.dte.DteDataEngine.doExecuteQuery(DteDataEngine.java:120) at org.eclipse.birt.report.engine.data.dte.AbstractDataEngine.execute(AbstractDataEngine.java:178) at org.eclipse.birt.report.engine.executor.ExecutorManager$ExecutorContext.executeQuery(ExecutorManager.java:403) at org.eclipse.birt.report.item.crosstab.core.re.executor.BaseCrosstabExecutor.executeQuery(BaseCrosstabExecutor.java:92) at org.eclipse.birt.report.item.crosstab.core.re.executor.CrosstabReportItemExecutor.execute(CrosstabReportItemExecutor.java:101) at org.eclipse.birt.report.engine.executor.ExtendedItemExecutor.execute(ExtendedItemExecutor.java:57) at org.eclipse.birt.report.engine.internal.executor.wrap.WrappedReportItemExecutor.execute(WrappedReportItemExecutor.java:45) at org.eclipse.birt.report.engine.internal.executor.dup.SuppressDuplicateItemExecutor.execute(SuppressDuplicateItemExecutor.java:42) at org.eclipse.birt.report.engine.internal.executor.wrap.WrappedReportItemExecutor.execute(WrappedReportItemExecutor",
    "What Model can do is when the measure is removed from Cube, we will remove the xtab-Meausre which reference the cube_measure for user. But for those columnbinding expressions, are old issue like before we met, Model does not know anything about the expression. Only DtE can provide some way to detect which expression string is related to which measure/dimension/level. So, if we want to support this, we need DtE API to scan the whole binding list when user do the delete action. This cost time need to consider whether we should support for 2.2.  ",
    "I suggest we do not auto remove the bindings.  Instead DtE or engine shall catch this exception, log it, but continue the process of the xtab.  If the crosstab happens to still use this binding, show an invalid value string on the crosstab.   schedule for 2.2 RC2 for catching this solution.",
    "Can DtE or Engine support this? As I understanding, the error should not show on the report, but give user an error log file. If there is error, then generate the log file, if no error no error log file. currently Engine show the error on the report directly. ",
    "The current behavior of DtE for both xtab/table is that, when an invalid binding is used, and the error in the binding is detectable in design time(say, reference to an in-exist binding, or recursive bindings), we will throw exception to prevent the report from execution. If the problem will only occurs in runtime, we will cache the exception and pass exception to engine at the end of query. Under this circumstance the report design can still be generated, meanwhile the exception info will be displayed at the bottom of generated report.\n\nIf in xtab we doesn\u0027t throw exception, instead, simply log an exception, then for xtab and table we will have different behaviors. And it is not easy to change table behavior at this time point.\n\nAs my suggestion to this problem, we may either\n1)Ask user manually correct the binding\nor\n2)DtE provide API for Model to remove the bindings that involved with measure that created. However this would not be an ideal solution for user might want to keep the invalid bindings.\n\n",
    "To make XTab consistent with table, we do not need to automatically remove bindings (in table case, deleting a data item does not automatically remove that item\u0027s binding). \n\nDTE\u0027s current error handling logic should be OK. We have an outstanding Bugzilla to have Engine to improve the way that binding evaluation errors are displayed (BUG 184137). This should address Wenfeng\u0027s concerns.\n\nI think this Bugzilla can be canceled. We may however need to revisit this issue based on community feedback on the usability of XTab. I have a feeling that many less sophisticated BIRT users may not realize that deleting a data item will leave dangling bindings behind. \n",
    "(In reply to comment #5)\n\u003e To make XTab consistent with table, we do not need to automatically remove\n\u003e bindings (in table case, deleting a data item does not automatically remove\n\u003e that item\u0027s binding). \nYes, In some behavior XTab is consistent with table, but in some scenarios, they are not. \nFirst,If we remove a column from dataset, the preview of table should be failed(column xxx is not found). But now if we remove the measure in cube(make sure the crosstab has not subtotal and grandtotal), the preview is successful. It is not consistent with table.\nSecond, if the crosstab has some aggregation(subtotal and grandtotal) using the measure\u0027s binding. When we remove the measure in cube, the preview will be failed.\nSo above two scenarios, the XTab is not consistent with table. if we hope the table and XTab consistent, we will make sure this two scenarios consisitent between table and XTab\n\n---\n\u003e I have a feeling\nthat many less sophisticated BIRT users may not realize that deleting a data\nitem will leave dangling bindings behind. \n\nWhen a user delete the measure , so the measure\u0027s binding is useless for him, Ok,he will delete all the binding. But, in a complex crosstab, so many levels and so many dimensions, all the subtotals and grandtotals are specified and using the measure\u0027s binding. Should he deleted them one by one to make sure the preview successfully? I think a sophisticated BIRT users may not only create a simple crosstab with no subtotal and grandtotals. ",
    "Enhance the preparation time error checking so that bindings that reference to 1) In-exist dimension name 2) In-exist level name 3) In-exist aggregation functions will be detected and leads to exception with error message explicitly point out the binding of problem. ",
    "*** Bug 190100 has been marked as a duplicate of this bug. ***",
    "Closed\nRegards~"
  ],
  "commentCreationDates": [
    "2007-05-22T05:55:49+02:00",
    "2007-05-22T09:25:56+02:00",
    "2007-05-22T09:39:22+02:00",
    "2007-05-22T11:37:27+02:00",
    "2007-05-22T11:40:29+02:00",
    "2007-05-22T21:26:09+02:00",
    "2007-05-23T04:15:25+02:00",
    "2007-05-28T18:04:30+02:00",
    "2007-05-31T05:20:08+02:00",
    "2007-06-21T02:51:55+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.birt.data.engine.core.DataException",
      "message": "The measure name \"QUANTITYORDERED\" is not found.",
      "elements": [
        {
          "method": "org.eclipse.birt.data.engine.olap.impl.query.CubeQueryResults.getCubeCursor",
          "source": "CubeQueryResults.java:82"
        },
        {
          "method": "org.eclipse.birt.report.engine.data.dte.CubeResultSet.\u003cinit\u003e",
          "source": "CubeResultSet.java:78"
        },
        {
          "method": "org.eclipse.birt.report.engine.data.dte.DteDataEngine.doExecuteCube",
          "source": "DteDataEngine.java:234"
        },
        {
          "method": "org.eclipse.birt.report.engine.data.dte.DteDataEngine.doExecuteQuery",
          "source": "DteDataEngine.java:120"
        },
        {
          "method": "org.eclipse.birt.report.engine.data.dte.AbstractDataEngine.execute",
          "source": "AbstractDataEngine.java:178"
        },
        {
          "method": "org.eclipse.birt.report.engine.executor.ExecutorManager$ExecutorContext.executeQuery",
          "source": "ExecutorManager.java:403"
        },
        {
          "method": "org.eclipse.birt.report.item.crosstab.core.re.executor.BaseCrosstabExecutor.executeQuery",
          "source": "BaseCrosstabExecutor.java:92"
        },
        {
          "method": "org.eclipse.birt.report.item.crosstab.core.re.executor.CrosstabReportItemExecutor.execute",
          "source": "CrosstabReportItemExecutor.java:101"
        },
        {
          "method": "org.eclipse.birt.report.engine.executor.ExtendedItemExecutor.execute",
          "source": "ExtendedItemExecutor.java:57"
        },
        {
          "method": "org.eclipse.birt.report.engine.internal.executor.wrap.WrappedReportItemExecutor.execute",
          "source": "WrappedReportItemExecutor.java:45"
        },
        {
          "method": "org.eclipse.birt.report.engine.internal.executor.dup.SuppressDuplicateItemExecutor.execute",
          "source": "SuppressDuplicateItemExecutor.java:42"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "188204",
      "date": "2007-05-22T05:55:49+02:00",
      "product": "BIRT",
      "component": "Data",
      "severity": "major"
    }
  ],
  "groupId": "188204",
  "bugId": "188204",
  "date": "2007-05-22T05:55:49+02:00",
  "product": "BIRT",
  "component": "Data",
  "severity": "major"
}