{
  "comments": [
    "It looks like there is no comprehensive resource on how to put together the editors generated by EMF and GMF. I\u0027ve already got the basic setup working (see http://www.volker-wegert.de/emf-gmf-integration), but both the implementation and the article itself need some polishing. I\u0027d volunteer to write the article if enough people are interested in it.",
    "I\u0027ve added gmf.docs-inbox@eclipse.org to the CC list in hopes that somebody from GMF can comment on this bug. Ideally, we\u0027d like a committer to commit to reviewing and approving this article. Any takers?",
    "We can review. Note the linked article clearly says it is not done yet, so this Bugzilla looks more like a \"should I do an article\" rather than \"I have an article for review\". Let me know if I am incorrect.",
    "(In reply to comment #2)\n\u003e We can review. Note the linked article clearly says it is not done yet, so this\n\u003e Bugzilla looks more like a \"should I do an article\" rather than \"I have an\n\u003e article for review\". Let me know if I am incorrect.\n\nNope, that\u0027s it. I\u0027d like to write an article, but I\u0027d rather not spend the time unless I know someone\u0027s interested in this.\n\n",
    "It sounds like a useful idea to me.",
    "I\u0027m also interested. Thanks for considering taking the time.",
    "It looks like we have enough interest to take this to the next level. When can you have a first draft?",
    "As far as I can tell, I\u0027ll be able to spend the next weekend entirely on the article - I\u0027ll try to prepare a first draft for sunday evening (CEST, that is). I\u0027ll try to settle on a consistent structure first and then start to fill in the details. I can\u0027t really estimate how complete the first estimate will be.",
    "Created an attachment (id\u003d72836)\nfirst preliminary version\n\nFirst rough outline and some bits of text - in plain text format because I still haven\u0027t grokked this DocBook thing ;-)\n\nPlease don\u0027t bother to review the technical details yet, I still have to fill too many gaps. However, it would be great to know whether I\u0027ve got the \"detail level\" right - did I include too many technical details or too few? Apart from the \"big picture\" introduction at the beginning and the spots marked with TODO, are any other important parts missing?",
    "Created an attachment (id\u003d73221)\ndraft of article with associated files\n\nI\u0027ve uploaded an almost completed version of the article. One technical issue still needs resolving (waiting for reply on the GMF newsgroup), and the acknowledgements still need work, but the rest of the article is now more or less what I had in mind. I\u0027ve included the screenshots and zip files as well. The layout might still need some work, as well as the text itself - I\u0027m not a native speaker. I\u0027d appreciate any comments on this draft.",
    "I can help with spelling/grammar issues. If other reviewers can focus on content, that\u0027d be great (of course, fixing spelling and grammar is also helpful).\n\nIf nobody on the CC list can review, we\u0027ll have to try a little harder to find somebody. Any volunteers?",
    "I had a *very* brief look and it seems good at a glance, but I don\u0027t have the time to follow this in detail.  I wish I did.  :-(  It would be ideal if one of the many interested parties had the time to review this and to try out the scenarios to test them...\n",
    "What versions of EMF and GMF do you use? In the last few month a lot changed in GMF. Is it really necessary to store the diagram information together with the semantic model? This is really bad, because you one might want to have multiple graphical representations (ind multiple diagrams) of one sematic element. This is necessary to show different aspects of the semantic model (e.g. the hirarchy  in one diagram, the containment or the associations in an other one). ",
    "Mathias,\n\nAs far as I understand it, the semantic model can either be stored with the diagram model or separate from it; this question is often asked on the GMF newsgroup, i.e., it\u0027s kind of a FAQ although not in the FAQ, which is quite sparse: http://wiki.eclipse.org/Graphical_Modeling_Framework_FAQ",
    "(In reply to comment #12)\n\u003e What versions of EMF and GMF do you use? \n\nThe ones provided with the Release - EMF 2.3.0, GEF 3.3.0, GMF 2.0.\n\n\u003e In the last few month a lot changed in GMF. \n\nI know - I was partly a \"victim\" of these changes because I had to use the milestones for my bachelor thesis. :-)\n\n\u003e Is it really necessary to store the diagram information together with \n\u003e the semantic model? This is really bad, because you one might want to \n\u003e have multiple graphical representations (ind multiple diagrams) of one \n\u003e sematic element. This is necessary to show different aspects of the \n\u003e semantic model (e.g. the hirarchy in one diagram, the containment or \n\u003e the associations in an other one). \n\nI get your point, and I can see the benefits - however, I think this would require a more complex approach because you have to find out what other resources to load and distribute the inputs to the EditorParts. Interesting question...",
    "Hi,\n\n(In reply to comment #10)\n\u003e \n\u003e If nobody on the CC list can review, we\u0027ll have to try a little harder to find\n\u003e somebody. Any volunteers?\n\u003e \n\nI\u0027m working on an RCP app which uses EMF and GMF extensively, and I am working on integrating the two.  (Though in a way significantly different from Volker.)\n\nI\u0027ve already started to look at his article, try out some of his ideas and take some notes.  I\u0027d be glad to review it from a technical standpoint, and I\u0027ll fix language issues along the way.  Shall I simply propose changes and post the relevant diffs here?",
    "Is there any progress on this one?",
    "(In reply to comment #15)\n\n\u003e I\u0027ve already started to look at his article, try out some of his ideas and take\n\u003e some notes.  I\u0027d be glad to review it from a technical standpoint, and I\u0027ll fix\n\u003e language issues along the way.  Shall I simply propose changes and post the\n\u003e relevant diffs here?\n\u003e \n\nHi Andrew. I apologise for not answering \"yes\" to your question. Can you still do the review?",
    "(In reply to comment #17)\n\u003e Hi Andrew. I apologise for not answering \"yes\" to your question. Can you still\n\u003e do the review?\n\u003e \n\nHi Wayne,  I\u0027ll try to do the complete review this weekend.  Expect to hear from me soon.",
    "Hi everyone,\n\n\u003e Hi Wayne,  I\u0027ll try to do the complete review this weekend.  Expect to hear\n\u003e from me soon.\n\u003e \n\nMy powers of estimation are quite bad.  I started it that weekend, continued it the following weekend, but haven\u0027t yet finished the review.  I\u0027m hoping I may be able to finish it this week.  Sorry this is taking so long!\n\nAndrew\n",
    "(In reply to comment #9)\n\u003e Created an attachment (id\u003d73221) [details]\n\u003e draft of article with associated files\n\u003e \n\u003e I\u0027ve uploaded an almost completed version of the article. One technical issue\n\u003e still needs resolving (waiting for reply on the GMF newsgroup), and the\n\u003e acknowledgements still need work, but the rest of the article is now more or\n\u003e less what I had in mind. I\u0027ve included the screenshots and zip files as well.\n\u003e The layout might still need some work, as well as the text itself - I\u0027m not a\n\u003e native speaker. I\u0027d appreciate any comments on this draft.\n\u003e \n\nI\u0027m a big fan of this initiative, since we\u0027re trying to do something similar here at work. The article has started great, and I\u0027m offering my limited experience to get this work up to speed.\n\nI have tried to follow the steps to combine my two editors and have some comments, which I hope is okay to share this way.\n\nConsider mentioning the change made for the selection viewer in handleContentOutlineSelection:\n\t// If it\u0027s the selection viewer, then we want it to select the same selection as this selection.\n\t//\n\tif (getActiveEditor() \u003d\u003d selectionEditorPart) {\n\nConsider listing current known problems with (or open issues of) this solution, similar to Open Issues in http://www.volker-wegert.de/emf-gmf-integration\n\nRunning on the Europa release (feature versions listed at the bottom of this posting), I experienced the following problems with the \"final state\" version of the example:\n- When clicking the Diagram page tab to bring up the TopicMap Diagram Editor, and when after that clicking an item in the outline, an exception occurs:\n\tjava.lang.ClassCastException: org.example.emfgmf.topicmap.diagram.part.TopicMapDiagramEditor\n\t\tat org.example.emfgmf.topicmap.presentation.TopicmapEditor.handleContentOutlineSelection(TopicmapEditor.java:1087)\n  Perhaps a guard that the active editor isn\u0027t diagramEditor could be used.\n- A stack overflow occurs when creating a Topic (or an Association) in the TopicMap Diagram Editor\n\tUnhandled event loop exception\n\tjava.lang.StackOverflowError\n\t\tat org.eclipse.core.runtime.ProgressMonitorWrapper.internalWorked(ProgressMonitorWrapper.java:94)\n\t\tat org.eclipse.core.runtime.SubProgressMonitor.internalWorked(SubProgressMonitor.java:155)\n\t\tat org.eclipse.core.runtime.ProgressMonitorWrapper.internalWorked(ProgressMonitorWrapper.java:94)\n\t\tat org.eclipse.core.runtime.SubProgressMonitor.internalWorked(SubProgressMonitor.java:155)\n\t\t...\n   It seems objects are created in an endless loop. The TopicCreateCommand is created in a single instance but executed in the endless loop.\n\nRegards\nJ?rgen Strandberg\n\nEclipse Modeling Framework (EMF) \nVersion: 2.3.0.v200706262000\nBuild id: 200706262000\n\nEclipse Graphical Editing Framework\nVersion: 3.3.0.v20070620\nBuild id: 20070620-1021\n\nEclipse Graphical Modeling Framework (GMF) \nVersion: 1.0.100.v20070601-1400-7d-ETeEYjiMWQX3az0fBWRjypkm7\nBuild id: 2.0RC4\n",
    "(In reply to comment #20)\n\u003e Consider mentioning the change made for the selection viewer in\n\u003e handleContentOutlineSelection:\n\u003e         // If it\u0027s the selection viewer, then we want it to select the same\n\u003e selection as this selection.\n\u003e         //\n\u003e         if (getActiveEditor() \u003d\u003d selectionEditorPart) {\n\nYep, missed that one. Actually it\u0027s already in the article, I just didn\u0027t highlight this part of the code. Fixed that. \n\n\u003e Consider listing current known problems with (or open issues of) \n\u003e this solution, similar to Open Issues in \n\u003e http://www.volker-wegert.de/emf-gmf-integration\n\nI hope there won\u0027t be any, but I\u0027ve reserved a separate section for this now.\n\n\u003e Running on the Europa release (feature versions listed at the bottom of this\n\u003e posting), I experienced the following problems with the \"final state\" version\n\u003e of the example:\n\u003e - When clicking the Diagram page tab to bring up the TopicMap Diagram Editor,\n\u003e and when after that clicking an item in the outline, an exception occurs:\n\u003e [...]\n\u003e   Perhaps a guard that the active editor isn\u0027t diagramEditor could be used.\n\nI\u0027d rather get the outline working with both diagram and non-diagram editor parts - still working on that.\n\n\u003e - A stack overflow occurs when creating a Topic (or an Association) in the\n\u003e TopicMap Diagram Editor\n\u003e [...]\n\u003e    It seems objects are created in an endless loop. The TopicCreateCommand is\n\u003e created in a single instance but executed in the endless loop.\n\nConfirmed. I don\u0027t yet understand what\u0027s going wrong inside the command handling, but I\u0027ll take a look at it.",
    "(In reply to comment #0)\n\u003e It looks like there is no comprehensive resource on how to put together the\n\u003e editors generated by EMF and GMF. I\u0027ve already got the basic setup working (see\n\u003e http://www.volker-wegert.de/emf-gmf-integration), but both the implementation\n\u003e and the article itself need some polishing. I\u0027d volunteer to write the article\n\u003e if enough people are interested in it.\n\nIn article.html you have to correct the link to TabbedProperties.png (a \"b\" is missing in the html).\nThen I\u0027d like to see a \"RCP version\" of your article and it would be great if the Eclipse Team integrate this in gmfgen.\n\nRegards\n\nGiovanni Quarella",
    "Created an attachment (id\u003d80822)\nupdated draft of article with associated files\n\nUpdated draft - the typo mentioned in comment #22 is fixed, and the stack overflow is gone, too. Many thanks to Alex for helping out on various issues.\n\nI\u0027m not sure what would be different for \"an RCP version\" of this article, but I\u0027d be glad to get the article completed in the first place. As for this being integrated into the standard GMF tools - this is way (WAY) outside of what I could accomplish. If you want this, you\u0027re probably better off filing your own bug/enhancement request for this.",
    "(In reply to comment #23)\n\u003e Created an attachment (id\u003d80822) [details]\n\u003e updated draft of article with associated files\n\u003e Updated draft - the typo mentioned in comment #22 is fixed, and the stack\n\u003e overflow is gone, too. Many thanks to Alex for helping out on various issues.\n\u003e I\u0027m not sure what would be different for \"an RCP version\" of this article, but\n\u003e I\u0027d be glad to get the article completed in the first place. As for this being\n\u003e integrated into the standard GMF tools - this is way (WAY) outside of what I\n\u003e could accomplish. If you want this, you\u0027re probably better off filing your own\n\u003e bug/enhancement request for this.\n\nIn the article it would be better to move the css in the same folder of the HTML.\n\nIn a RCP version, beside extending org.eclipse.core.runtime.applications, you have to avoid all dependencies to ide plugins, so avoid e.g. \nIFileEditorInput\nFileEditorInputProxy\nResourcesPlugin\n\nI hope this help to improve your good article. I just add my vote.\n",
    "In EMF 2.3 we added EditUIUtil.getURI(IEditorInput) that\u0027s very handy for processing many types of editor input in the same way and still have it work for RCP and IDE.",
    "And I should probably mention that EMF does generate an RCP editor:\n\nhttp://www.eclipse.org/articles/Article-EMF-goes-RCP/rcp.html\n\nI just suspect that GMF doesn\u0027t support RCP, but I could be wrong...",
    "(In reply to comment #26)\n\u003e And I should probably mention that EMF does generate an RCP editor:\n\u003e http://www.eclipse.org/articles/Article-EMF-goes-RCP/rcp.html\n\u003e I just suspect that GMF doesn\u0027t support RCP, but I could be wrong...\n\nGMF support RCP. If you use GMF Dashboard, check RCP and you\u0027ll have \"Gen Application TopicmapApplication\" under Gen Editor in gmfgen file.\n\n",
    "(In reply to comment #23)\n\u003e Created an attachment (id\u003d80822) [details]\n\u003e updated draft of article with associated files\n\u003e Updated draft - the typo mentioned in comment #22 is fixed, and the stack\n\u003e overflow is gone, too. Many thanks to Alex for helping out on various issues.\n\u003e I\u0027m not sure what would be different for \"an RCP version\" of this article, but\n\u003e I\u0027d be glad to get the article completed in the first place. As for this being\n\u003e integrated into the standard GMF tools - this is way (WAY) outside of what I\n\u003e could accomplish. If you want this, you\u0027re probably better off filing your own\n\u003e bug/enhancement request for this.\n\nI\u0027m trying your code (Eclipse 3.3 and 3.4 with last Milestone), but TopicmapEditor doesn\u0027t appear because TopicMapDiagramEditor is registered as Editor for the same extension and in my case takes precedence. So in\n-------------------------------------------\n\u003cextension point\u003d\"org.eclipse.ui.editors\"\u003e\n      \u003c?gmfgen generated\u003d\"true\"?\u003e\n      \u003ceditor\n         id\u003d\"org.example.emfgmf.topicmap.diagram.part.TopicMapDiagramEditorID\"\n         name\u003d\"%editorName\"\n         icon\u003d\"icons/obj16/TopicmapDiagramFile.gif\"\n*********************************\n         extensions\u003d\"topicmap2\"\n**********************************\n         default\u003d\"true\"\n         class\u003d\"org.example.emfgmf.topicmap.diagram.part.TopicMapDiagramEditor\"\n         matchingStrategy\u003d\"org.example.emfgmf.topicmap.diagram.part.TopicMapMatchingStrategy\"\n         contributorClass\u003d\"org.example.emfgmf.topicmap.diagram.part.TopicMapDiagramActionBarContributor\"\u003e\n      \u003c/editor\u003e\n   \u003c/extension\u003e\n----------------------------------------\n\nchange extension name or better remove this extension.\n\nAnyway I\u0027m not so expert in EMF and less in GMF, so I must study a way to see in the tree view (Selection) only the semantic part of the model, because for the notation part you should use only the Diagram page of the editor.\n\nIn your article I read:\n---------------------------\n Change the property Same File for Diagram And Model to true and change diagram file extension to match the domain file extension - if you skip this, things will get a bit more complicated later\n-------------------------------------\n\nbut it miss an implementation with two distinct file, this way the wizard \"Topicmap model\" would not generate the error  \"Resource contains no diagram\".\n\n\n\n",
    "(In reply to comment #25)\n\u003e In EMF 2.3 we added EditUIUtil.getURI(IEditorInput) that\u0027s very handy for\n\u003e processing many types of editor input in the same way and still have it work\n\u003e for RCP and IDE.\n\nSo instead of\n\n IEditorInput input \u003d editorInput;\n    if (input instanceof IFileEditorInput) {\n      input \u003d new FileEditorInputProxy((IFileEditorInput)input, (TransactionalEditingDomain) editingDomain);\n    }\n\nwhat should I use?\n\nThanks",
    "I didn\u0027t know they used that pattern.  For RCP that pattern would require the use of the Eclipse resource APIs and RCP applications don\u0027t typically use a workspace.",
    "(In reply to comment #29)\n\u003e what should I use?\nI suppose corresponding part of the article should be changed in near future. \nFor RCP application you can use URIEditorInput (as in the generated code) and I suggest creating your own EditorInput holding EditingDomaininstalce inside. This EditorInput should be passed to DiagramEditor as a parameter of setInput() method.\n",
    "(In reply to comment #28)\n\u003e I\u0027m trying your code (Eclipse 3.3 and 3.4 with last Milestone), but\n\u003e TopicmapEditor doesn\u0027t appear because TopicMapDiagramEditor is registered as\n\u003e Editor for the same extension and in my case takes precedence. \n\nYou should be able to right-click the file in the explorer and choose the editor you want to use by selecting \"Open with\". \n\n\u003e Anyway I\u0027m not so expert in EMF and less in GMF, so I must study a way to see\n\u003e in the tree view (Selection) only the semantic part of the model, because for\n\u003e the notation part you should use only the Diagram page of the editor.\n\nSee TopicmapEditor.getContentOutlinePage - you will probably have to hand a different content provider to the contentOutlineViewer.\n\n\u003e In your article I read:\n\u003e ---------------------------\n\u003e  Change the property Same File for Diagram And Model to true and change diagram\n\u003e file extension to match the domain file extension - if you skip this, things\n\u003e will get a bit more complicated later\n\u003e -------------------------------------\n\u003e \n\u003e but it miss an implementation with two distinct file, this way the wizard\n\u003e \"Topicmap model\" would not generate the error  \"Resource contains no diagram\".\n\nYep, but you would have to read multiple files, wrap them up in some Resource and distribute things nicely among the editors. It\u0027s not impossible, just way more complicated. I originally set out to outline the principle, not to deliver a solution.\n\nTo be honest, I\u0027d like to get this article finished ASAP - I\u0027ll see what I can do during the next days. I\u0027m not sure whether we (Alex and I) will be able to cover every aspect of the integration in detail, but that\u0027s why we\u0027re writing an article and not a book. I have yet to see any Eclipse Corner article that does not leave some questions waiting to be answered. I could very well imagine this article not touching the entire RCP scenario and leaving something to write for someone who knows more about this :-)",
    "Nice article, helpful suggestions.\n\nUnfortunately, it doesn\u0027t extend to a TextEditor or multiple diagram editors.\n\nThe first problem is that existing editors may be part of an existing EditorPart inheritance hierarchy and so cannot all extend the shared concrete TopicMapEditorPart.\n\nFor my UMLX editor which has multi-sheet diagrams/trees/text and a multiplicity of saveable files, I introduced an additional IPageManager hierarchy to mediate between the MultiPageEditorPart and the individual EditorParts. The amorphous handleContentOutlineSelection can be resolved by activePageManager.setSelectionFromOutline(). Problems with diverse undoContexts and save-abilities can be similarly delegated.\n\nThe second problem is that you have to fudge getting the tabbed properties to work. Your fudge is fine for a narrow EMF extension of GMF, but is there any way to make tabbed properties extensible? For instance if I want to have an application that supports two different independent third party diagram editors, I cannot have my composite application offer the contributorId of both contributions, so only one of the property sets can work, and I have to put my properties into the contributorId of the one that I want to work. It seems that an editor needs to be able to offer a list of contributorIds; one for each re-used contribution and one for the re-using contribution.\n\nA page change is not a transaction in the generated EMF editor, so it is not reversed during an undo. This is at least surprising when you undo a sequence of commands and don\u0027t have the appropriate diagram/tree in which to view the changes.\n\n[The above comments are perhaps more applicable to version 2 or an article on integrating EMF + GMF + Text editors. Ideally, the EMF generated editor would advance to avoid the need for many of your solutions.]",
    "Created an attachment (id\u003d83807)\nfirst release candidate\n\nHeading for the first final farewell tour, I hope - this draft is what Alex and I think might be close to the final version of the article. Whatever additional reviews and adaptions are still necessary, please tell us. We don\u0027t really feel like extending the article beyond its current size (it\u0027s already more than twice as big as the original draft) or taking many more options into consideration, or we might as well start on that book. ;-)",
    "Thanks to Alex and Volker for this great article!\n\nI read through 75% of the article and have some comments:\n1) Contains german word: \"and list- oder tree-based\"\n2) Word \u0027editor\u0027 is misspelled: \"arbitrary multi-page e ditor\"\n3) Missing \u0027n\u0027 in many: \"there are may use cases\"\n4) Missing \u0027i\u0027 in \"capabilites\"\n5) ?? \"from a scratch\" should be \"from scratch\"\n6) Please include the @generated tag in the source code example as bold text, so the user notices it when browsing the source.\n   \"Don\u0027t forget to set the @generated tag\"\n7) Misspelled: \"Fortinately\"\n8) General: you\u0027re using a lot of \"(un)fortunately\"s\n\nAgain, many thanks to all you guys for writing this. I\u0027d love to try that out next time I need a EMF/GEF editor.\n",
    "I\u0027ve moved the article onto the server. You can find it here (everything but the zip files):\n\nhttp://www.eclipse.org/articles/article.php?file\u003dArticle-Integrating-EMF-GMF-Editors/index.html\n\nI\u0027ve applied the edits suggested by Mike and have started doing a editorial pass through the content.\n\nPlease post changes as either comments to this article, or as patches to the article content in CVS.\n\nIf possible, I\u0027d like to post this article on Eclipse Corner next week.",
    "I\u0027ve moved the article onto the server. You can find it here (everything but the zip files):\n\nhttp://www.eclipse.org/articles/article.php?file\u003dArticle-Integrating-EMF-GMF-Editors/index.html\n\nI\u0027ve applied the edits suggested by Mike and have started doing a editorial pass through the content.\n\nPlease post changes as either comments to this article, or as patches to the article content in CVS.\n\nIf possible, I\u0027d like to post this article on Eclipse Corner next week."
  ],
  "commentCreationDates": [
    "2007-05-28T12:42:10+02:00",
    "2007-05-28T17:06:24+02:00",
    "2007-05-28T17:32:11+02:00",
    "2007-05-28T17:41:10+02:00",
    "2007-06-16T18:44:18+02:00",
    "2007-06-17T08:53:05+02:00",
    "2007-06-21T17:47:09+02:00",
    "2007-06-25T22:35:55+02:00",
    "2007-07-01T22:40:03+02:00",
    "2007-07-06T23:00:21+02:00",
    "2007-07-09T20:53:21+02:00",
    "2007-07-12T18:04:41+02:00",
    "2007-07-13T09:00:33+02:00",
    "2007-07-13T13:04:45+02:00",
    "2007-07-13T19:14:31+02:00",
    "2007-07-14T00:18:19+02:00",
    "2007-08-22T20:16:38+02:00",
    "2007-08-23T21:17:28+02:00",
    "2007-08-24T03:21:37+02:00",
    "2007-09-08T23:12:22+02:00",
    "2007-09-27T08:51:51+02:00",
    "2007-10-06T13:27:40+02:00",
    "2007-10-20T12:02:05+02:00",
    "2007-10-20T17:17:47+02:00",
    "2007-10-20T21:33:41+02:00",
    "2007-10-20T22:00:30+02:00",
    "2007-10-20T22:02:15+02:00",
    "2007-10-20T23:18:18+02:00",
    "2007-10-20T23:25:45+02:00",
    "2007-10-21T00:14:04+02:00",
    "2007-10-21T13:28:29+02:00",
    "2007-10-22T12:10:41+02:00",
    "2007-11-15T20:13:56+01:00",
    "2007-11-23T08:40:03+01:00",
    "2007-11-26T20:47:01+01:00",
    "2007-11-27T08:08:41+01:00",
    "2007-12-13T14:36:59+01:00",
    "2007-12-13T14:51:22+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassCastException",
      "message": "org.example.emfgmf.topicmap.diagram.part.TopicMapDiagramEditor",
      "elements": [
        {
          "method": "org.example.emfgmf.topicmap.presentation.TopicmapEditor.handleContentOutlineSelection",
          "source": "TopicmapEditor.java:1087"
        }
      ],
      "number": 0,
      "commentIndex": 20,
      "bugId": "189399",
      "date": "2007-09-27T08:51:51+02:00",
      "product": "Community",
      "component": "Articles",
      "severity": "normal"
    },
    {
      "exceptionType": "java.lang.StackOverflowError",
      "elements": [
        {
          "method": "org.eclipse.core.runtime.ProgressMonitorWrapper.internalWorked",
          "source": "ProgressMonitorWrapper.java:94"
        },
        {
          "method": "org.eclipse.core.runtime.SubProgressMonitor.internalWorked",
          "source": "SubProgressMonitor.java:155"
        },
        {
          "method": "org.eclipse.core.runtime.ProgressMonitorWrapper.internalWorked",
          "source": "ProgressMonitorWrapper.java:94"
        },
        {
          "method": "org.eclipse.core.runtime.SubProgressMonitor.internalWorked",
          "source": "SubProgressMonitor.java:155"
        }
      ],
      "number": 1,
      "commentIndex": 20,
      "bugId": "189399",
      "date": "2007-09-27T08:51:51+02:00",
      "product": "Community",
      "component": "Articles",
      "severity": "normal"
    }
  ],
  "groupId": "189399",
  "bugId": "189399",
  "date": "2007-05-28T12:42:10+02:00",
  "product": "Community",
  "component": "Articles",
  "severity": "normal"
}