{
  "comments": [
    "eclipse-SDK-3.3RC2\n\nHave a CVS controlled project. Open a file in that project in the editor. Show the CVS History for that file. Have \"link with editor\" activated for history and package explorer.\n\nCLose that project in the package explorer. Observe following NPE:\n\njava.lang.NullPointerException\n\tat org.eclipse.team.internal.ccvs.core.resources.EclipseFile.getLogEntries(EclipseFile.java:287)\n\tat org.eclipse.team.internal.ccvs.core.filehistory.CVSFileHistory.refresh(CVSFileHistory.java:98)\n\tat org.eclipse.team.internal.ccvs.ui.CVSHistoryPage$RefreshCVSFileHistory.run(CVSHistoryPage.java:1319)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:55)",
    "Not critical for 3.3. We\u0027ll plan to address it for 3.3.1.",
    "What I\u0027ve observed while taking a closer look at the bug, is that after closing a project the situation described above is true only for some types of files (eg. all .java files are closed from a project being closed which result in reseting History view. In opposite to this, we have plugin.xml files for which closing their project will result in the NPE). I\u0027m not sure if I\u0027m making myself clear enough. Is it related to an editor used to edit a file, I\u0027m not sure of that either :)\n\nWhat I would try to do is to make sure that all editors for files from a closing project are actually closed in the end. Moreover, instead of clearing the History view for a file from the closed project I would display an empty History view (or at least remove the name of the closed file from the History view).",
    "*** Bug 190890 has been marked as a duplicate of this bug. ***",
    "For starters, would it be possible to make the CVSFileHistory.refresh method handle the null without causing an NPE? I think that would be enough at least for 3.3.1 and may even be good enough in the long run.",
    "Created an attachment (id\u003d72040)\nThe simplest solution\n\nWe will be still getting an error logged but the NPE won\u0027t be thrown any more. The error is logged because we are trying to get log entries for a managed file which has no parent (no RemoteFolder - the project is closed).\n\nI am open to suggestions.",
    "Created an attachment (id\u003d72041)\nmylar/context/zip\n\n",
    "I\u0027ve released the patch to HEAD. However, it may be better to avoid logging altogether. Perhaps you could check if the project.isAccessible in the CVSFileHistory#refresh method and, if it is not, avoid trying to fetch the log entries altogether.",
    "Created an attachment (id\u003d72150)\nPatch v2\n\nYou are right Michael, it does look better. Here is the patch.",
    "Patch looks good but there are two changes I would like to see:\n\n1) You need to add null checks to the ICVSFIle#getIResource call since that method can return null.\n\n2) Instead of preassigning the empty ILogEntry array, you could do it in a else. This saves the allocation of an empty array that is just thrown away most of the time.",
    "Created an attachment (id\u003d72344)\nPatch v3\n\n",
    "Patch released to HEAD. I will release it to 3.3.1 once Europa ships.",
    "This fix has probably caused bug 195412.",
    "Patch released to 3.3.1 with patch for bug 195412.",
    "*** Bug 198315 has been marked as a duplicate of this bug. ***",
    "VERIFIED",
    "VERIFIED in M20070815-0800,  I20070815-1600",
    "Are you sure Krzysiek that those patches are applied correctly on both maintenance and integration streams?",
    "Michael,\n\nSzymon is right. The patch \"Simplest solution\" has been released only to head.\n\n\nI have also noticed, that sometimes local history is accessible for the file, even if it is in closed project. I will investigate it more and open bug eventually.",
    "Are you saying that the exception in the original comment still occurs? Comment 13 indicates that the patch for this was integrated with the patch for bug 195412 so the code may look a bit different.",
    "Verified in  M20070905-1045 that the steps outlines in the original comment do not result in an NPE."
  ],
  "commentCreationDates": [
    "2007-06-01T12:06:21+02:00",
    "2007-06-01T18:11:46+02:00",
    "2007-06-20T15:11:05+02:00",
    "2007-06-20T15:15:39+02:00",
    "2007-06-20T17:55:14+02:00",
    "2007-06-21T16:12:29+02:00",
    "2007-06-21T16:12:33+02:00",
    "2007-06-21T16:52:18+02:00",
    "2007-06-22T12:14:14+02:00",
    "2007-06-22T14:29:45+02:00",
    "2007-06-25T14:06:08+02:00",
    "2007-06-25T15:54:42+02:00",
    "2007-07-04T18:20:00+02:00",
    "2007-07-09T17:51:55+02:00",
    "2007-07-30T21:20:48+02:00",
    "2007-08-16T16:23:49+02:00",
    "2007-08-17T17:06:45+02:00",
    "2007-08-22T15:48:52+02:00",
    "2007-08-23T11:26:07+02:00",
    "2007-08-30T18:52:53+02:00",
    "2007-09-06T15:20:43+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseFile.getLogEntries",
          "source": "EclipseFile.java:287"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.filehistory.CVSFileHistory.refresh",
          "source": "CVSFileHistory.java:98"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.CVSHistoryPage$RefreshCVSFileHistory.run",
          "source": "CVSHistoryPage.java:1319"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:55"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "190434",
      "date": "2007-06-01T12:06:21+02:00",
      "product": "Platform",
      "component": "CVS",
      "severity": "normal"
    }
  ],
  "groupId": "190434",
  "bugId": "190434",
  "date": "2007-06-01T12:06:21+02:00",
  "product": "Platform",
  "component": "CVS",
  "severity": "normal"
}