{
  "comments": [
    "I20070531-0800\n\nIf an attempt is made to start the help system in infocenter mode with a port that is in use, an error message is received on the command line (not a very nice one either - screenshot to follow), but the javaw process is not terminated and holds the lock on the workspace used (by default \"\u003ceclipse_home\u003e/workspace\").\n\nIf a second attempt is made to start the infocenter using the same workspace no error is thrown. The Java call will return right away when it finds the workspace is in use and does not inform the user of the reason.",
    "Created an attachment (id\u003d69689)\nScreenshot\n\nShows the error on the console when the port used to start the infocenter is occupied.",
    "I have made, but not yet committed changes to make the Webapp to exit cleanly when an error occurs. Before I commit I want to solicit opinions on how best to show the error message.\n\nThis is the error message from Jetty which displays on the console (in red), which in this case is not too informative:\n\nJul 19, 2007 11:15:07 AM org.mortbay.util.ThreadedServer start\nWARNING: Failed to start: SocketListener0@0.0.0.0:8082\n\nI also generate this message to the console:\n\nHelp web application could not start.  Check the log file at E:\\EclipseWorkspaces\\runtime-New_configuration\\.metadata\\.log for details.\n\nThe error in the log looks like this:\n\n!ENTRY org.eclipse.help.base 4 0 2007-07-19 11:09:20.419\n!MESSAGE Help cannot be displayed.  The embedded application server could not run help web application.\n!STACK 0\norg.osgi.service.cm.ConfigurationException: org.eclipse.equinox.http.jetty.JettyConfigurator.help : Multiple exceptions\n\tat org.eclipse.equinox.http.jetty.internal.HttpServerManager.updated(HttpServerManager.java:114)\n\tat org.eclipse.equinox.http.jetty.internal.Activator.startServer(Activator.java:208)\n......\nCaused by: org.mortbay.util.MultiException[java.net.BindException: Address already in use: NET_Bind]\n\nwhich is more useful.\n\nWe could suppress the error messages from jetty to the console but I think that it is better to let them continue to be displayed because they could contain important information. Adam, Simon, what do you think?",
    "I agree that we should not suppress Jetty errors. However, the only indication that the problem was a port in use is at the very bottom of the message hidden in the log.\n\nThis should be more prominent. Ideally it should be apparent what has happened in the command prompt and the log. If this is difficult or impossible, however I think it should at least be higher up (in the descriptive text) of the logged error.\n\nI just noticed actually that comment 0 seems to indicate a problem using the same workspace while the summary and comment 2 seem to discuss port conflicts. Are there two issues here?",
    "The second problem does not seem to show up once the first is fixed - it is possible to start the infocenter twice using the same workspace and different ports. This worked the same way in Eclipse 3.2. The infocenter makes very little use of the workspace so I don\u0027t think this needs to be changed."
  ],
  "commentCreationDates": [
    "2007-06-01T15:43:23+02:00",
    "2007-06-01T15:44:40+02:00",
    "2007-07-19T20:35:38+02:00",
    "2007-07-19T20:50:00+02:00",
    "2007-07-19T22:17:03+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.osgi.service.cm.ConfigurationException",
      "message": "org.eclipse.equinox.http.jetty.JettyConfigurator.help : Multiple exceptions",
      "elements": [
        {
          "method": "org.eclipse.equinox.http.jetty.internal.HttpServerManager.updated",
          "source": "HttpServerManager.java:114"
        },
        {
          "method": "org.eclipse.equinox.http.jetty.internal.Activator.startServer",
          "source": "Activator.java:208"
        }
      ],
      "number": 0,
      "commentIndex": 2,
      "bugId": "190470",
      "date": "2007-07-19T20:35:38+02:00",
      "product": "Platform",
      "component": "User Assistance",
      "severity": "normal"
    }
  ],
  "groupId": "190470",
  "bugId": "190470",
  "date": "2007-06-01T15:43:23+02:00",
  "product": "Platform",
  "component": "User Assistance",
  "severity": "normal"
}