{
  "comments": [
    "Driver:  WTP 2.0 0605 driver\n\nGo through Axis2 client with \"generate test case\" selected the first time is fine.  However, on the second time, I got the following exception since the \"test\" folder has been added to the build path already:\n\nIWAB0014E Unexpected exception occurred.\n  Build path contains duplicate entry: \u0027test\u0027 for project \u0027a2aNewClient\u0027\n      org.eclipse.core.commands.ExecutionException: Build path contains duplicate entry: \u0027test\u0027 for project \u0027a2aNewClient\u0027\n      at org.eclipse.jst.ws.axis2.consumption.core.command.Axis2ClientTestCaseIntegrateCommand.execute(Axis2ClientTestCaseIntegrateCommand.java:91)\n      at org.eclipse.wst.command.internal.env.core.fragment.CommandFragmentEngine.runCommand(CommandFragmentEngine.java:418)",
    "Suspect this would be very easy to fix.  Just check the existig classpath entry and only add the \"test\" directory if it\u0027s not already in classpath entry.  If the fix is simple, isolated and can be available by 06/11, we might consider including it in WTP 2.0 RC3 as this cause the Web service wizard to fail when \"generate test case\" is checked going through the wizard a second time.",
    "Agreed, if a fix arrives soon and is exceedingly simple and safe.",
    "Created an attachment (id\u003d70662)\nfix for the 191055\n\nYes I made it as an isolated one, the fixes are made to the Axis2ClientTestcaseIntegrationConnamd class. I have tested in windows with RC2.\n\nPlease review. \n\nThanks\n\nLahiru",
    "assigning the bug. patch ready. ",
    "Thanks for the patch!  I took a look at the patch.  It is now currently testing to make sure that the \"test\" directory is not in the classpath before adding the \"test\" directory and the \"junit.jar\" to the classpath.  It should check for classpath entry for \"test\" directory before adding the \"test\" directory and check for \"junit.jar\" before adding the \"junit.jar\" to the classpath.  The current patch would still run into problem if the user do not have the \"test\" directory in the classpath but already has junit.jar.",
    "Created an attachment (id\u003d70708)\nupdated fix \n\ninclude the fixes that kathy suggested.\n\nThank s\n\nLahiru",
    "Thanks for the patch!  \n\nThe Problem:\n\nWeb services wizard fails the 2nd time \"generate test case\" is selected for Axis2 client scenario because of duplicate classpath entry.\n\nSolution:\n\nMake sure the new classpath entries to be added are not there first before attempting to add.\n\nWorkaround:\n\nWithout the fix, the workaround would be to remove the classpath entries for the \"test\" directory and \"junit.jar\" before running the Axis2 client with \"generate test case\" option turned on if \"generate test case\" has been selected before.\n\nTesting:\n\nThe original problem was tested and verified.\n\nRisk:\n\nLow.  Fix isolated to 1 file.",
    "Lahiru, thanks for the patch. The change is safe and simple. Approved.\n\nNote: It appears the current logic copies and refreshes all classpath entries even when it determines no new classpath entries need to be added, which is the normal case. This is fairly minor and, in my opinion, not cause to change the patch given what we have now has been well tested and working. We can speed up this code however in 2.0.1.\n\nPMC, please review and approve for WTP 2.0 RC3. This bug renders the JUnit test generation feature effectively unusable.",
    "Patch committed and released to HEAD as v200706111424.",
    "(In reply to comment #9)\n\u003e Patch committed and released to HEAD as v200706111424.\n\u003e \n\nHi Kathy, \n\nI tested the committed patch with the updated source on self hosting with RC2 driver. Verified the fix. Closing the bug. \nThanks \n\nLahiru",
    "Verified on WTP 2.0 0613 driver."
  ],
  "commentCreationDates": [
    "2007-06-05T17:18:35+02:00",
    "2007-06-07T20:27:02+02:00",
    "2007-06-07T20:29:57+02:00",
    "2007-06-08T12:50:12+02:00",
    "2007-06-08T14:11:04+02:00",
    "2007-06-08T17:28:59+02:00",
    "2007-06-08T18:52:57+02:00",
    "2007-06-08T19:57:29+02:00",
    "2007-06-08T22:52:27+02:00",
    "2007-06-11T16:25:33+02:00",
    "2007-06-12T06:25:13+02:00",
    "2007-06-13T19:17:25+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.core.commands.ExecutionException",
      "message": "Build path contains duplicate entry: \u0027test\u0027 for project \u0027a2aNewClient\u0027",
      "elements": [
        {
          "method": "org.eclipse.jst.ws.axis2.consumption.core.command.Axis2ClientTestCaseIntegrateCommand.execute",
          "source": "Axis2ClientTestCaseIntegrateCommand.java:91"
        },
        {
          "method": "org.eclipse.wst.command.internal.env.core.fragment.CommandFragmentEngine.runCommand",
          "source": "CommandFragmentEngine.java:418"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "191055",
      "date": "2007-06-05T17:18:35+02:00",
      "product": "Web Tools",
      "component": "jst.ws",
      "severity": "major"
    }
  ],
  "groupId": "191055",
  "bugId": "191055",
  "date": "2007-06-05T17:18:35+02:00",
  "product": "Web Tools",
  "component": "jst.ws",
  "severity": "major"
}