{
  "comments": [
    "Build ID: TPTP-4.4.0-200705080100C\n\nEnviroments:\nEclipse SDK: 3.3M7\nWTP: wtp-S-2.0RC0-200705171455\n\nSteps To Reproduce:\n1. Create and configure a profile launch configuration for weblogic server 9.0 on profile configuration dialog window\n2. click profile button\n\nMore information:\nWhen I click profile button on Profile configuration dialog. Eclipse shows a error dialog. I found that eclipse\u0027s .log file has the following error logs information shown as below:\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n!ENTRY org.eclipse.core.jobs 4 2 2007-06-13 13:54:24.531\n!MESSAGE An internal error occurred during: \"Launching BEA Weblogic Server 9\".\n!STACK 0\njava.lang.NullPointerException\n\tat org.eclipse.jst.server.generic.internal.xml.Resolver.skipToProperty(Resolver.java:103)\n\tat org.eclipse.jst.server.generic.internal.xml.Resolver.resolvePropertiesFromCache(Resolver.java:90)\n\tat org.eclipse.jst.server.generic.internal.xml.Resolver.resolveProperties(Resolver.java:68)\n\tat org.eclipse.jst.server.generic.core.internal.GenericServerBehaviour.getStartClassName(GenericServerBehaviour.java:260)\n\tat org.eclipse.jst.server.generic.core.internal.GenericServerLaunchConfigurationDelegate.launch(GenericServerLaunchConfigurationDelegate.java:59)\n\tat org.eclipse.debug.internal.core.LaunchConfiguration.launch(LaunchConfiguration.java:766)\n\tat org.eclipse.debug.internal.core.LaunchConfiguration.launch(LaunchConfiguration.java:608)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch(DebugUIPlugin.java:899)\n\tat org.eclipse.debug.internal.ui.DebugUIPlugin$7.run(DebugUIPlugin.java:1102)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:55)\n\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\n\nWebLogic can be started successfully in running mode, but cannot be started in profiling mode.\n\nAlso, I have tested TPTP-4.3.1-200702221346 build, it reports the same error.",
    "Created an attachment (id\u003d71122)\nlaunch weblogic error dialog in profile mode\n\nError dialog when launching weblogic server in profile mode",
    "Eugene - FYI, the WebLogic server adapter is not part of WTP, it is hosted on a BEA update site.\n\nKonstantin - Do you have anyone who can take a look at this, or should it be transferred to a BEA bug system?\n\nGorkem - Generic issue perhaps?",
    "Thanks Tim for your help on triaging the problem.",
    "Danny,\n\nCould you check to see if this issue is also present in the WLS 9.0 adapter that we will be releasing this summer? It it is, could you create an internal bug to track this. \n",
    "This is a dup of: https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d148599\n\nI had marked that as an enhancement and left open for futher investigation, see comment #5 but closed when the WLS adatpers were moved out of WTP; Danny: I\u0027ll let you comment more or just close as a dup.",
    "I think there is more fundamental issue here: the WLS generic server type extensions only specify support for \"run\" and \"debug\" modes (given the current lack of profiling support); so, ideally one should not be able to create such a profiling configuration for the WLS 9.2 generic server (and hit that NPE).\n\nThis looks like it might be an issue with the generic server framework since the launch config delegate class GenericServerLaunchConfigurationDelegate is being returned and the correct delegate class for the WLS generic type is ExternalLaunchConfigurationDelegate.\n\nGorkem: can you comment?",
    "Profiling external generic servers is not possible and Profile option is disabled in the WTP server view for those servers. But it looks like we have missed the create launch configuration dialog. Currently all generic servers use the same UI element for the launch configuration dialog and it allows creation of a launch configuration for Weblogic with GenericServerLaunchConfigurationDelegate (where it should have been ExternalLaunchConfigurationDelegate as Rob noted). I am in the process of separating the UI dialog for ExternalLaunchConfigurationDelegate in order to resolve some other problems as well, I will also take this case along with them.",
    "If profiling is not possible, please change this into enhancement. It would be very good to leverage TPTP profiling capabilities.\n\nEspecially that, profiling does work with WLS, with added options JAVA_OPTIONS\u003d\"-XrunpiAgent:server\u003denabled\".\n\nGorkem, please tell why is it actually impossible to profile external servers? From my point of view, it would be better to enable profiling by default and let extending adapters actually decide, if they support it or not. Even if they are wrapped by some scripts, they are still java and can be profiled with added additional parameters, that enable JVMPI.\nWhat do you think?",
    "btw, IBM needs this (profiling external) for 1.5.x, should I open a separate bugzilla?",
    "Created an attachment (id\u003d72767)\nexemplary profiling support\n\nI\u0027ve played a little bit with enabling profiling and came to a very small piece of code that would probably enable it. I look for your comments.\n\nIt\u0027s for version 1.5.4",
    "Created an attachment (id\u003d72768)\nexemplary profiling, continued\n\nWLS specific part.\nAgain 1.5.4",
    "Thanks for taking a closer look at the issue, Jacek\n\nI\u0027ll take a closer look at your patches but I also think that separating this bug into two separate bugs makes sense:\n\n-one to enable profiing support for external generic servers (sounds like this what you need in 1.5.5 - is that correct?)\n\n-one for WLS profiling support (unless there is a 1.5.5 need for this, the issue would be addressed in the context of the downloadable WLS server adatpers)",
    "I am not sure if it is practical to have profiling support for an external server.   An external server means that the java process that the server runs on is setup via a script, or executable. As a result any of the VM parameters, classpath etc set by the launch configuration is not valid because they are actually set by the delegating script/executable. Enabling profiling would mean that we expect the server provided scripts to always start the VM with appropriate parameters.",
    "Gorkem, I generally agree with you - there is a potential argument for enabling the mode in general and then having things only work if specific external servers could support it - for the WLS adapters, you can pass through JVM commandline args via the JAVA_OPTIONS env var (which is currently set in the serverdef file) \n\nTook a look at and tried out those patches with 1.5.x and TPTP and I\u0027m seeing/encountering a number of issues/additional complexities with those patches as written: this patch creates the debugging launch config when the mode is profiling and JAVA_OPTIONS is set to the profiling arg (that logic needs to be changed to not overwrite the existing JAVA_OPTIONS values set in the serverdef file) but that launch config working copy is never used...; in the debugging case, the ExternalServerBehavior waits until the external process is started and then uses that debugging launch config to launch the debugging ExternalDebugLaunchConfigurationDelegate - not certain exactly what would need to be done for profiling... \n\nJacek: had you been able to successfully profile a deployed application on WLS with TPTP with those patches?\n \nI\u0027m going to go ahead and change the title of this bugzilla to cover the underlying support for profiling of external generic servers - we can clone off a separate, dependent, bugzilla for WLS adapters once the issues here are further clarified (how the WLS one is handled will also depend on the target release)\n\n\n\n",
    "Gorkem, Rob,\nyes, I did succeeded with this patch to launch profiling. However I have additional settings that need to be set: i am running an agent controller (v.4.2.2) and I have it\u0027s bin/ directory in PATH env var.\n\nAfter launching, Eclipse prompted to choose the profiling agent (I selected Execution Time analysis) and suggested to switch to Profiling and Logging perspective. Then after pressing \"Start Monitoring\" it collected some data, that looked reasonably for me (stats for weblogic.* packages).\n\nI agree with you that JAVA_OPTIONS should be combined with those from serverdef, however I\u0027ve seen that default startWebLogic.cmd adds very similar options and that\u0027s why I skipped this.\n\nI must have missed something if profiling starts debugging launch, i\u0027ll try\nto fix this in next patch.\n\nI\u0027ve created separate bugzillas for 1.5.x, so we can continue discussion there:\nbug 195054 - generic profiling, \nbug 195055 - WLS specific.\n\n\n(In reply to comment #14)\n\u003e Gorkem, I generally agree with you - there is a potential argument for enabling\n\u003e the mode in general and then having things only work if specific external\n\u003e servers could support it - for the WLS adapters, you can pass through JVM\n\u003e commandline args via the JAVA_OPTIONS env var (which is currently set in the\n\u003e serverdef file) \n\u003e \n\u003e Took a look at and tried out those patches with 1.5.x and TPTP and I\u0027m\n\u003e seeing/encountering a number of issues/additional complexities with those\n\u003e patches as written: this patch creates the debugging launch config when the\n\u003e mode is profiling and JAVA_OPTIONS is set to the profiling arg (that logic\n\u003e needs to be changed to not overwrite the existing JAVA_OPTIONS values set in\n\u003e the serverdef file) but that launch config working copy is never used...; in\n\u003e the debugging case, the ExternalServerBehavior waits until the external process\n\u003e is started and then uses that debugging launch config to launch the debugging\n\u003e ExternalDebugLaunchConfigurationDelegate - not certain exactly what would need\n\u003e to be done for profiling... \n\u003e \n\u003e Jacek: had you been able to successfully profile a deployed application on WLS\n\u003e with TPTP with those patches?\n\u003e \n\u003e I\u0027m going to go ahead and change the title of this bugzilla to cover the\n\u003e underlying support for profiling of external generic servers - we can clone off\n\u003e a separate, dependent, bugzilla for WLS adapters once the issues here are\n\u003e further clarified (how the WLS one is handled will also depend on the target\n\u003e release)\n\u003e \n\n",
    "I have dropped a fix to HEAD that separates UI for external servers. This fixes the problem at hand. I am closing this bug report since there are new ones for adding profiling support."
  ],
  "commentCreationDates": [
    "2007-06-13T08:16:02+02:00",
    "2007-06-13T08:23:25+02:00",
    "2007-06-13T16:47:39+02:00",
    "2007-06-13T16:53:51+02:00",
    "2007-06-13T16:55:10+02:00",
    "2007-06-13T17:08:26+02:00",
    "2007-06-13T17:59:34+02:00",
    "2007-06-24T14:05:45+02:00",
    "2007-06-29T11:39:02+02:00",
    "2007-06-29T12:03:18+02:00",
    "2007-06-29T13:42:43+02:00",
    "2007-06-29T13:44:00+02:00",
    "2007-06-29T16:29:32+02:00",
    "2007-06-29T16:58:49+02:00",
    "2007-06-29T17:31:36+02:00",
    "2007-07-01T17:21:06+02:00",
    "2007-07-01T23:07:33+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.jst.server.generic.internal.xml.Resolver.skipToProperty",
          "source": "Resolver.java:103"
        },
        {
          "method": "org.eclipse.jst.server.generic.internal.xml.Resolver.resolvePropertiesFromCache",
          "source": "Resolver.java:90"
        },
        {
          "method": "org.eclipse.jst.server.generic.internal.xml.Resolver.resolveProperties",
          "source": "Resolver.java:68"
        },
        {
          "method": "org.eclipse.jst.server.generic.core.internal.GenericServerBehaviour.getStartClassName",
          "source": "GenericServerBehaviour.java:260"
        },
        {
          "method": "org.eclipse.jst.server.generic.core.internal.GenericServerLaunchConfigurationDelegate.launch",
          "source": "GenericServerLaunchConfigurationDelegate.java:59"
        },
        {
          "method": "org.eclipse.debug.internal.core.LaunchConfiguration.launch",
          "source": "LaunchConfiguration.java:766"
        },
        {
          "method": "org.eclipse.debug.internal.core.LaunchConfiguration.launch",
          "source": "LaunchConfiguration.java:608"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin.buildAndLaunch",
          "source": "DebugUIPlugin.java:899"
        },
        {
          "method": "org.eclipse.debug.internal.ui.DebugUIPlugin$7.run",
          "source": "DebugUIPlugin.java:1102"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:55"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "192340",
      "date": "2007-06-13T08:16:02+02:00",
      "product": "Web Tools",
      "component": "jst.server",
      "severity": "normal"
    }
  ],
  "groupId": "192340",
  "bugId": "192340",
  "date": "2007-06-13T08:16:02+02:00",
  "product": "Web Tools",
  "component": "jst.server",
  "severity": "normal"
}