{
  "comments": [
    "When i try to add new task to a task repository i get the following message: \"Unable to submit at this time. Check connectivity and retry.\" and nothing change, but when i synchronize the category the new bug appears on it.\n\nMy smtp server is not working for my bugzilla and every time when i submit a bug i a get and error in the bugzilla web page but the bug is submitted.\n\nThe url ns/bugzilla is working fine and when i was creating the task repository the validate settings was valid too.\n\nI\u0027m using eclipse 3.3.0, Mylyn 2.0 and bugzilla 3.0\n\nThis is the error:\neclipse.buildId\u003dI20070625-1500\njava.version\u003d1.6.0\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dwin32, ARCH\u003dx86, WS\u003dwin32, NL\u003den_US\nCommand-line arguments:  -os win32 -ws win32 -arch x86\n\nError\nSat Jun 30 00:36:15 EDT 2007\nI/O Error occurred while communicating with http://ns/bugzilla.IOException: Mark invalid\n\njava.io.IOException: Mark invalid\nat java.io.BufferedReader.reset(Unknown Source)\nat org.eclipse.mylyn.internal.bugzilla.core.BugzillaClient.postTaskData(BugzillaClient.java:783)\nat org.eclipse.mylyn.internal.bugzilla.core.BugzillaTaskDataHandler.postTaskData(BugzillaTaskDataHandler.java:152)\nat org.eclipse.mylyn.tasks.ui.editors.AbstractRepositoryTaskEditor$37.run(AbstractRepositoryTaskEditor.java:2754)\nat org.eclipse.core.internal.jobs.Worker.run(Worker.java:55)\n\n!ENTRY org.eclipse.mylyn.bugzilla 4 5 2007-06-29 23:16:05.625\n!MESSAGE I/O Error occurred while communicating with http://ns/bugzilla.",
    "This can happen if a timeout occurs awaiting response from the bugzilla server upon new bug submission. Are you seeing this frequently?",
    "Also happens to me few times in last two days when submitting to eclipse.org",
    "yes, how i said, everytime when i tried to create a new bug, but now i get my\nsmtp server works and everything is fine, the error only appears for me when\nthe bugzilla page give an error.",
    "bug#180335 is going to address making IO timeout configurable so should help resolve this.\n\n (In reply to comment #3)\n\u003e the error only appears for me when the bugzilla page give an error.\nSo do you mean that when using Mylyn to submit a bug you are also getting the same error when using your web browser?\n",
    "yes, thats right. Just that in the browser i can see that is only an error with the email sender (bugzilla-daemon@....)upon the bug submission, but in mylyn just say that what i post before.",
    "(In reply to comment #4)\n\u003e bug#180335 is going to address making IO timeout configurable so should help\n\u003e resolve this.\n\u003e \n\nWell i hope that could resolve this, but what it pass in my mind is something like a \"response status\" that is failed, because the last action (email send) of bugzilla fail, and there is not directly the same error like in the browser and it is handled like a timeout error. \n\nBut you are the genius, that is only the way i understood just want to help and to say that i\u0027m enjoying this amazing project.\n",
    " (In reply to comment #5)\n\u003e yes, thats right. Just that in the browser i can see that is only an error with\n\u003e the email sender (bugzilla-daemon@....)upon the bug submission, but in mylyn\n\u003e just say that what i post before.\n\nOkay so in this case the failure was server side sending of the notification email. Currently we parse the returned page to confirm successful submission so if an error of this (odd) nature occurs we are left in an unusual state.  For now you either need to keep using the web ui to create new bug reports, or resolve the smtp issues.  Once we adopt the new (Bugzilla 3.0) web services api, our error recovery from this sort of error should improve (see bug#154785).  I will rename this bug report to reflect our new understanding of the problem and will mark as won\u0027t fix for now.\n\n (In reply to comment #6)\n\u003e But you are the genius, that is only the way i understood just want to help and\n\u003e to say that i\u0027m enjoying this amazing project.\n\nI stand on the shoulders of giants as they say but thanks for the kind words,  we are always encouraged to hear people are enjoying Mylyn!"
  ],
  "commentCreationDates": [
    "2007-06-30T07:02:59+02:00",
    "2007-07-04T02:32:07+02:00",
    "2007-07-04T03:07:01+02:00",
    "2007-07-04T03:13:37+02:00",
    "2007-07-04T18:37:05+02:00",
    "2007-07-05T04:26:48+02:00",
    "2007-07-05T04:46:12+02:00",
    "2007-07-10T23:23:10+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.io.IOException",
      "message": "Mark invalid",
      "elements": [
        {
          "method": "java.io.BufferedReader.reset",
          "source": "Unknown Source"
        },
        {
          "method": "org.eclipse.mylyn.internal.bugzilla.core.BugzillaClient.postTaskData",
          "source": "BugzillaClient.java:783"
        },
        {
          "method": "org.eclipse.mylyn.internal.bugzilla.core.BugzillaTaskDataHandler.postTaskData",
          "source": "BugzillaTaskDataHandler.java:152"
        },
        {
          "method": "org.eclipse.mylyn.tasks.ui.editors.AbstractRepositoryTaskEditor$37.run",
          "source": "AbstractRepositoryTaskEditor.java:2754"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:55"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "194995",
      "date": "2007-06-30T07:02:59+02:00",
      "product": "Mylyn",
      "component": "Bugzilla",
      "severity": "normal"
    }
  ],
  "groupId": "194995",
  "bugId": "194995",
  "date": "2007-06-30T07:02:59+02:00",
  "product": "Mylyn",
  "component": "Bugzilla",
  "severity": "normal"
}