{
  "comments": [
    "jira version is 3.6.2\neclipse is 3.2.1\n\nEvery task synchronization event throws a \"Task Synchronization Failed\" error stating \"JIRA ticket not found: xxxxx\" where the xxxxx is the ticket number that it was looking for.\n\nThis causes problems because the action you were trying to do generally works, but  the screen is not updated with the results.  If you were entering a new task, you are tempted to resubmit which creates duplicates in jira but doesn\u0027t show up until later.\n\nThe background synchronization seems to work, but the on-demand sync doesn\u0027t.",
    "Eugene: will you be looking into this?",
    "I think I\u0027m on to something with this, but I won\u0027t have any more information until I can get something tested on our network on Monday.  I\u0027m seeing bad checksums coming off of a source tcp port from the web server.  The port I\u0027m seeing is 3666, but I don\u0027t know if that would be the same on every install.  I\u0027m thinking that maybe there is a routing/firewall issue that is preventing a part of the dialog with the web service.  Can somebody verify that more than just the web port is being used and what for?  I\u0027m guessing that maybe this is being used for at least some sort of file transfer function? (just guessing until I get to look a little deeper.",
    "I can\u0027t think of anything. All communication to server is going over http (or https), including xml-rpc/soap requests. Rob, should know better what is the difference between manual and background sync.",
    "I\u0027ve verified it\u0027s not a port issue.",
    "I\u0027ve upgraded my eclipse install to version 3.3 and the corresponding version of Mylyn and the jira connector.  The same behavior is present.  Is it possible that there is an issue with our version of jira?  I think the current version is around 3.9 or so.",
    "Mike, I still waiting response from Rob, but in a mean time can you verify that task xxxx is in your task list when this error happens. BTW, is it numeric or show up as JIRA key?\n\nIf it is the latter, can you please capture and attach to this report the execution of the wget command (on unix or from cygwin on windows):\n\nwget -d -S -v -o a.log -O a.html \u003cserver url from repo settings\u003e/secure/QuickSearch.jspa?view\u003drss\u0026decorator\u003dnone\u0026reset\u003dtrue\u0026tempMax\u003d1\u0026searchString\u003d\u003cxxxxx\u003e\n\nFor the former, make sure that RPC interface is enabled on your JIRA instance. I assume \"validate\" action is working from the repository preferences dialog. See http://confluence.atlassian.com/pages/viewpage.action?pageId\u003d1035",
    "Created an attachment (id\u003d73378)\nmylyn/context/zip\n\n",
    "Created an attachment (id\u003d73395)\ntcp stream from an update of a task\n\nThis is the data stream I captured trying to update an existing ticket.",
    "(In reply to comment #6)\n\nThe ticket number is numeric and it is the same as the id that is stored in the\ndb for the record the issue.  The RPC service is definitely running because\nmost of the actions are actually being performed, you just get an error message\ninstead of a confirmation when the screen should be updating to reflect the\nchanges you just made.\n\nValidate is working fine from the repositories dialog.  I don\u0027t know if this\nwill help, but i\u0027m attaching the datastream that occurs when I attmpted to\nupdate a ticket in mylyn.\n\n\u003e Mike, I still waiting response from Rob, but in a mean time can you verify that\n\u003e task xxxx is in your task list when this error happens. BTW, is it numeric or\n\u003e show up as JIRA key?\n\u003e \n\u003e If it is the latter, can you please capture and attach to this report the\n\u003e execution of the wget command (on unix or from cygwin on windows):\n\u003e \n\u003e wget -d -S -v -o a.log -O a.html \u003cserver url from repo\n\u003e settings\u003e/secure/QuickSearch.jspa?view\u003drss\u0026decorator\u003dnone\u0026reset\u003dtrue\u0026tempMax\u003d1\u0026searchString\u003d\u003cxxxxx\u003e\n\u003e \n\u003e For the former, make sure that RPC interface is enabled on your JIRA instance.\n\u003e I assume \"validate\" action is working from the repository preferences dialog.\n\u003e See http://confluence.atlassian.com/pages/viewpage.action?pageId\u003d1035\n\u003e \n\n",
    "(In reply to comment #9)\n\u003e I don\u0027t know if this will help, but i\u0027m attaching the datastream that \n\u003e occurs when I attmpted to update a ticket in mylyn.\n\nMaybe. Can you explain how did you capture it and also give us the issue id that failed during that sync? Were you updating a single ticket? Hod did you invoked update?",
    "By the way, can you try to delete that jira issue from your task list (turn of automatic query sync, hit Del in the issue in query and probably also in the Archive category, which you may have to unfilter) and then try to issue using \"Open Repository Task\" (which you may have to enable from the Window / Customize Perspective... dialog) using the corresponding jira key in the entry field.",
    "(From update of attachment 73395)\nLets not use this stream.  i\u0027ll try to put one up that is a little more focused.",
    "(In reply to comment #11)\n\u003e By the way, can you try to delete that jira issue from your task list (turn of\n\u003e automatic query sync, hit Del in the issue in query and probably also in the\n\u003e Archive category, which you may have to unfilter) and then try to issue using\n\u003e \"Open Repository Task\" (which you may have to enable from the Window /\n\u003e Customize Perspective... dialog) using the corresponding jira key in the entry\n\u003e field.\n\u003e \n\nOk, I was able to delete the task without a problem from the task lists.  After making the \"Open Repository Task\" dialog available by customizing the perspective,  it doesn\u0027t seem to work. It throws the same error that it can\u0027t open the ticket.",
    "(In reply to comment #13)\n\u003e Ok, I was able to delete the task without a problem from the task lists.  After\n\u003e making the \"Open Repository Task\" dialog available by customizing the\n\u003e perspective,  it doesn\u0027t seem to work. It throws the same error that it can\u0027t\n\u003e open the ticket.\n\nIs there any stack traces in the log? I guess we\u0027ll have to start adding some verbose debug output, unless you can step trough this in the debugger...\n\nBy the way, can you try that wget command anyways and check if there is any redirects happening (302 response etc).",
    "(In reply to comment #14)\n\u003e (In reply to comment #13)\n\u003e \u003e Ok, I was able to delete the task without a problem from the task lists.  After\n\u003e \u003e making the \"Open Repository Task\" dialog available by customizing the\n\u003e \u003e perspective,  it doesn\u0027t seem to work. It throws the same error that it can\u0027t\n\u003e \u003e open the ticket.\n\u003e \n\u003e Is there any stack traces in the log? I guess we\u0027ll have to start adding some\n\u003e verbose debug output, unless you can step trough this in the debugger...\n\u003e \n\u003e By the way, can you try that wget command anyways and check if there is any\n\u003e redirects happening (302 response etc).\n\u003e \n\nI actually don\u0027t have console access to the box that\u0027s running Jira here. I\u0027ll have to enlist the aid of a person or two if we need to see anything there.\n\nAs for the 302 responses, yes, we are seeing a lot of those.  The responses to jogin.jsp, secure/QuickSearch.jspa, browse is a 200 and logout is again a 302.\n\nI spoke to the person that did the install and he said it was pretty much a default install from beginning to end.\n\nLet me know if you still need the wget and I\u0027ll see if I can get somebody to do that.",
    "(In reply to comment #15)\n\u003e Let me know if you still need the wget and I\u0027ll see if I can get somebody to do\n\u003e that.\n\nCan you do that please. You don\u0027t need to be on the same box as JIRA server and it would be better if you do it from your machine. I am just wondering if there are any other redirects happening before you get to secure/QuickSearch.jspa (i.e. something web server or some proxy may do).",
    "Created an attachment (id\u003d73548)\nLog file from wget\n\n",
    "Created an attachment (id\u003d73549)\nhtml generated from wget\n\n",
    "Any thoughts on why so many of these calls are generating temporary re-direct responses?",
    "Temporary redirects are normal, it is just the way JIRA guide you to the issue page when going trough quick search interface. We probably can optimize it, by using direct url for loading issue by key instead of going trough quick search. Though that still does not explain what is happening in your case.",
    "Here is the error generated in the eclipse error log when I attempt to save an issue with the attach Context box checked.\n\n\neclipse.buildId\u003dI20070625-1500\njava.version\u003d1.6.0_01\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dwin32, ARCH\u003dx86, WS\u003dwin32, NL\u003den_US\nCommand-line arguments:  -os win32 -ws win32 -arch x86\n\nError\nWed Jul 18 15:36:02 EDT 2007\nno message\n\n\njava.lang.NullPointerException\n\tat org.eclipse.mylyn.internal.jira.core.service.web.JiraWebIssueService$6.execute(JiraWebIssueService.java:429)\n\tat org.eclipse.mylyn.internal.jira.core.service.web.JiraWebSession.doInSession(JiraWebSession.java:56)\n\tat org.eclipse.mylyn.internal.jira.core.service.web.JiraWebIssueService.attachFile(JiraWebIssueService.java:419)\n\tat org.eclipse.mylyn.internal.jira.core.service.web.JiraWebIssueService.attachFile(JiraWebIssueService.java:398)\n\tat org.eclipse.mylyn.internal.jira.core.service.soap.JiraRpcClient.attachFile(JiraRpcClient.java:491)\n\tat org.eclipse.mylyn.internal.jira.ui.JiraAttachmentHandler.uploadAttachment(JiraAttachmentHandler.java:83)\n\tat org.eclipse.mylyn.tasks.core.AbstractAttachmentHandler.attachContext(AbstractAttachmentHandler.java:158)\n\tat org.eclipse.mylyn.tasks.ui.editors.AbstractRepositoryTaskEditor$37.run(AbstractRepositoryTaskEditor.java:2776)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:55)\n\n\nIf I attempt to change the status of an issue, I get a pop-up window that says Submit failed: You must specify a summary of the issue.No issue type selected.Reporter is required.\n",
    " (In reply to comment #3)\n\u003e I can\u0027t think of anything. All communication to server is going over http (or\n\u003e https), including xml-rpc/soap requests. Rob, should know better what is the\n\u003e difference between manual and background sync.\n\nI\u0027m not aware of any other communication channels being used.",
    "At this point, I\u0027d say the communication is probably working ok.  I can see the jira ticket coming back in response to the quicksearch request.  My guess (as I\u0027m not a java developer) is that there must be a problem finding what the client needs in the response to update the local records.  Is it possible that we have a jira plugin in place that is disrupting the parsing?  \n\nWe have the following parts of the workflow plugin installed.  Note that Kaamelot is disabled.\n \t\nVoters and Watchers\n5 modules.\n\t\nIssue Operations Plugin\n1 modules.\n\t\nCustom Field Types \u0026 Searchers\n36 modules.\n\t\nKaamelot Jira Plugin - Fast Worklog\nPlugin currently disabled.\n\t\nRPC JIRA Plugin\n12 modules.\n\t\nPortlets Plugin\n17 modules.\n\t\nReports Plugin\n4 modules.\n\t\nKaamelot Jira Plugin - AddOn\nPlugin currently disabled.\n\t\nWebwork Plugin\n1 modules.\n\t\nWiki Renderer Macros Plugin\n8 modules.\n\t\nKaamelot Jira Plugin - TimeSheet\nPlugin currently disabled.\n\t\nClone and Move Plugin\n2 modules.\n\t\nProject Panels Plugin\n4 modules.\n\t\nRenderer Plugin\n4 modules. \n\n",
    "Can you please update to the latest dev build. See project download page [1] for details.\n\nAlso, it would be great if you could enable debug tracing as described in [2]. It may give more detailed errors.\n\n[1] http://www.eclipse.org/mylyn/downloads/\n[2] http://wiki.eclipse.org/index.php/Mylyn_FAQ#Debug_tracing",
    "(In reply to comment #24)\n\u003e Can you please update to the latest dev build. See project download page [1]\n\u003e for details.\n\u003e \n\u003e Also, it would be great if you could enable debug tracing as described in [2].\n\u003e It may give more detailed errors.\n\u003e \n\u003e [1] http://www.eclipse.org/mylyn/downloads/\n\u003e [2] http://wiki.eclipse.org/index.php/Mylyn_FAQ#Debug_tracing\n\u003e \n\nOk, I\u0027ve updated both mylyn and the jira connector to the version that ends with v20070723-2100.  I\u0027m also able to launch eclipse with the debug tracing turned on, but there isn\u0027t any guidance on the wiki about how to get anything out of it.  Can you point me to something that will tell me how to get the debugging output?  Does it generate a log file of some sort?",
    "Sorry, I\u0027ve added note to the wiki. The idea is that you should see additional errors or stack traces in the regular Eclipse logand the Error Log view.",
    "From a quick analysis on JIRA 3.9, this is the expected sequence of requests:\n\nPOST /jira-enterprise-3.9/login.jsp\n-\u003e get session cookie\n\nGET /jira-enterprise-3.9/secure/QuickSearch.jspa?view\u003drss\u0026decorator\u003dnone\u0026reset\u003dtrue\u0026tempMax\u003d1\u0026searchString\u003dSCRATCH-175 \n-\u003e redirect\n\nGET /jira-enterprise-3.9/browse/SCRATCH-175\n\nGET /jira-enterprise-3.9/browse/SCRATCH-175?decorator\u003dnone\u0026view\u003drss\n-\u003e redirect (3.4 and above?) or actual XML result (older versions)\n\nGET /jira-enterprise-3.9/si/jira.issueviews:issue-xml/SCRATCH-175/SCRATCH-175.xml\n-\u003e XML result (older versions)\n\nGET /jira-enterprise-3.9/logout HTTP/1.1\\r\\n\n\nI\u0027ll look into optimizing this by fetching the XML feed directly.\n",
    "Mike, to address your original report, could you please follow these steps. Login in to your JIRA repository in a web browser and go to this URL:\n\n /jira/browse/PRU-7\n\nand then make a second request:\n\n /jira/browse/PRU-7?decorator\u003dnone\u0026view\u003drss\n \nPlease report back what the result of the second request is (a bunch of XML that contains the issue data is expected).",
    "I have refactored the query code to only make one request (not counting login and logout) when synchronizing issues. I have run quick tests against a number of JIRA versions including 3.6.5 that all seemed to work fine. The new implementation will become available as part of tonight\u0027s weekly build later today:\n\n http://www.eclipse.org/mylyn/downloads/\n\nMarking as resolved. Mike, please reopen this bug if you still experience problems when manually synchronizing with the latest release.",
    "Created an attachment (id\u003d80727)\nmylyn/context/zip\n\n"
  ],
  "commentCreationDates": [
    "2007-07-03T01:28:01+02:00",
    "2007-07-07T04:56:22+02:00",
    "2007-07-07T06:16:53+02:00",
    "2007-07-07T07:21:20+02:00",
    "2007-07-09T20:53:27+02:00",
    "2007-07-09T21:02:16+02:00",
    "2007-07-09T21:32:54+02:00",
    "2007-07-09T21:33:19+02:00",
    "2007-07-09T23:57:02+02:00",
    "2007-07-09T23:59:33+02:00",
    "2007-07-10T00:15:10+02:00",
    "2007-07-10T00:45:06+02:00",
    "2007-07-10T21:46:04+02:00",
    "2007-07-10T22:37:50+02:00",
    "2007-07-10T22:41:48+02:00",
    "2007-07-10T23:13:58+02:00",
    "2007-07-11T05:48:43+02:00",
    "2007-07-11T16:51:10+02:00",
    "2007-07-11T16:51:37+02:00",
    "2007-07-12T21:12:14+02:00",
    "2007-07-12T21:22:17+02:00",
    "2007-07-18T21:40:59+02:00",
    "2007-07-24T07:39:20+02:00",
    "2007-07-24T16:25:12+02:00",
    "2007-07-24T18:23:05+02:00",
    "2007-07-24T19:34:13+02:00",
    "2007-07-24T19:41:45+02:00",
    "2007-10-19T03:02:58+02:00",
    "2007-10-19T03:04:15+02:00",
    "2007-10-19T05:12:42+02:00",
    "2007-10-19T05:12:47+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.mylyn.internal.jira.core.service.web.JiraWebIssueService$6.execute",
          "source": "JiraWebIssueService.java:429"
        },
        {
          "method": "org.eclipse.mylyn.internal.jira.core.service.web.JiraWebSession.doInSession",
          "source": "JiraWebSession.java:56"
        },
        {
          "method": "org.eclipse.mylyn.internal.jira.core.service.web.JiraWebIssueService.attachFile",
          "source": "JiraWebIssueService.java:419"
        },
        {
          "method": "org.eclipse.mylyn.internal.jira.core.service.web.JiraWebIssueService.attachFile",
          "source": "JiraWebIssueService.java:398"
        },
        {
          "method": "org.eclipse.mylyn.internal.jira.core.service.soap.JiraRpcClient.attachFile",
          "source": "JiraRpcClient.java:491"
        },
        {
          "method": "org.eclipse.mylyn.internal.jira.ui.JiraAttachmentHandler.uploadAttachment",
          "source": "JiraAttachmentHandler.java:83"
        },
        {
          "method": "org.eclipse.mylyn.tasks.core.AbstractAttachmentHandler.attachContext",
          "source": "AbstractAttachmentHandler.java:158"
        },
        {
          "method": "org.eclipse.mylyn.tasks.ui.editors.AbstractRepositoryTaskEditor$37.run",
          "source": "AbstractRepositoryTaskEditor.java:2776"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:55"
        }
      ],
      "number": 0,
      "commentIndex": 21,
      "bugId": "195195",
      "date": "2007-07-18T21:40:59+02:00",
      "product": "Mylyn",
      "component": "Jira",
      "severity": "major"
    }
  ],
  "groupId": "195195",
  "bugId": "195195",
  "date": "2007-07-03T01:28:01+02:00",
  "product": "Mylyn",
  "component": "Jira",
  "severity": "major"
}