{
  "comments": [
    "In Eclipse 3.3, if I have TOC file declared in my plugin.xml but that file doesn\u0027t exist, it results in an error with a stack trace in the product\u0027s log file.\n\nA warning would be adequate.\n\nAlso, if I am missing a label on the TOC element in a TOC file, I get a stack trace in the log. An error listing the file that is missing label is adequate for this.\n\nIncluding the debug info when it isn\u0027t necessary pollutes the log file.",
    "I think the stack trace is useful, in the case of the missing file the first lines in the log are\n\njava.io.FileNotFoundException\nat org.eclipse.help.internal.toc.TocFileParser.parse(TocFileParser.java:45) - which makes it easy to track down the problem.\n\nIf we just reported the message:\n\nError reading help table of contents file /\"com.cg.hwarn/toc2.xml\" (skipping file)\n\nit would be less informative. A missing TOC is an error condition in that it indicates a problem with the configuration/installation so I think that it is appropriate to show this in the error log to help the developer/packagers fix the problem. A correctly configured product will never show this error.",
    "Perhaps the exception and message can be condensed into the message, e.g.\n\nError reading help table of contents file /\"com.cg.hwarn/toc2.xml\" (java.io.FileNotFoundException - skipping file)\n\nAnything after the first line of stack trace is not useful to the developer because it\u0027s listing help code, rather than their code."
  ],
  "commentCreationDates": [
    "2007-07-23T19:19:40+02:00",
    "2007-07-23T22:53:35+02:00",
    "2007-07-23T23:15:18+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.io.FileNotFoundException",
      "elements": [
        {
          "method": "org.eclipse.help.internal.toc.TocFileParser.parse",
          "source": "TocFileParser.java:45"
        }
      ],
      "number": 0,
      "commentIndex": 1,
      "bugId": "197511",
      "date": "2007-07-23T22:53:35+02:00",
      "product": "Platform",
      "component": "User Assistance",
      "severity": "minor"
    }
  ],
  "groupId": "197511",
  "bugId": "197511",
  "date": "2007-07-23T19:19:40+02:00",
  "product": "Platform",
  "component": "User Assistance",
  "severity": "minor"
}