{
  "comments": [
    "It appears that the URL returned by getClass().getResource() does not have the \"file\" protocol when used by the build test harness. This results in the following failure (which doesn\u0027t occur when the test is run locally).\n\njunit.framework.AssertionFailedError\nat org.eclipse.compare.tests.PatchTest.testPatchdataSubfolders(PatchTest.java:185)",
    "I have modified the test so it exits if the protocol is not \"file\". We should still investigate how to implement the test so it can run during the build.",
    "The protocol in the tests is \"jar\". I suspect the test will need to be rewritten so that it doesn\u0027t dynamically determine the test input.",
    "Created an attachment (id\u003d78304)\nFix\n\nThe patch handles both cases when url protocol is \"file\" or \"jar\". I\u0027ve tested using JUnit tests launched from the command line (the same way it\u0027s tested over the big water). I did it on both Windows and Linux. Michael, you have also suggested some additional improvements of the test like collecting the results for the subfolders (to ensure that all tests are run in opposite to a situation when a test fails for some case from first subfolder). I hope you don\u0027t mind if I log a separate bug for it.",
    "I\u0027ve released the patch. We\u0027ll see what happens tonight ;-)",
    "Verified in I20070917-1800."
  ],
  "commentCreationDates": [
    "2007-09-10T15:47:32+02:00",
    "2007-09-10T16:01:07+02:00",
    "2007-09-10T16:47:00+02:00",
    "2007-09-13T15:00:15+02:00",
    "2007-09-13T17:53:20+02:00",
    "2007-09-18T09:36:13+02:00"
  ],
  "traces": [
    {
      "exceptionType": "junit.framework.AssertionFailedError",
      "elements": [
        {
          "method": "org.eclipse.compare.tests.PatchTest.testPatchdataSubfolders",
          "source": "PatchTest.java:185"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "202788",
      "date": "2007-09-10T15:47:32+02:00",
      "product": "Platform",
      "component": "Compare",
      "severity": "normal"
    }
  ],
  "groupId": "202788",
  "bugId": "202788",
  "date": "2007-09-10T15:47:32+02:00",
  "product": "Platform",
  "component": "Compare",
  "severity": "normal"
}