{
  "comments": [
    "Hello,\n\nI\u0027m having trouble when I create new files/folders in the project explorer.  They don\u0027t show up until I close the project and reopen it about half the time, despite the fact that they are in fact created (I can see them in the Navigator).  I originally (about a month ago) thought it might be caused by conflicts with some other plugins or something, but I\u0027ve had this happen to me with Ubuntu Feisty, Scientific Linux 3 and 4, and Windows XP, in various combinations on at least 6 different computers (the ones I checked) with 4 different users and fresh installs of Eclipse/CDT (our group is switching to Eclipse as a development platform, so there were a bunch of installs over the past few days).  Since I found that it wasn\u0027t just me, I decided I might as well submit a bug report.\n\nSince a picture (or video) is much more descriptive, I recorded a video of what was happening and put it at http://web.utk.edu/~mhollin3/pub/bug-project-explorer.avi\n\nI didn\u0027t close/reopen the project in that video, but if I did, the folder would reappear.  The same thing happens with anything \"new\"... New-\u003eFile, New-\u003eFolder, New-\u003eClass, New-\u003eSource File, New-\u003eHeader file, etc.  Also, at times, a file will appear twice, always once at the \"top\" of the folder listing, as in right beneath its containing folder, above child folders, and once where it should be, in alphabetical order beneath the child folders of its own containing folder.  If you double click either of them, they will open the correct same, correct file.  This also is generally fixed by closing/opening the project, but not always actually; I\u0027ve had to restart eclipse to resolve this one at times.  In all cases, refreshing does nothing.  Furthermore, if I create things in the Navigator instead of the Project Explorer, they generally don\u0027t show up at all, and once again, refreshing doesn\u0027t do anything.\n\nBy the way, automatic refresh isn\u0027t enabled, but enabling it did nothing one way or the other.\n\nI\u0027ve been using CDT for a little over a year now, and this didn\u0027t happen until I upgraded to Eclipse 3.3/CDT 4, which I did right when they came out, whenever that was... I don\u0027t remember :).  This has been happening ever since then, but I had assumed it was just me until it happened to every one of my colleagues as well.  \n\nIf you need any more information, I\u0027ll be happy to provide as much as I can.  Thanks for your help!\n\n-Matt",
    "Which exact versions of Eclipse and CDT are you using?\nDo you have any other plug-ins installed in addition to Eclipse and CDT?\n\nWith Eclipse 3.3.1 a regression was introduced which leads to duplication of elements in the Project Explorer: bug 204428, bug 205231, bug 204366. All of them should be fixed with Eclipse 3.3.1.1 (will be released soon).\n\nWith CDT 4.0 there were also some bugs which might be related to you problems: bug 190665, bug 194395. These have been fixed in 4.0.1.",
    "Could you attach the workspace log file: \u003cworkspace\u003e/.metadata/.log\nThanks.",
    "Created an attachment (id\u003d81186)\neclipse log file\n\n",
    "I\u0027m using eclipse 3.3.0 and CDT 4.0.0.  I\u0027ll upgrade to 3.3.1 as soon as it\u0027s available--hopefully that will resolve the duplicate issue.  Does the same bug address the fact that files aren\u0027t created in the first place?\n\nI attached the .log file.  I copied the file right after it happened once.  \n\n-Matt",
    "(In reply to comment #4)\n\nThanks for the log file. That definitely helps.\n\n\u003e I\u0027m using eclipse 3.3.0 and CDT 4.0.0.  I\u0027ll upgrade to 3.3.1 as soon as it\u0027s\n\u003e available--hopefully that will resolve the duplicate issue.  \n\nIt\u0027s 3.3.1.1 (released last Friday). 3.3.1 is the buggy version.\n\n\u003e Does the same bug address the fact that files aren\u0027t created in the first place?\n\nThe log file shows some exceptions from the PyDev plug-in which are more likely to cause the missing display of files:\n\njava.lang.ClassCastException: org.eclipse.cdt.internal.core.model.CContainer cannot be cast to org.eclipse.core.resources.IResource\n\tat org.python.pydev.navigator.PythonModelProvider.wrapChildren(PythonModelProvider.java:326)\n\tat org.python.pydev.navigator.PythonModelProvider.convertToPythonElementsAddOrRemove(PythonModelProvider.java:249)\n\tat org.python.pydev.navigator.PythonModelProvider.interceptAdd(PythonModelProvider.java:105)[...]\n[...]\n\nI\u0027d suggest to report those exceptions against the PyDev project.\n",
    "Thanks for your help... I\u0027ll be sure to report that to the PyDev folks.\n\nHowever, I\u0027m still not sure why the same thing happened on the fresh installs of eclipse (without PyDev).  If I figure out the answer to that question, I\u0027ll let you know.\n\nThanks again."
  ],
  "commentCreationDates": [
    "2007-10-21T04:37:15+02:00",
    "2007-10-22T09:42:23+02:00",
    "2007-10-24T16:11:36+02:00",
    "2007-10-25T20:51:26+02:00",
    "2007-10-25T20:52:09+02:00",
    "2007-10-29T09:11:21+01:00",
    "2007-10-29T14:53:25+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassCastException",
      "message": "org.eclipse.cdt.internal.core.model.CContainer cannot be cast to org.eclipse.core.resources.IResource",
      "elements": [
        {
          "method": "org.python.pydev.navigator.PythonModelProvider.wrapChildren",
          "source": "PythonModelProvider.java:326"
        },
        {
          "method": "org.python.pydev.navigator.PythonModelProvider.convertToPythonElementsAddOrRemove",
          "source": "PythonModelProvider.java:249"
        },
        {
          "method": "org.python.pydev.navigator.PythonModelProvider.interceptAdd",
          "source": "PythonModelProvider.java:105"
        }
      ],
      "number": 0,
      "commentIndex": 5,
      "bugId": "206995",
      "date": "2007-10-29T09:11:21+01:00",
      "product": "CDT",
      "component": "cdt-core",
      "severity": "normal"
    }
  ],
  "groupId": "206995",
  "bugId": "206995",
  "date": "2007-10-21T04:37:15+02:00",
  "product": "CDT",
  "component": "cdt-core",
  "severity": "normal"
}