{
  "comments": [
    "Created an attachment (id\u003d81168)\nerror log\n\nHello,\nI have try the example Plugin ?Sample XML Editor? provided with Eclipse 3.3, unfortunately without success. When opening a file, which should be indicated with this Plugin, an error occures. All I can see is an empty editor window only with ?error?. In the log file is seen that the class ?org.eclipse.equinox.jmx.internal.server.UIStarter? cannot be found (stacktrace see below, complete log is attached). Under 3.2 it works fine.\nciao Thomas\n\n!MESSAGE Unhandled Exception\n!ENTRY org.eclipse.equinox.jmx.server 4 0 2007-10-24 09:54:28.796\n!MESSAGE Unable to execute early startup code for an extension\n!STACK 1\norg.eclipse.core.runtime.CoreException: Plug-in org.eclipse.equinox.jmx.server was unable to load class org.eclipse.equinox.jmx.internal.server.UIStarter.\n\tat org.eclipse.core.internal.registry.osgi.RegistryStrategyOSGI.throwException(RegistryStrategyOSGI.java:180)\n\tat...",
    "Old Summary: Sample XML Editor doesn\u0027t work\n\nJudging from the stack trace in the provided log file, I would say that you have the Equinox Monitoring code installed and that you are trying to start up 2 instances of Eclipse and both of them are trying to open a server on the same port. \n\nDo you have the monitoring support installed? Are you running 2 Eclipse instances?\n",
    "Thanks for the fast answer. Indeed I have started the \"Sample XML Editor\" Plugin as a second Eclipse test application. What is \"monitoring support\"? How can I deinstall it or switch that off, so which I can test the Plugin?",
    "You most likely added it by installing it from the Eclipse update site. There are 3 features called:\n   Resource Monitoring Common Feature (Incubation)\n   Resource Monitoring Client Feature (Incubation)\n   Resource Monitoring Server Feature (Incubation)\n\nIf you uninstall these features you should be able to work ok.\n",
    "Created an attachment (id\u003d81421)\nlog file after deinstallation of \"Resource Monitoring Common Feature (Incubation)\"\n\n",
    "In my eclipse installation only the feature \"Resource Monitoring Common Feature (Incubation)\" was installed. After the Deinstallation of this feature the Plugin did not function yet :-( (log file is attached)\nI have it also tried with following eclipse versions downloaded from eclipse.org without any updates to have made: eclipse-SDK-3.3-win32, eclipse-SDK-3.4M2-win32_2, eclipse-SDK-N20071024-0010-win32 ... but without success.\nDo you have another workaround?",
    "From the log file it looks like you have a lot of older bundles installed.  This can happen if you unzip a newer build over an old installation.  When you tried a new build did you unzip it into a new install location?",
    "\u003eWhen you tried a new build did you unzip it into a new install location?\n\nYes, each Eclipse version started from its own directory. The log file is from my work version, which contains old plugin versions.\nBut, when I run the \"Sample XML Plugin\" under a clean version of eclipse 3.3., there was no log file generated, but the error occurs nevertheless!",
    "A piece of news: the error occurs only if i try to open a file (inherited with the editor) which is outside of a project. If it is a component of a project it works fine. A screenshot is attached. It shows two files, test.if is inside of the project and could be open in the editor, test2.if is outside of the project and throws an error. The content of test.if and test2.if is identical.\nIs this a bug or a feature?\nThanks to Berthold Daum for his assistance for this problem.",
    "Created an attachment (id\u003d81585)\nshows test.if and test2.if\n\ntest.if works fine, test2.if throws an error",
    "*** Bug 209477 has been marked as a duplicate of this bug. ***"
  ],
  "commentCreationDates": [
    "2007-10-25T17:20:42+02:00",
    "2007-10-25T19:06:14+02:00",
    "2007-10-26T11:22:46+02:00",
    "2007-10-26T16:13:48+02:00",
    "2007-10-29T09:36:41+01:00",
    "2007-10-29T09:39:22+01:00",
    "2007-10-29T14:08:34+01:00",
    "2007-10-29T17:11:57+01:00",
    "2007-10-30T15:27:00+01:00",
    "2007-10-30T15:29:30+01:00",
    "2007-11-12T14:55:53+01:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.core.runtime.CoreException",
      "message": "Plug-in org.eclipse.equinox.jmx.server was unable to load class org.eclipse.equinox.jmx.internal.server.UIStarter.",
      "elements": [
        {
          "method": "org.eclipse.core.internal.registry.osgi.RegistryStrategyOSGI.throwException",
          "source": "RegistryStrategyOSGI.java:180"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "207469",
      "date": "2007-10-25T17:20:42+02:00",
      "product": "Equinox",
      "component": "Incubator",
      "severity": "normal"
    }
  ],
  "groupId": "207469",
  "bugId": "207469",
  "date": "2007-10-25T17:20:42+02:00",
  "product": "Equinox",
  "component": "Incubator",
  "severity": "normal"
}