{
  "comments": [
    "Created an attachment (id\u003d81246)\none of the console logs for one of the test suites. \n\nI\u0027ve tried to move up to the latest platform build, \n\t\neclipse-SDK-I20071023-0800-linux-gtk-ppc.tar.gz \n\nbut none of the UI oriented test run, and contain \"compilation problem\" message from UITestApplication. \n\nUnresolved compilation problem!!?? How can this be? Even assuming it\u0027s only the PPC distribution, and it\u0027s somehow just gone astray, how could all the status marks show green? \n\nI\u0027ll attach a full log, but there\u0027s one part. \n\njava.lang.Error: Unresolved compilation problems: \n\tThe type org.eclipse.swt.widgets.Display cannot be resolved. It is indirectly referenced from required .class files\n\tThe type org.eclipse.swt.widgets.Shell cannot be resolved. It is indirectly referenced from required .class files\n\tThe method getDisplay() is undefined for the type Shell\n\n\tat org.eclipse.test.UITestApplication.\u003cinit\u003e(UITestApplication.java:1)",
    "Peeking inside the class file, for even the windows distribution, for which, I guess there\u0027s really no difference -- one zip for windows and linux, that is -- I can see the \n\n\"Unresolved compilation problems: \n\tThe type org.eclipse.swt.widgets.Display cannot be resolved. It is indirectly referenced from required .class files\n\tThe type org.eclipse.swt.widgets.Shell cannot be resolved. It is indirectly referenced from required .class files\n\tThe method getDisplay() is undefined for the type Shell\"\n\n\n",
    "David we only run Junit tests on linux.gtk.x86, win32.win32.x86 and macosx.carbon.ppc.\n\nFor these platforms, green means tests run successfully.  For the other platforms, it means no compilation errors.\n\n\nWhich class file are you seeing the compile error in?  In one of our bundles or one of yours? Are you running a new version of basebuilder?\n\nWe have seen similar changes issues with the new version of pde build and have had to adjust our build scripts accordingly.\n\nSee\npde build bug 207500\nreleng bug 206082",
    "(In reply to comment #2)\n\n\u003e \n\u003e For these platforms, green means tests run successfully.  For the other\n\u003e platforms, it means no compilation errors.\n\u003e \n\nIt also means you are not using the latest org.eclipse.test to run the tests, or you\u0027d see the same thing I am. \n\n\u003e \n\u003e Which class file are you seeing the compile error in?  In one of our bundles or\n\u003e one of yours? \n\nIt\u0027s yours, in automated.jar, in org.eclipse.test\nin org.eclipse.test.UITestApplication.class\n\n\u003e Are you running a new version of basebuilder?\n\u003e \n\nNo, briefly tried to move up to M2_34 but got 50000 compile errors, so figured I\u0027d have to look at that later. \n\nThanks for the pointers. \n",
    "(In reply to comment #2)\n\u003e David we only run Junit tests on linux.gtk.x86, win32.win32.x86 and\n\u003e macosx.carbon.ppc.\n\u003e \n\u003e For these platforms, green means tests run successfully.  For the other\n\u003e platforms, it means no compilation errors.\n\u003e \n\u003e \n\nYes, but the \"eclipse-test-framework-I2007.....zip\" file itself has a green check mark, so should mean no compile errors in it, right? \n\nBut, it does have compile errors. So .. I think there is a bug in your summary reporting system too. \n\n",
    "We are using the latest org.eclipse.test to run the tests.  I see the class file error.  \n\nFrom looking at the timestamps on the compile logs, the problem seems to be that the the call to check for compile errors is coming after the org.eclipse.test has been compiled.  I don\u0027t understand why this is happening because the it is listed to occur sequentially after the tests and other features have been compiled. I\u0027m investigating.  \n\nAs for the org.eclipse.test plugin, from looking at the generated build script, it appears that the swt fragments are not appearing on the classpath of the generated build.xml, but they are in earlier builds that use the old pde build.  I\u0027ll talk to Andrew about how to get around this since this feature is assembled using the packager, not like the other cases we have seen.",
    "Talked to Andrew and he did some further investigation.  It turns out that the 3.4 stream org.eclipse.osgi is not resolving the swt fragments correctly.  He is following up with the Austin Equinox team for more information.  I\u0027ll run a test build with a 3.3.1 osgi in basebuilder to determine if the fragments appear on the classpath for the projects that have this issue.",
    "The OSGi issue was resolved in bug 207500.\n\nThe problems with the compile error not showing up in our builder was due to the fact that the plugin org.eclipse.test is compiled twice in our builder, once in the org.eclipse.sdk.tests feature and once for the test framework. Due to the nature of the bug 207500, the swt fragments were resolving with one compile, but not the other.  \n\nI\u0027ve set noclean\u003dtrue in our builder for the second feature that includes the org.eclipse.test plugin to avoid missing compile errors in the future. Thanks David, good catch :-)"
  ],
  "commentCreationDates": [
    "2007-10-26T10:58:22+02:00",
    "2007-10-26T16:44:26+02:00",
    "2007-10-26T19:39:45+02:00",
    "2007-10-26T21:24:26+02:00",
    "2007-10-29T15:38:49+01:00",
    "2007-10-29T16:41:40+01:00",
    "2007-10-29T19:12:40+01:00",
    "2007-11-02T21:24:24+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.Error",
      "message": "Unresolved compilation problems:   The type org.eclipse.swt.widgets.Display cannot be resolved. It is indirectly referenced from required .class files  The type org.eclipse.swt.widgets.Shell cannot be resolved. It is indirectly referenced from required .class files  The method getDisplay() is undefined for the type Shell",
      "elements": [
        {
          "method": "org.eclipse.test.UITestApplication.\u003cinit\u003e",
          "source": "UITestApplication.java:1"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "207557",
      "date": "2007-10-26T10:58:22+02:00",
      "product": "Platform",
      "component": "Releng",
      "severity": "normal"
    }
  ],
  "groupId": "207557",
  "bugId": "207557",
  "date": "2007-10-26T10:58:22+02:00",
  "product": "Platform",
  "component": "Releng",
  "severity": "normal"
}