{
  "comments": [
    "[M4]\n\nFor the first time in a long time, I\u0027ve got a stack trace on my Java console,\nand I\u0027m pleasantly surprised to see that it\u0027s a link, which should presumably\ntake me to the right place. Unfortunately, instead I get an error:\n\n\"Source not found for mypackage.MyClass\" \n\n(Names have been changed to protect the guilty.)\n\nNow clearly JDT itself knows about the source for this, because hitting\nCtrl-Shift-T and entering MyClass finds mypackage.MyClass.\n\nThe stack trace is of the form:\n\njava.lang.ExceptionInInitializerError: java.lang.NullPointerException\n\tat mypackage.MyClass.setAttribute(MyClass.java:269)\n\n(The tab shows as 4 columns on the console, btw.)\n\nIs there anything different I should be doing to get this to work? It looks like\nit\u0027d be a very nice feature if it were working properly.",
    "Hmm... having now started debugging normally, that couldn\u0027t find the source\neither. It turns out that although the \"default source path\" was set in the\n\"Run...\" launcher configuration, it wasn\u0027t being picked up. I\u0027ll check whether\nstack traces in the console now work too...\n",
    "Yup, console stack trace now works.\n\nSo, there may be a problem lurking about default source paths not being followed\nappropriately, which may in turn be a milestone-upgrade related bug - feel free\nto recategorise, close, or whatever you want to do. Sorry for being a PITA!\n",
    "marking as works for me."
  ],
  "commentCreationDates": [
    "2003-01-27T14:42:32+01:00",
    "2003-01-27T15:01:26+01:00",
    "2003-01-27T15:15:18+01:00",
    "2003-01-27T16:37:04+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "mypackage.MyClass.setAttribute",
          "source": "MyClass.java:269"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "30295",
      "date": "2003-01-27T14:42:32+01:00",
      "product": "JDT",
      "component": "Debug",
      "severity": "normal"
    }
  ],
  "groupId": "30295",
  "bugId": "30295",
  "date": "2003-01-27T14:42:32+01:00",
  "product": "JDT",
  "component": "Debug",
  "severity": "normal"
}