{
  "comments": [
    "This is perhaps the biggest mess in Eclipse and, given the widespread use of\nXML, the most ubiquitous. Here are typical errors:\n\n- User puts xerces in, e.g., jre/lib/endorsed folder. Eclipse won\u0027t run.\n- Plugin tries to use its own version of xerces. Can\u0027t load classes.\n\nThe first problem is that Eclipse has not taken adequate care to load the\nversion of xerces it depends on. The second is that it has not taken adequate\ncare to keep its version of xerces from leaking into a classloader all plugins\ninherit.\n\nUsers should not have to jump through hoops to get xerces to work, Eclipse\nshould jump through hoops to keep from causing this kind of problem. One\nsolution is for Eclipse platform plugins to use a special classloader for xerces\nonly, that is never put in the parent chain other plugins can inherit.",
    "Verified on Mac OS X as well by Jerry.Wilcox@ucop.edu",
    "The thing is that due tu this\nproblem jdom wont work in a plugin, because it can not find any xerces\nit needs if one want to force jdom not using crimson (because crimson\ndoes not supports xml schemas) . its a classpath problem, i get\nan \u003cbr\u003e\n\u003cbr\u003e\njava.lang.ClassNotFoundException: org.apache.xerces.parsers.SAXParser\n\tat org.xml.sax.helpers.XMLReaderFactory.createXMLReader(XMLReaderFactory.java:121)\n\n\u003cbr\u003e\n\u003cbr\u003e\nerror in jdom \nfrom this lines :\u003cbr\u003e\n\u003cbr\u003e\nSAXBuilder builder \u003d new SAXBuilder(\"org.apache.xerces.parsers.SAXParser\",\nvalidate);\u003cbr\u003e\nDocument doc \u003d builder.build(instr);\u003cbr\u003e\n\u003cbr\u003e\nalthought this:\u003cbr\u003e\nnew org.apache.xerces.parsers.SAXParser() ;\n\u003cbr\u003e\n\u003cbr\u003e\nworks without problems. maybe the problem comes from the old and\noutdated jaxb version in the eclipses xerces plugin which aparently\noverwrites the jdk1.4. jaxb implementation. \nthe problem are the lines :\n  return (XMLReader) NewInstance.newInstance(className);\u003cbr\u003e\nin the org.xml.sax.helpers.XMLReaderFactory class\nthey simpley dont find any  xerces (not the eclipse-xerces-plugin one nor a\nadditional one that i delivered with my plugin ) ",
    "We use JDom in Insectivore successfully. I don\u0027t think we do anything special,\nbut you can check the source at\nhttp://cvs.zclipse.org/cgi-bin/viewcvs.cgi/zclipse/org.zclipse.insectivore/\n\nmike",
    "*** Bug 39485 has been marked as a duplicate of this bug. ***",
    "*** Bug 40472 has been marked as a duplicate of this bug. ***",
    "We distribute a Java-based API and turnkey system that is used by customers on\nvarious versions of Java, going back to 1.2.  We are now adding XML support to\nour product, and wish to distribute the Xerces libraries with the product.  We\nalso expect our developer customers to rely heavily upon Eclipse.  Many of our\ncustomers, however, are only interested in using the turnkey products and may\nnot know much about Java.\n\nThis creates a quandary for us.  We would normally install the Xerces JAR files\nautomatically into the jre/lib/ext directory, to aid our non-developer users. \nBut for our developer customers who choose to use the same JSDK as Eclipse, this\nprevents Eclipse from starting (ClassCastException in .log file).  We can\u0027t\nsuggest that our users install the JAR files into the jre/lib/endorsed folder\n(as bug #19252 recommends), as it is not supported by Java versions prior to\n1.4.  Adding the Xerces classes to our own JAR files makes them larger than we\nwould like (one of our turnkey products is an applet).\n\nRequiring the user to include additional JAR files in the classpath is\ncumbersome, as they may have already deployed applications of their own using\njust the one JAR file and be resistant to changing their procedures for us. \nHowever, right now that seems to be our best choice.\n",
    "Is there any movement on this bug?\n\nA solution to this is dead simple - use a special jar classloader for all\ninternal uses of Xerces. It will thus not appear in the plugin classloader\nchain(s) at all and it will be insensitive to what is installed in the JRE.\n\nThis approach means that people who depend on the current behavior will have to\nchange. What better time than 3.0, when APIs are breaking all over the place, to\nfix it?",
    "To be able to install and use Xerces from ASF or Eclipse side by side, you may \ntry to set the context classloader with this statement (before you try to use \nany Xerces factory):\n\ncurrentThread.setContextClassLoader(my.xerces.plugin.XercesPlugin.getDefault\n().getDescriptor().getPluginClassLoader());\n\nNow, a call like:\n\nSAXBuilder builder \u003d new SAXBuilder(\"org.apache.xerces.parsers.SAXParser\",\nvalidate);\n\nshould succeed.\nIn this statement, my.xerces.plugin.XercesPlugin is the plugin class that \ncontains the Xerces jars: this plugin must NOT have the Eclipse Xerces plugin \nin its dependencies!\nThis should also works when Xerces has been installed as an endorsed \nextension, in this case replace the plugin classloader with the one you ar \nusing:\n\ncurrentThread.setContextClassLoader(this.getClass().getClassLoader());\n\nBut this case has not been tested.",
    "Fixed. As of this week\u0027s integration build, Eclipse no longer includes a copy of\nxerces."
  ],
  "commentCreationDates": [
    "2003-04-18T04:29:08+02:00",
    "2003-04-18T16:47:22+02:00",
    "2003-06-24T09:01:27+02:00",
    "2003-07-03T20:46:56+02:00",
    "2003-07-04T16:50:26+02:00",
    "2003-07-18T22:12:11+02:00",
    "2003-08-09T01:26:07+02:00",
    "2003-09-01T00:38:54+02:00",
    "2003-11-03T21:42:09+01:00",
    "2004-04-07T22:32:34+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassNotFoundException",
      "message": "org.apache.xerces.parsers.SAXParser",
      "elements": [
        {
          "method": "org.xml.sax.helpers.XMLReaderFactory.createXMLReader",
          "source": "XMLReaderFactory.java:121"
        }
      ],
      "number": 0,
      "commentIndex": 2,
      "bugId": "36643",
      "date": "2003-06-24T09:01:27+02:00",
      "product": "Platform",
      "component": "Resources",
      "severity": "normal"
    }
  ],
  "groupId": "36643",
  "bugId": "36643",
  "date": "2003-04-18T04:29:08+02:00",
  "product": "Platform",
  "component": "Resources",
  "severity": "normal"
}