{
  "comments": [
    "Reported by Daniel Megert in bug 49379.\n\nBug 49379 comment 11:\n\n\"I have I20040204 and developping for the 3.0 stream works fine. However, since I\nhave to provide a fix for 2.1.3 I started my 2.1 maintenance workspace up using\nI20040204. This works as expected. But when I try to launch a target workspace\nusing PDE\u0027s Run-time Workbench launch configuration (I clear the workspace) I get:\n\n!SESSION ----------------------------------------------------------------------\n!ENTRY org.eclipse.core.launcher 4 0 Feb 05, 2004 12:52:26.28\n!MESSAGE Exception launching the Eclipse Platform:\n!STACK\njava.lang.IllegalStateException: Unable to acquire application service\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:100)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)\n\tat\nsun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)\n\tat java.lang.reflect.Method.invoke(Method.java:324)\n\tat org.eclipse.core.launcher.Main.basicRun(Main.java:279)\n\tat org.eclipse.core.launcher.Main.run(Main.java:742)\n\tat org.eclipse.core.launcher.Main.main(Main.java:581)\n\nI deleted all possible .config directories  - no luck. Before the OSGI story I\nwas able to run my old workspace and also run targets. This is now no longer\npossible.\"\n\nBug 49379 comment 12:\n\n\"Note: I now restarted my 2.1.x workspace using 3.0 M4, added a new Run-time\nWorkbench launch config (as I did before) and it works like a charm hence I\nassume this to work with latest 3.0 builds as well.\"",
    "\"...I started my 2.1 maintenance workspace...\"\n\nThe problem you described shows that the runtime for 3.0 is being used to start\nEclipse from Eclipse (not what you want). \n\nCan you confirm you have only 2.1.* plugins in your launch configuration (either\nby importing from a 2.1.* install, having a 2.1.* as target platform, or\nchecking them out from CVS)?",
    "I guess I found the problem: the target platform was I20040204 and hence it used\nthis one for launching. I changed the target platform to be 2.1.2 and now it works.\n\nI can\u0027t tell for sure but I think PDE automatically \"updated\" the target\nworkspace and launch config.",
    "Ok, this is good. I will close this one. Feel free to open a different issue\nagainst PDE/UI.",
    "Agree.\n\nFYI: I guess PDE automatically updates the target unless set manually. I did not\nnotice this since I launch without any external plug-in from the target location\n(I have everything in the 2.1.2 workspace). BUT: the target seems to have an\neffect on the  Run-time launch config behavior itself.",
    "There were a number of changes in PDE to handle the new launch requirements for \nthe 3.0 runtime.  PDE detects the flavour of target and uses different \ntechniques depending on the target.  So yes, the nature of your target does \naffect how the target is launched.\n\nAs for updating the target automaticaly, you would have ot ask the PDE folks \nbut there is a \"use this applicaiton as the target\" option.  If that is \nselected, I would expect it to be updated as I change what Eclipse I was using \nfor the dev environment.",
    "\u003ebut there is a \"use this applicaiton as the target\" option.  If that is \n\nWell that\u0027s what I did and that preference has gone and this probably triggered\nthe error.\n",
    "The \"Use this application\" option was redundant and confusing to users.  PDE \nis able to determine this implicitly without confusing the user with two \noptions.\n\nYour host platform remains equal to your target platform, until you explicitly \nchange the target platform value to a different one.\nThis way, if you launch different instances of Eclipse on the same workspace, \nevery time your worbench opens, your target platform would be adjusted to be \nequal to your host platform (as if the old option were still there).\n\nIn your case, you launched a 3.0 platform on a 2.1 workbench, so the target \nplatform is 3.0 and that is why you ran into the error.  No surprises there.  \nIt is the expected behavior since in this workspace, you had the default \nbehavior (target \u003d\u003d host).\n\nIf you do development for a 2.1 platform using a 3.0 host platform, you have \nto explicitly change the target platform in the preferences.  This is how \nthings work and always have worked.\n",
    "Dani, regarding comment #4, which is what is causing the confusion:\nTo be able to launch, PDE needs to specify the location of startup.jar.  This \nJAR is the one found in the target platform.\nSo when all your external plug-ins are uncheked, you would be running with \nworkspace plug-ins only as you expect, but with the startup.jar of your target \nplatform.\n\nIn the case here, the startup.jar is a 3.0 JAR which is incompatible with your \n2.1.x workspace plug-ins.  That is why it is necessary to always specify the \ntarget platform against which your workspace plug-ins are meant to be \ndeployed, even if all the external plug-ins remain unchecked.",
    "Wassim,\n\nsounds all fair and I understand the technical implementation when reading your\ncomments BUT it is still confusing for a user (at least it was for me): I have\nall needed plug-ins in my workspace and when running I have nothing checked from\nthe external plug-ins. Since I used 3.0 builds (before OSGi) to launch my\nself-containing (at least I thought so ;-) 2.1.x workspace I saw no reason why\nit should no longer work. Hence I filed the bug report.\n\nIf there is a dependency to the target location when launching then this should\nbe indicated somewhere in the launch configuration.",
    "If your target platform is 3.0, and you did not have any of the osgi plug-ins \nchecked, the launch certainly aborts/should abort with an error message.\nAre you sure none of the external plug-ins were checked?  If so, then it\u0027s a \nvalid bug.",
    "also, were any of the osgi plug-ins in your workspace?",
    "No external plug-ins checked and no OSGi stuff in the workspace.\n",
    "Sounds like there is something in there with the preference going away.  If the \nworkspace has no OSGi stuff and the target is a 3.0 platform, it should \ndefinitely bail.  Should be reasonably easy to reproduce this no?\n",
    "the preference has nothing to do with it.  Theoretically, it should be easy to \nreproduce.  ",
    "\u003eand the target is a 3.0 platform,\nI start with 3.0 but the code in the workspace is 2.1. The target is pointing to\n3.0. Due to this the Run-time worbench launch config expects osgi stuff - at\nleast that\u0027s what I see.",
    "Wassim, I have a question about the new UI: how do I restore the current\napplication as the target platform after it has been changed to something else?\nIt seems I have to find its location by hand (tried leaving the field empty, but\nit didn\u0027t work).",
    "Restore defaults didn\u0027t work as well. BTW, build is: N20040206.",
    "Browsing to the location of your host Eclipse install location ought to do it.",
    "Opened separate bug 51391 for this.",
    "I imported org.eclipse.jdt.ui and all its pre-reqs from a 2.1.2 build into my \nworkspace.I then changed the target platform to a 3.0 platform.\n\nScenario 1: I disabled all external (3.0) plug-ins.\nWhen I tried to launch, the launch aborted with an error dialog saying that \nseveral osgi plug-ins are missing, which is the expected behavior that Dani \nclaimed did not see.\n\nScenario 2: I enabled all external (3.0) plug-ins.\nThis time the launch proceeded of course because all the required plug-ins \nthat OSGi requires are found (i.e. they are external and checked).  The \nworkbench failed to start, again as expected, telling you to open the log.  \nWhen you open the log, you will see that the 3.0 startup.jar obviously did not \nlike the 2.1.2 core.runtime plug-in in my workspace.\n\nBottom line is that the user should be aware of a target platform really means.\nIn both scenarios however, there were enough details to figure out what is \nwrong.\n\nDani, you said that PDE allowed the launch to proceed even when all the 3.0 \nexternal plug-ins are checked (i.e. you did not get the error dialog).  This \nis the reason why this bug report is open as PDE should warn if you are \nmissing the crucial osgi plug-ins when launching against a 3.0 target platform.\nIs there any other subtle yet important detail about your setup that could \nhave caused this?\n",
    "\u003escenario 1. Where did I say this? If I did so, then sorry - that was wrong\nthen. But when you look at comment 2 and comment 9 I describe that I have a self\ncontaining workspace and cannot launch. Yes the dialog tells me about OSGi stuff\nwhich is needed. Why? I have a self containing workspace. This only confused me\nsince the workspace worked for months like a charm.\n\n\u003eIn both scenarios however, there were enough details to figure out what is \n\u003ewrong.\nI disagree ;-) \n\nNeither:\n\n A ava.lang.IllegalStateException: Unable to acquire application service\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:100)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)\n\nnor a dialog that tells me for my 2.1 workspace that OSGi plug-ins are needed\nare enough detailed information - ok maybe detailed but not user friendly. \n\nIn my opinion the user doesn\u0027t even need to be informed in any detail because he\n expects his workspace to simply startup. Assume: he never touched the PDE\ntarget preference and was able to launch up to now, so saying the problem is the\nuser\u0027s side and he should have been smart enough to figure that out is just not\nright. \nIf he has to set the target property then he can expect a human readable dialog\nwhich tells:\n\nLaunch failed. You are either missing some startup plug-ins (OSGi) for your 3.0\nworkspace or the PDE target preference does not point to the correct location.\nHowever, up to now I thought that PDE could detect what\u0027s my workspace version\nand also what\u0027s at the target location - but maybe that\u0027s not true. If you know\nthis information then you could include this information in the warning dialog.\n",
    "\u003eI have a self containing workspace and cannot launch.\nAs I said before, this is not quite true.  If you also had startup.jar in your \nworkspace, then you would have a self-containing workspace.\nYou can\u0027t expect to run against the 3.0 startup.jar and not play by its rule.  \n\nThe fact of the matter is that being aware of the target platform is a \nrequirement for any developer using Eclipse, if you are not going to have all \nyour plug-ins in your workspace including the one supplying the startup.jar.\n\n\u003eIf he has to set the target property then he can expect a human readable \n\u003edialog which tells...\nA tad harsh...\nAborting the launch and telling you exactly what plug-ins you are missing from \nyour configuration seems pretty reasonable.\n\n\u003ePDE could detect what\u0027s my workspace version and also what\u0027s at the target \n\u003elocation \nwe can determine if your target platform is OSGi-based or not, and that is how \nwe determine if we should do things in legacy mode or OSGi mode, since this is \nthe platform against which you are supposedly developing your plug-ins.\nWhat versions of plug-ins you are working on in your workspace is irrelevant \nand not taken into account. Your workspace plug-ins can have version 6.0 on \nthem, for all we know (much like WSADIE).\n\nBottom line is that PDE does a lot magic behind the scenes and hides as many \ndetails as possible from the user, but at the very least one should be aware \nof a target platform is, as it is the foundation of our self-hosting story.\nIt does not seem to be too much to ask.",
    "So you say I simply need to import the startup.jar in into the startup plug-in\nwhich currently only holds the source and it works, right?\n",
    "Yes, that is what I am claiming.  If you have the plug-in org.eclipse.platform \nin your workspace containing the startup.jar (in JAR or source form), you \nwould run just fine.",
    "actually, maybe it won\u0027t work.  But it should and hence we\u0027ll keep this bug \nreport open ;-)",
    "I always had org.eclipse.platform in my 2.1 workspace but this does not contain\nthe startup.jar. \n\nI now included the startup.jar manually and put it on the build path of\norg.eclipse.platform\n\n\u003d\u003d\u003e\n!ENTRY org.eclipse.core.runtime 4 2 Feb 12, 2004 09:33:18.151\n!MESSAGE Problems occurred when invoking code from plug-in:\n\"org.eclipse.core.runtime\".\n!STACK 0\njava.lang.IllegalArgumentException: Argument cannot be null\n\tat org.eclipse.swt.SWT.error(SWT.java:2594)\n\tat org.eclipse.swt.SWT.error(SWT.java:2538)\n\tat org.eclipse.swt.widgets.Widget.error(Widget.java:377)\n\tat org.eclipse.swt.widgets.Combo.indexOf(Combo.java:772)\n\tat org.eclipse.swt.widgets.Combo.indexOf(Combo.java:749)\n\tat\norg.eclipse.pde.internal.ui.launcher.BasicLauncherTab.initializeApplicationSection(BasicLauncherTab.java:363)\n\tat\norg.eclipse.pde.internal.ui.launcher.BasicLauncherTab.initializeFrom(BasicLauncherTab.java:321)\n\tat\norg.eclipse.pde.internal.ui.launcher.WorkbenchLauncherTabGroup$1.run(WorkbenchLauncherTabGroup.java:67)\n\tat org.eclipse.swt.custom.BusyIndicator.showWhile(BusyIndicator.java:84)\n\tat\norg.eclipse.pde.internal.ui.launcher.WorkbenchLauncherTabGroup.initializeFrom(WorkbenchLauncherTabGroup.java:49)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer.displayInstanceTabs(LaunchConfigurationTabGroupViewer.java:535)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer$5.run(LaunchConfigurationTabGroupViewer.java:468)\n\tat org.eclipse.swt.custom.BusyIndicator.showWhile(BusyIndicator.java:84)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer.inputChanged(LaunchConfigurationTabGroupViewer.java:485)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer.setInput(LaunchConfigurationTabGroupViewer.java:449)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.handleLaunchConfigurationSelectionChanged(LaunchConfigurationsDialog.java:798)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog$2.selectionChanged(LaunchConfigurationsDialog.java:570)\n\tat org.eclipse.jface.viewers.Viewer$2.run(Viewer.java:159)\n\tat\norg.eclipse.core.internal.runtime.InternalPlatform.run(InternalPlatform.java:819)\n\tat org.eclipse.core.runtime.Platform.run(Platform.java:493)\n\tat org.eclipse.jface.viewers.Viewer.fireSelectionChanged(Viewer.java:157)\n\tat\norg.eclipse.jface.viewers.StructuredViewer.updateSelection(StructuredViewer.java:1310)\n\tat\norg.eclipse.jface.viewers.StructuredViewer.setSelection(StructuredViewer.java:1033)\n\tat org.eclipse.jface.viewers.Viewer.setSelection(Viewer.java:362)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.doInitialTreeSelection(LaunchConfigurationsDialog.java:383)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.initializeContent(LaunchConfigurationsDialog.java:324)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.createContents(LaunchConfigurationsDialog.java:319)\n\tat org.eclipse.jface.window.Window.create(Window.java:341)\n\tat org.eclipse.jface.dialogs.Dialog.create(Dialog.java:855)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.create(LaunchConfigurationsDialog.java:1743)\n\tat org.eclipse.jface.window.Window.open(Window.java:616)\n\tat\norg.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.open(LaunchConfigurationsDialog.java:440)\n\tat org.eclipse.debug.ui.DebugUITools$1.run(DebugUITools.java:393)\n\tat org.eclipse.swt.custom.BusyIndicator.showWhile(BusyIndicator.java:84)\n\tat\norg.eclipse.debug.ui.DebugUITools.openLaunchConfigurationDialogOnGroup(DebugUITools.java:397)\n\tat\norg.eclipse.debug.ui.DebugUITools.openLaunchConfigurationDialogOnGroup(DebugUITools.java:339)\n\tat\norg.eclipse.debug.ui.actions.OpenLaunchDialogAction.run(OpenLaunchDialogAction.java:79)\n\tat org.eclipse.jface.action.Action.runWithEvent(Action.java:881)\n\tat\norg.eclipse.jface.action.ActionContributionItem.handleWidgetSelection(ActionContributionItem.java:536)\n\tat\norg.eclipse.jface.action.ActionContributionItem.access$2(ActionContributionItem.java:488)\n\tat\norg.eclipse.jface.action.ActionContributionItem$5.handleEvent(ActionContributionItem.java:420)\n\tat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:82)\n\tat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:833)\n\tat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:2348)\n\tat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2029)\n\tat org.eclipse.ui.internal.Workbench.runEventLoop(Workbench.java:1550)\n\tat org.eclipse.ui.internal.Workbench.runUI(Workbench.java:1526)\n\tat org.eclipse.ui.internal.Workbench.createAndRunWorkbench(Workbench.java:265)\n\tat org.eclipse.ui.PlatformUI.createAndRunWorkbench(PlatformUI.java:139)\n\tat org.eclipse.ui.internal.ide.IDEApplication.run(IDEApplication.java:47)\n\tat\norg.eclipse.core.internal.runtime.PlatformActivator$1.run(PlatformActivator.java:257)\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:104)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)\n\tat\nsun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)\n\tat java.lang.reflect.Method.invoke(Method.java:324)\n\tat org.eclipse.core.launcher.Main.basicRun(Main.java:279)\n\tat org.eclipse.core.launcher.Main.run(Main.java:742)\n\tat org.eclipse.core.launcher.Main.main(Main.java:581)\n",
    "The existing configs can\u0027t be opened anymore and I cannot add new ones :-(\nI could no longer add or delete any PDE launch config - even after deleting the\nJAR again. Only changing the target preference to 2.1.2 fixed the problem again.",
    "I knew something crazy like that might happen, but I guess comment #25 did not \ndeter you from trying it \u003cg\u003e\n\nI realized there is another problem.  The application that we launch is the \none specified in the install.ini in your target platform.  So I believe we are \nfinding org.eclipse.ui.ide.workbench, while the one you want is the old \norg.eclipse.ui.workbench.\n\nIn any event, please target 2.1.2 for now (i.e. the way God intended people to \nself-host :-), and I will come up with a solution for a setup like yours.",
    "Thanks, God ;-)",
    "Fixed.\nThe problem that Dani reported in comment #26 is due to us counting on \nan \"install.ini\" file to be there, when it wasn\u0027t.\n\nPeople should now be able to self-host without setting the target platform \nonly if they have appropriate startup.jar imported into org.eclipse.platform \nin their workspace.\n\nDani, keep in mind, that, although this is now possible, it goes not only \nagainst the self-hosting rules of engagement, but also against the laws of man \nand nature :-)"
  ],
  "commentCreationDates": [
    "2004-02-05T14:34:52+01:00",
    "2004-02-05T14:42:19+01:00",
    "2004-02-05T15:14:11+01:00",
    "2004-02-05T15:22:55+01:00",
    "2004-02-05T15:24:31+01:00",
    "2004-02-05T19:55:50+01:00",
    "2004-02-06T07:42:41+01:00",
    "2004-02-07T03:51:29+01:00",
    "2004-02-07T04:43:36+01:00",
    "2004-02-09T09:40:26+01:00",
    "2004-02-09T12:55:04+01:00",
    "2004-02-09T12:56:33+01:00",
    "2004-02-09T13:34:04+01:00",
    "2004-02-09T19:06:22+01:00",
    "2004-02-09T19:12:45+01:00",
    "2004-02-09T19:14:14+01:00",
    "2004-02-09T19:50:13+01:00",
    "2004-02-09T19:51:44+01:00",
    "2004-02-09T19:53:55+01:00",
    "2004-02-09T20:08:13+01:00",
    "2004-02-12T04:43:58+01:00",
    "2004-02-12T07:28:57+01:00",
    "2004-02-12T08:08:15+01:00",
    "2004-02-12T08:15:41+01:00",
    "2004-02-12T08:19:59+01:00",
    "2004-02-12T08:22:40+01:00",
    "2004-02-12T08:43:39+01:00",
    "2004-02-12T08:48:09+01:00",
    "2004-02-12T08:55:40+01:00",
    "2004-02-12T09:03:12+01:00",
    "2004-03-02T04:59:25+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.IllegalStateException",
      "message": "Unable to acquire application service",
      "elements": [
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:100"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "NativeMethodAccessorImpl.java:39"
        },
        {
          "method": "sun.reflect.DelegatingMethodAccessorImpl.invoke",
          "source": "DelegatingMethodAccessorImpl.java:25"
        },
        {
          "method": "java.lang.reflect.Method.invoke",
          "source": "Method.java:324"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:279"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:742"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:581"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "51237",
      "date": "2004-02-05T14:34:52+01:00",
      "product": "PDE",
      "component": "UI",
      "severity": "normal"
    },
    {
      "exceptionType": "ava.lang.IllegalStateException",
      "message": "Unable to acquire application service",
      "elements": [
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:100"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "NativeMethodAccessorImpl.java:39"
        }
      ],
      "number": 1,
      "commentIndex": 21,
      "bugId": "51237",
      "date": "2004-02-12T07:28:57+01:00",
      "product": "PDE",
      "component": "UI",
      "severity": "normal"
    },
    {
      "exceptionType": "java.lang.IllegalArgumentException",
      "message": "Argument cannot be null",
      "elements": [
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2594"
        },
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2538"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.error",
          "source": "Widget.java:377"
        },
        {
          "method": "org.eclipse.swt.widgets.Combo.indexOf",
          "source": "Combo.java:772"
        },
        {
          "method": "org.eclipse.swt.widgets.Combo.indexOf",
          "source": "Combo.java:749"
        },
        {
          "method": "org.eclipse.pde.internal.ui.launcher.BasicLauncherTab.initializeApplicationSection",
          "source": "BasicLauncherTab.java:363"
        },
        {
          "method": "org.eclipse.pde.internal.ui.launcher.BasicLauncherTab.initializeFrom",
          "source": "BasicLauncherTab.java:321"
        },
        {
          "method": "org.eclipse.pde.internal.ui.launcher.WorkbenchLauncherTabGroup$1.run",
          "source": "WorkbenchLauncherTabGroup.java:67"
        },
        {
          "method": "org.eclipse.swt.custom.BusyIndicator.showWhile",
          "source": "BusyIndicator.java:84"
        },
        {
          "method": "org.eclipse.pde.internal.ui.launcher.WorkbenchLauncherTabGroup.initializeFrom",
          "source": "WorkbenchLauncherTabGroup.java:49"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer.displayInstanceTabs",
          "source": "LaunchConfigurationTabGroupViewer.java:535"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer$5.run",
          "source": "LaunchConfigurationTabGroupViewer.java:468"
        },
        {
          "method": "org.eclipse.swt.custom.BusyIndicator.showWhile",
          "source": "BusyIndicator.java:84"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer.inputChanged",
          "source": "LaunchConfigurationTabGroupViewer.java:485"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationTabGroupViewer.setInput",
          "source": "LaunchConfigurationTabGroupViewer.java:449"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.handleLaunchConfigurationSelectionChanged",
          "source": "LaunchConfigurationsDialog.java:798"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog$2.selectionChanged",
          "source": "LaunchConfigurationsDialog.java:570"
        },
        {
          "method": "org.eclipse.jface.viewers.Viewer$2.run",
          "source": "Viewer.java:159"
        },
        {
          "method": "org.eclipse.core.internal.runtime.InternalPlatform.run",
          "source": "InternalPlatform.java:819"
        },
        {
          "method": "org.eclipse.core.runtime.Platform.run",
          "source": "Platform.java:493"
        },
        {
          "method": "org.eclipse.jface.viewers.Viewer.fireSelectionChanged",
          "source": "Viewer.java:157"
        },
        {
          "method": "org.eclipse.jface.viewers.StructuredViewer.updateSelection",
          "source": "StructuredViewer.java:1310"
        },
        {
          "method": "org.eclipse.jface.viewers.StructuredViewer.setSelection",
          "source": "StructuredViewer.java:1033"
        },
        {
          "method": "org.eclipse.jface.viewers.Viewer.setSelection",
          "source": "Viewer.java:362"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.doInitialTreeSelection",
          "source": "LaunchConfigurationsDialog.java:383"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.initializeContent",
          "source": "LaunchConfigurationsDialog.java:324"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.createContents",
          "source": "LaunchConfigurationsDialog.java:319"
        },
        {
          "method": "org.eclipse.jface.window.Window.create",
          "source": "Window.java:341"
        },
        {
          "method": "org.eclipse.jface.dialogs.Dialog.create",
          "source": "Dialog.java:855"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.create",
          "source": "LaunchConfigurationsDialog.java:1743"
        },
        {
          "method": "org.eclipse.jface.window.Window.open",
          "source": "Window.java:616"
        },
        {
          "method": "org.eclipse.debug.internal.ui.launchConfigurations.LaunchConfigurationsDialog.open",
          "source": "LaunchConfigurationsDialog.java:440"
        },
        {
          "method": "org.eclipse.debug.ui.DebugUITools$1.run",
          "source": "DebugUITools.java:393"
        },
        {
          "method": "org.eclipse.swt.custom.BusyIndicator.showWhile",
          "source": "BusyIndicator.java:84"
        },
        {
          "method": "org.eclipse.debug.ui.DebugUITools.openLaunchConfigurationDialogOnGroup",
          "source": "DebugUITools.java:397"
        },
        {
          "method": "org.eclipse.debug.ui.DebugUITools.openLaunchConfigurationDialogOnGroup",
          "source": "DebugUITools.java:339"
        },
        {
          "method": "org.eclipse.debug.ui.actions.OpenLaunchDialogAction.run",
          "source": "OpenLaunchDialogAction.java:79"
        },
        {
          "method": "org.eclipse.jface.action.Action.runWithEvent",
          "source": "Action.java:881"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection",
          "source": "ActionContributionItem.java:536"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.access$2",
          "source": "ActionContributionItem.java:488"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem$5.handleEvent",
          "source": "ActionContributionItem.java:420"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:82"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:833"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:2348"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2029"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runEventLoop",
          "source": "Workbench.java:1550"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runUI",
          "source": "Workbench.java:1526"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.createAndRunWorkbench",
          "source": "Workbench.java:265"
        },
        {
          "method": "org.eclipse.ui.PlatformUI.createAndRunWorkbench",
          "source": "PlatformUI.java:139"
        },
        {
          "method": "org.eclipse.ui.internal.ide.IDEApplication.run",
          "source": "IDEApplication.java:47"
        },
        {
          "method": "org.eclipse.core.internal.runtime.PlatformActivator$1.run",
          "source": "PlatformActivator.java:257"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:104"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "NativeMethodAccessorImpl.java:39"
        },
        {
          "method": "sun.reflect.DelegatingMethodAccessorImpl.invoke",
          "source": "DelegatingMethodAccessorImpl.java:25"
        },
        {
          "method": "java.lang.reflect.Method.invoke",
          "source": "Method.java:324"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:279"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:742"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:581"
        }
      ],
      "number": 2,
      "commentIndex": 26,
      "bugId": "51237",
      "date": "2004-02-12T08:43:39+01:00",
      "product": "PDE",
      "component": "UI",
      "severity": "normal"
    }
  ],
  "groupId": "51237",
  "bugId": "51237",
  "date": "2004-02-05T14:34:52+01:00",
  "product": "PDE",
  "component": "UI",
  "severity": "normal"
}