{
  "comments": [
    "Cannot launch and profile local applications due to incorrect classpath in \nHyades 3.0.\n\nFor example, using the Hyades Apache Commons Logging Sample, trying to launch \nthe HyadesLoggingCommonsSample class in profiling mode (e.g. Run \u003e\u003e Profile \u003e\u003e \nJava Application \u003e\u003e HyadesLoggingCommonsSample) with logging enabled and the \norg.eclipse.hyades.logging.commons.sample.HyadesLoggingCommonsSample logging \nLogging Agent added to the list of Logging Agents (see the example\u0027s readme), \nthe following output is written to the Profiling Console:\n\njava.lang.NoClassDefFoundError: \norg/eclipse/hyades/logging/commons/sample/HyadesLoggingCommonsSample",
    "This is caused by a lack of classpath delimiters; the classpath entries are \nsimply concatenated, so the initial entry that contains the main class is no \nlonger read properly by the VM, and the main class can\u0027t be found. To be fixed \nafter M8.\n",
    "Fixed.",
    "Closing.",
    "*** Bug 57740 has been marked as a duplicate of this bug. ***",
    "house keeping",
    "\nThis problem has reappeared.\nFrom newsgroup:\n\nI have problem profiling applications from Eclipse using Hyades plugin.\nWhen I run application, that doesn\u0027t reference any external jars it runs OK.\n\nWhen I start Profiling an application which references classes I am getting NoClassDefFoundError, but \nwhen I check the application properties, the jar in question is listed in classpath.\n\njava.lang.NoClassDefFoundError: org/apache/lucene/analysis/Analyzer\nat com.insightful.infact.ontology.util.OntologyLookup.main(OntologyLookup.java:92)\nException in thread \"main\" Note that I am using for profiling same Run/Debug eclipse profile which \nworks OK otherwise.\nI also tried creating standalone java application result, but get the same result.\n\nI use Eclipse 3.1, Haydes 3.2.0, (had same problems with Haydes 3.1).\nJava 1.4.2_03.\nPlatform is Windows XP.\n",
    "Terry, please have a look..  this one is important.",
    "Eclipse 3.1 is not the support base of Haydes 3.2.0. Only Eclipse 3.0.x is \nsupport on Hyades 3.2.0. The current plan is Hyades 4.x on Eclipse 3.1.x.\n ",
    "The scenario I ran was as follows.\nI created an application that references classes in external jar files.  I \ntested some variations on this.  I had the main method in the jar file, the \nmain method in the workspace, which called classes in the external jar files.  \nI also just ran the applications in the workspace.\n\nI was unable to reproduce this with the latest code from HEAD and Eclipse 3.0.1.\n\nI also grabbed Eclipse 3.1 with new EMF-SDO-XSD drivers from www.eclipse.org.  \nI tried the different scenarios again, with the latest code from HEAD.  I was \nunable to reproduce the problem.  However, we aren\u0027t currently supporting \nHyades 3.2 on top of Eclipse 3.1.  While I was able to launch the workbench, \nthere were many compile errors with this arrangement, that would affect other \nareas of Hyades.",
    "Do you get into the same problems if you try to just run instead of profile ?",
    "Unable to reproduce the problem using Hyades 3.2 on Eclipse 3.0.1\n\n",
    "Working as designed.  Verified in Toronto\u0027s 20041117_1805 (HEAD) build on \nNovember 22, 2004.",
    "Closing.",
    "I have installed Eclipse 3.01 and reinstalled Hyades 3.2, and I am still \ngetting NoClassDefFoundError, when I profile the application and class is \nlocated in jar file.\nSo Eclipse 3.1 is not the culprit.\nIt must be something peculiar in my setup, the main application class is in \nclasses subdirectory of the current application directory, but external jars \nare in ../external/lib/*.jar jar files.\nWhen I check the properties dialog, the jars are in the classpath properly, \nbut profiler cannot find them (sorry I cannot copy the classpath from the \ndialog, because the properties dialog is non-sensitive, and doesn\u0027t allow \ncopy).\n\nIt looks like the bug should be reopened, and I would be glad to help to debug \nthe problem.\n\n",
    "Terry, can you please take a look at this again.",
    "I found that a class not found exception can occur if the class path has new \nline characters in it.  We updated the source to fix this particular problem.",
    "Verified in Toronto\u0027s 20041206_1849 (HEAD) build on December 7, 2004.",
    "Closing."
  ],
  "commentCreationDates": [
    "2004-03-18T23:12:47+01:00",
    "2004-03-22T17:37:05+01:00",
    "2004-03-23T18:12:34+01:00",
    "2004-04-01T17:57:30+02:00",
    "2004-04-07T22:18:13+02:00",
    "2004-11-03T16:15:57+01:00",
    "2004-11-18T03:39:00+01:00",
    "2004-11-18T03:39:53+01:00",
    "2004-11-18T15:15:34+01:00",
    "2004-11-18T16:20:48+01:00",
    "2004-11-18T17:10:32+01:00",
    "2004-11-19T14:52:40+01:00",
    "2004-11-22T13:33:55+01:00",
    "2004-11-22T13:34:02+01:00",
    "2004-11-25T17:30:43+01:00",
    "2004-11-25T17:39:13+01:00",
    "2004-11-30T16:43:26+01:00",
    "2004-12-07T16:00:10+01:00",
    "2004-12-07T16:00:19+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NoClassDefFoundError",
      "message": "org/apache/lucene/analysis/Analyzer",
      "elements": [
        {
          "method": "com.insightful.infact.ontology.util.OntologyLookup.main",
          "source": "OntologyLookup.java:92"
        }
      ],
      "number": 0,
      "commentIndex": 6,
      "bugId": "55310",
      "date": "2004-11-18T03:39:00+01:00",
      "product": "Hyades",
      "component": "UI",
      "severity": "major"
    }
  ],
  "groupId": "55310",
  "bugId": "55310",
  "date": "2004-03-18T23:12:47+01:00",
  "product": "Hyades",
  "component": "UI",
  "severity": "major"
}