{
  "comments": [
    "64 bit VM can not run eclipse because of native library support required.\n\n\nNote: OS: Other was chosen, as XP64 may has to be treated distinct from common \nWindows XP / Win32. A separate OS entry for bugs specifically related to this \nderivative may be considered worthwhile.\n\n\n\u003ejava -version\njava version \"1.5.0-beta\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.5.0-beta-b32c)\nJava HotSpot(TM) 64-Bit Server VM (build 1.5.0-beta-b32c, mixed mode)\n\n\nStarting Eclipse results in a log like\n\n!SESSION Apr 01, 2004 23:19:23.562 ---------------------------------------------\njava.version\u003d1.5.0-beta\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dwin32, ARCH\u003dx86, WS\u003dwin32, NL\u003den_US\n!ENTRY org.eclipse.osgi Apr 01, 2004 23:19:23.562\n!MESSAGE Application error\n!STACK 1\njava.lang.UnsatisfiedLinkError: C:\\Program \nFiles\\eclipse\\plugins\\org.eclipse.swt.win32_3.0.0\\os\\win32\\x86\\swt-win32-\n3044.dll: %1 is not a valid Win32 application\n\tat java.lang.ClassLoader$NativeLibrary.load(Native Method)\n\tat java.lang.ClassLoader.loadLibrary0(ClassLoader.java:1737)\n\tat java.lang.ClassLoader.loadLibrary(ClassLoader.java:1646)\n\tat java.lang.Runtime.loadLibrary0(Runtime.java:817)\n\tat java.lang.System.loadLibrary(System.java:986)\n\tat org.eclipse.swt.internal.Library.loadLibrary(Library.java:100)\n\tat org.eclipse.swt.internal.win32.OS.\u003cclinit\u003e(OS.java:18)\n\tat org.eclipse.swt.widgets.Display.internal_new_GC(Display.java:1605)\n\tat org.eclipse.swt.graphics.Device.init(Device.java:555)\n\tat org.eclipse.swt.widgets.Display.init(Display.java:1630)\n\tat org.eclipse.swt.graphics.Device.\u003cinit\u003e(Device.java:99)\n\tat org.eclipse.swt.widgets.Display.\u003cinit\u003e(Display.java:337)\n\tat org.eclipse.swt.widgets.Display.\u003cinit\u003e(Display.java:333)\n\tat org.eclipse.ui.internal.Workbench.createDisplay(Workbench.java:281)\n\tat org.eclipse.ui.PlatformUI.createDisplay(PlatformUI.java:151)\n\tat org.eclipse.ui.internal.ide.IDEApplication.run\n(IDEApplication.java:66)\n\tat org.eclipse.core.internal.runtime.PlatformActivator$1.run\n(PlatformActivator.java:277)\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run\n(EclipseStarter.java:239)\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run\n(EclipseStarter.java:117)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke\n(NativeMethodAccessorImpl.java:39)\n\tat sun.reflect.DelegatingMethodAccessorImpl.invoke\n(DelegatingMethodAccessorImpl.java:25)\n\tat java.lang.reflect.Method.invoke(Method.java:494)\n\tat org.eclipse.core.launcher.Main.basicRun(Main.java:267)\n\tat org.eclipse.core.launcher.Main.run(Main.java:692)\n\tat org.eclipse.core.launcher.Main.main(Main.java:676)",
    "CC, perhaps a future task to leverage your gtk64 experience? \u003cg\u003e\n",
    "*** Bug 76896 has been marked as a duplicate of this bug. ***",
    "Support for 64bit Windows XP is overdue. This should definitely have high\npriority for the next eclipse!\n\nTip: The developers should consider using a preprocessor or code generator to\ngenerate different variations of source code targeted for 32/64 bit.",
    "*** Bug 101763 has been marked as a duplicate of this bug. ***",
    "Eclipse took on a huge porting responsibility when they chose the SWT route. The\ndemand for native 64-bit Windows is steadily increasing and the major JVM\nvendors take this very seriously. This port should defintely be among the\nsupported ones in my opinion.",
    "Yeah, I was quite disappointed that Eclipse wouldn\u0027t run on 64 bit, as now I\ncan\u0027t use my favorite IDE until it gets updated. I think that this should\ndefinitely be a high-priority fix, as more people are starting to migrate to XP\n64 bit.",
    "*** Bug 113780 has been marked as a duplicate of this bug. ***",
    "May be it is wellknow, but once more - use 32bit version of JDK to run current\nversion of Eclipse on Windows XP x64.",
    "Started porting the SWT sources for my own XP64 environment. Finished porting the C/C++ sources already and they compile without warnings. Currently working on porting the Java side.",
    "Created an attachment (id\u003d32161)\nWindows 64-bit port (native side only)\n\nDid a port of the native side for the SWT dll\u0027s for Windows x64. Used the SWT_PTR macros as defined in swt.h. Now builds without warnings, but still suspect some of the jintArrays should actually be changed to jlongArray, but did not look into that yet.\n\nThe Java part still needs to be modified to handle the larger pointer sizes. Any suggestions on what approach to take there would be more than welcome.",
    "It would make a real difference to us to know whether 64-bit support for Windows was on the 3.2 plan (or, if not, when it might be planned)\n\nI understand that I can still run the 32-bit version of Eclipse on Win64, but am assuming that this does not let me debug - which might be a problem :)",
    "here, here\nwould really love to know when 64 bit is planned. also assuming that it would run faster at the 64 bit level, which is always a plus...",
    "This may not make a big difference for the IDE, but it\u0027s hugely important for RCP-based applications.",
    "I so agree I would really like to see Win64 support in 3.2",
    "Support for Windows 64bit is not on the 3.2 plan.  Currently, it has not been assigned to any release.\n\nTo convert the win32 widget port to 64 bits, several things are needed:\n\n1) Identify all the pointers in the OS API and convert these to long.  On GTK we use /* long */ in the Java JNI code and we use a code generation tool to generate the JNI Java and C code for 64 bit compiles.\n2) Modify all the Java code that makes calls to OS to support longs - again on GTK we use /* long */ in the Java code and run a conversion script to generate the 64 bit version of the Java code.\n3) There are many places in the Java code where we assume we have a 32 bit value and this is no longer true.  These places need to be identified and we need to figure out a strategy for dealing with them.  We did not have this issue on GTK and it is this point that will require the most work.  For example, \n      - In many places we call MoveMemory and we assume the size of the pointer being moved is 4 bytes.  \n      - We perform bitwise operations on lParam and wParam to extract the values (see for example Control.wmLButtonDown where we use LRESULT wmLButtonDown to extract x and y (int x \u003d (short) (lParam \u0026 0xFFFF) and int y \u003d (short) (lParam \u003e\u003e 16))).\n      - Etc.....\n\n\nAnother thing to consider is Vista.  SWT runs on Vista using the win32 widgets because Vista provides backwards compatability.  However to get the full benefit of Vista, SWT will be porting to Avalon (Windows Presentation Foundation for Vista). The win32 port was not written with the intent of supporting 64bit and as a result, it will be quite a large task to port to 64 bits given the number of assumptions that were made.  When the Avalon port is written, the 64 bit platform will be a serious consideration and support can be designed in from day one.  We need to investigate how the API for the Avalon deals with 32 versus 64 bit and build this into the port.",
    "I don\u0027t think that SWT needs to use the Windows Presentation Foundation (WPF) to run well on Vista.  WPF is a Microsoft .NET managed API for .NET applications.  It might be appropriate for a J#.NET application but not for a Java and C application.  I searched Bugzilla and I found bug 78839 for supporting Vista.  It looks like SWT can have the Vista look and feel without using WPF. \n\nYou can read more about WPF at http://windowssdk.msdn.microsoft.com/library/.  Currently the WPF documentation is under WinFX development, Windows Presentation Foundation from that URL.\n\nI agree that it would make sense to port 64-bit Windows using the same technique used for 64-bit GTK.  I agree that it would be quite a bit of work but I\u0027m willing to help out.\n\nI downloaded the Eclipse SDK 3.1.1 source code and the SWT source code and compiled them for both 32-bit and 64-bit.  There are some differences in the build environment when using JDK 5.0\ninstead of 1.4.2 (such as the location of jawt.lib).  There are also some\ndifferences between Visual C++ 6.0 and Visual Studio 2005 (such as obsolete\ncompiler options).  These differences even exist for 32-bit compiles but the upgrades are necessary to consider Windows x64.  These changes may have already been made in Eclipse 3.2.\n\n",
    "I received this note from Arend van Spriel:\nSome time ago I have added an attachment in which I modified all jint parameters to a macro SWT_PTR and alike which expands normally to jint, but when using a -D for 64bit it will expand to jlong. I used the 64-bit compiler included in Visual Studio 2005 with /Wp64 option to get warning regarding pointers and stuff toward the Windows API. I still have some concerns about some jintArrays that probably should be changed to jlongArrays but the compiler did not warn about those. There are not much of those so these must be manually checked against the API. \n \nFor the Java part I understand that for GTK some kind of preprocessing of the sources was done before compilation. Guess a similar approach could be taken for Win64.\n \nGr. AvS\n\nIn response, I would like to say that many of the jintArrays are used when Win32 API calls return pointers as output.  That is, the Win32 API calls take a pointer to a pointer (** or ***).  We cannot rely only upon compiler warnings to find all of the code that needs to change.  There will be a lot of other code to change.  Also, you say that you modified \"all\" jint parameters.  Not all jint parameters need to be modified - only the ones representing handles or pointers.  I think we need to look at the documentation for each API call even though that will take time.\n",
    "I would like to make a note on the compiler.  Visual Studio 2005 is the first development environment to support x64.  Since Visual Studio 2005 is not free, I would like to point out that the Windows Server 2003 SP1 Platform SDK (April 2005 edition) includes command-line compilers for x86, x64 and IA64.  It is even possible to cross-compile provided that the correct JVM libraries are available to link against.\n",
    "*** Bug 131300 has been marked as a duplicate of this bug. ***",
    "Hi people.\n\nOur team has made corresponding changes in Java code (pseudocomments /*long*/ and so on). Totally ~300 files are changed. 64-bit compilation passes OK.\n\nProblem: none of us have committer rights for SWT, so we cannot change CVS ourselves. \n\nWe are ready to upload changed files, but it will need somebody to merge it with latest code, since CVS head is changed constantly. It seems to be heavy activity...\n\n\n",
    "Yes, let\u0027s look at this post 3.2.  What did you do about 3) in comment #15?",
    "Mentioned comment is taken into account. \n\nVariables used as pointers or handles are \nmodified, all native method calls are brought \nto conformity with MSDN specification.\n\n",
    "(In reply to comment #21)\n\u003e Yes, let\u0027s look at this post 3.2.  What did you do about 3) in comment #15?\n\nSteve,\n\nIs it possible to include in 3.2? What is needed for that?\n\nMikhail.",
    "*** Bug 131442 has been marked as a duplicate of this bug. ***",
    "As the work is now done, it would really be nice to have this available as soon as possible - hopefully in 3.2",
    "Created an attachment (id\u003d36808)\nDescription of typical situations related to Win64 support\n\nAttached document contains description of code changes proposed for Win64 support.",
    "Current status:\n- Eclipse already runs on IPF Windows, \n  SWT examples (except Browser) are also functional.\n- Most of proposed code changes are done \n  (see attach for details).\n- Further testing is in progress on IPF,\n  remaining problem (with Browser) is investigated.\n- With x86_64, some extra problems are detected.\n  Investigation is currently in progress.\n- Global merge will be required to synchronize\n  with latest SWT changes. It will be performed \n  after the last problem fix, by authority of \n  SWT team.\n",
    "x86_64 problem: \nTable object does not work correctly\ndue to failures while calling native method\n\"callWindowProc()\" with the following values \nof Msg parameter:\n\nWM_MOUSEMOVE (0x200)\nLVM_GetItemRect (0x100e)\nLVM_HITTEST (0x1012)\nLVM_SetColumnWidth (0x101e) \n\nThere is no such problem on Win32 and on IPF.\nThe C sample programs (sending the same values)  \nwork fine. \n\nInvestigation is in progress.\n",
    "Hello, can someone provide a sort of howto to use win 64 bit port?\ni have compile the dll, but i need to understand how put all togheter with eclipse :) i am sorry, i am a newbie, but i really need to use eclipse on win64. With java 32bit vm,  encounter a lot of problem (black windows with code completition for example) and i cannot spawn jprofiler or other application..\n\nTnx for helping",
    "This is really needed for working on 64bit xp.\nI have been using eclipse 3.1 with the 32 bit vm.\nIt works.\n\nHowever, today I downloaded the m6 release and ran it with the 32 bit vm.\nWhen I brought up the debug window it didn\u0027t show me any debug targets.\nThe list on the left was empty.\n\nBasically with eclipse 3.2 you cannot debug on a 32 bit vm running on xp 64.\n\nCan you guys please look into supporting XP 64 for 3.2\n\n",
    "Currently we have the following situation with 64-bit Windows support on IPF:\n1) All examples from org.eclipse.swt.examples package run clearly except the one for Browser widget. The problem with Browser is under investigation now.\n2) Among ~5300 JUnit test from org.eclipse.swt.tests package we have ~30 failures due to the same minor bug (which does not affect general fuctionality) and ~20 errors which are also under investigation now.",
    "Several problems have been fixed, and now there are only 12 errors, all related to Browser widget, and no failures while running JUnit tests on IPF. Also, we have managed to run Eclipse on IPF by disabling some code in Browser which causes the exception. All other Eclipse functionality seems to work clearly. So, at the moment we have only one problem with SWT port on IA-64 platform and are working towards the solution of this Browser issue.",
    "Status for x86_64 platform:\n\nSeveral problems are fixed, in particular, method \nTable.setColumnWidth() works now.\n\nMost of these problems were related to obsolete data \nstructures.\n\nCurrently, all SWT examples are running ok.\nSWT junit tests behave in the same way as for Win32:\nthere are 3 failures and 7 errors now, mostly on Browser.\n\nBut, Eclipse itself is not fully functional on x86_64:\ncore dumps are raised in some places. Moreover, it does\nnot start with JRockit JVM (works with SUN JVM only).\n\nInvestigation is in progress.\n",
    "Testing procedures used to verify SWT for 64-bit:\n\n1. SWT tests: (org.eclipse.swt.tests.junit.AllTests). They are started\n   from command line and require only swt.jar - no other Eclipse parts\n   are referenced. Results were reported yesterday : they are almost\n   successfull both on IPF and EM64T (the same errors reported as for \n   Win32, mostly for Browser).\n\n2. SWT examples: (org.eclipse.swt.examples). There are 18 apps,\n    all of them run successfully on both platforms. But, these samples\n    do not cover whole functionality, expecially recently-added features. \n\n3. Eclipse usage: after we\u0027ve replaced swt.jar, Eclipse starts on both\n    platforms, and most functionality works OK. In particular, we are\n    using Eclipse for further code modifications and SWT rebuild on\n    target platforms.\n    But we still have some failures in specific places, as I\u0027ve reported.\n\n",
    "Fantastic!",
    "Current status:\n\nEclipse SDK works normally on the following platforms:\n- Win2003 64 bit, Itanium, JVM\u003dJRockit 1_5_0_04\n- Win2003 64 bit, x86_64, JVM\u003dSun 1_5_0_06\n- Win XP  64 bit, x86_64, JVM\u003dSun 1_5_0_06\n\nWhat about x86_64 with JVM\u003dJRockit 1_5_0_06 (R26.3.0), \nfailures occur in autocompletion feature. \nSeems to be JVM-specific. Other features are OK.\n\nBesides SWT, other native modules are recompiled \nfor 64 bit also.\n\nSWT version corresponds to Eclipse 3.2M5 now.\n\nMerge is planned soon to syncronize 64-bit \nversion with the latest SWT changes.\n\n\n",
    "Created an attachment (id\u003d41852)\n64-bit support for SWT - proposed patch\n\nThis patch contains changes made by our team for Win64 support.\nResult is the same as described in Comment #36, but merge was\nperformed with latest SWT changes. Testing was ran again.\n\nNote, patch is large (1.8M, ~40000 lines, 350 files affected).",
    "Created an attachment (id\u003d41995)\nSWT plaform-specific packages for 64-bit support\n\nThese 2 packages are to be added to Eclipse to support 64 bit:\n     org.eclipse.swt.win32.win32.ia64    \n     org.eclipse.swt.win32.win32.x86_64\nEach of these directories contain build.xml, specific \nfor given platform. Other changes are not essential.\n",
    "Created an attachment (id\u003d41996)\nPatch for org.eclipse.swt.tools\\JNI Generation\n\nJNI Generation tool\u0027s configuration files are changed.\nIn fact, there was _NO_ specific changes for Win64,\nbut \"*.properties\" files were brought into accord \nwith latest changes in OS.java and other source files.",
    "A minor point given the excellent work on this...\n\nShouldn\u0027t the packages be something like...\n     org.eclipse.swt.win64.ia64    \n     org.eclipse.swt.win64.x86_64\n\nrather than...\n\n     org.eclipse.swt.win32.win32.ia64    \n     org.eclipse.swt.win32.win32.x86_64\n\n?\n\nIt seems odd to have 64bit code under \"win32\".",
    "Mikhail Voronin from Intel has provided windows x86_64 builds for 3.2 RC4 which I\u0027ve moved to the download page http://download.eclipse.org/eclipse/downloads/drops/S-3.2RC4-200605121600/index.php\n\nThanks for your contribution Mikhail!",
    "Reply to Comment #40 From John Rimell.\n\n\u003e Shouldn\u0027t the packages be something like...\n\u003e     org.eclipse.swt.win64.ia64    \n\u003e     org.eclipse.swt.win64.x86_64\n\u003e rather than...\n\u003e     org.eclipse.swt.win32.win32.ia64    \n\u003e     org.eclipse.swt.win32.win32.x86_64\n\nYou know, package name is constructed from several parts:\n\u003cpackage-specific\u003e.\u003coperating system\u003e.\u003cwindow manager\u003e.\u003cplatform\u003e\nIn our case:\n\u003coperating system\u003e \u003d win32\n\u003cwindow manager\u003e \u003d win32\n\u003cplatform\u003e \u003d ia64 (or x86_64, or x86)\n\nOperating system was not changed really: most features in Win64 work in the same way (from Java\u0027s point of view) as in Win32. So most code written for\nWindows (not for Linux) would work on Win64. The only exception is platform-specific features, but they are tracked by \u003cplaform\u003e parameter, not by \u003cos\u003e.\n\nSo, if we\u0027ll set \u003cos\u003e\u003dwin64, we would have to copy all Java code from \n\"*.win32\" packages to \"*.win64\" ones - although it\u0027s the same code in fact.\nAs a result, there will be 2 copies of the same files in CVS.\n\nThus, it seems to be undesirable to rename Win32 to Win64 now. Sorry.",
    "I gave a try to :\n\u003e http://download.eclipse.org/eclipse/downloads/drops/S-3.2RC4-200605121600/index.php\n\nExcellent job !\n\nI\u0027ve several crashes, memory leaks etc ... Also the appearance is sometimes not consistent with the 32bits version.\n\nDo you think it is useful to report them or it is too soon ?\nIf yes where ?",
    "Answer to Comment #43 From Guillaume BINET.\n\nCould you please put all info about Win64 problems to this bug now ?\nIt will be very useful to know:\n- operating system (XP/Win2003, SPs...)\n- Java machine version\n- how to reproduce problem.\n\nThanks.\n\n\n\n ",
    "Created an attachment (id\u003d42144)\nGuillaume BINET environment\n\nThe environment for the described bugs",
    "Created an attachment (id\u003d42145)\nJVM core dump (References/workspace)\n\nRight click on a Java Class, select references / workspace.",
    "Created an attachment (id\u003d42147)\nJVM core in linked Mode preferences\n\nIn preferences click expand General / Editors / Text Editors and click on Linked Mode",
    "Created an attachment (id\u003d42156)\nSlight differences in the GUI\n\nIt seems that the theme is applied to some elements and not others.",
    "To Guillaume BINET:\n\nThanks for bugs description. Both of them are reproduced.\nIt\u0027s strange but these problems occur with Sun\u0027s JVM only. \nWith JRockit R26.3, there\u0027re no errors in both situations.\n\nFrom the other hand, JRockit has its own bug: Eclipse \nproduces core on autocompetion feature (in Java editor,\ntype \"System.\" and wait for core). I\u0027ve reported it in\ncomment #36. Workaround: disable autocompletion. This\nbug does not occur with Sun !!! \n\nWe\u0027re working on both kind of errors. No results yet.\n\nWhat about themes, I have no idea now. We have not \nchange themes logic at all. Anyway, thanks for info.",
    "To Guillaume BINET:\n\nThanks for bugs description. Both of them are reproduced.\nIt\u0027s strange but these problems occur with Sun\u0027s JVM only. \nWith JRockit R26.3, there\u0027re no errors in both situations.\n\nFrom the other hand, JRockit has its own bug: Eclipse \nproduces core on autocompetion feature (in Java editor,\ntype \"System.\" and wait for core). I\u0027ve reported it in\ncomment #36. Workaround: disable autocompletion. This\nbug does not occur with Sun !!! \n\nWe\u0027re working on both kind of errors. No results yet.\n\nWhat about themes, I have no idea now. We have not \nchange themes logic at all. Anyway, thanks for info.",
    "The new project wizard doesn\u0027t work.\nThe tree doesn\u0027t take any mouse events.\nI cannot select any item from the dialog.\nWhen I move the arrow keys, it scrolls the pane and doesn\u0027t scroll through the items. It winds up selecting all the items in the process. I will attach a screenshot as well",
    "Created an attachment (id\u003d42226)\nA screenshot of the new project dialog\n\n",
    "Created an attachment (id\u003d42227)\nDebug dialog is empty\n\nThere seem to be problems with most dialog.\nThe debug dialog is empty. It doesn\u0027t have any targets",
    "To Guillaume BINET:\n\nI found a fix for bugs you reported.\n\nIt will be included to RC5 build (coming soon for download).\nCurrently, 3 problems (\"Linked Mode\", \"References/workspace\",\n\"Autocompletion\") are eliminated both on Sun and JRockit JVM\u0027s.\nPlease wait for RC5 before further testing: detected bug may\naffect several other features, so they can fail in RC4 only.  \n",
    "NB: \nEclipse RC5 Win64 versions \nfor Itanium and x86_64 \nare put to downaload page.",
    "The new project dialog still doesn\u0027t take any mouse events.\nI cannot expand the tree or select anything in there",
    "Answering to Comment #56 From Roshan:\n\n\u003e The new project dialog still doesn\u0027t take any mouse events.\n\nCould you please define which version of OS and JVM do you use ?\nI still cannot reproduce your problem on x86_64 (XP and Win2003)\nneither with SUN JVM nor with JRockit. \n",
    "Here is the full configuration details\n\n*** Date: Tue May 30 10:30:46 PDT 2006\n\n*** Platform Details:\n\n*** System properties:\nawt.toolkit\u003dsun.awt.windows.WToolkit\neclipse.buildId\u003dI20060519-1206\neclipse.commands\u003d-os\nwin32\n-ws\nwin32\n-arch\namd64\n-launcher\nD:\\ides\\eclipse\\eclipse.exe\n-name\nEclipse\n-showsplash\n600\n-exitdata\ncf4_58\n-vm\nD:\\Java\\jdk1.5.0_06\\bin\\javaw.exe\neclipse.ee.install.verify\u003dfalse\neclipse.product\u003dorg.eclipse.sdk.ide\neclipse.startTime\u003d1149010225708\neclipse.vm\u003dD:\\Java\\jdk1.5.0_06\\bin\\javaw.exe\neclipse.vmargs\u003d-Xms40m\n-Xmx256m\n-jar\nD:\\ides\\eclipse\\startup.jar\neof\u003deof\nfile.encoding\u003dCp1252\nfile.encoding.pkg\u003dsun.io\nfile.separator\u003d\\\njava.awt.graphicsenv\u003dsun.awt.Win32GraphicsEnvironment\njava.awt.printerjob\u003dsun.awt.windows.WPrinterJob\njava.class.path\u003dD:\\ides\\eclipse\\startup.jar\njava.class.version\u003d49.0\njava.endorsed.dirs\u003dD:\\Java\\jdk1.5.0_06\\jre\\lib\\endorsed\njava.ext.dirs\u003dD:\\Java\\jdk1.5.0_06\\jre\\lib\\ext\njava.home\u003dD:\\Java\\jdk1.5.0_06\\jre\njava.io.tmpdir\u003dC:\\DOCUME~1\\rail\\LOCALS~1\\Temp\\\njava.library.path\u003dD:\\Java\\jdk1.5.0_06\\bin;.;C:\\WINDOWS\\system32;C:\\WINDOWS;C:\\Program Files\\Microsoft IntelliType Pro\\;C:\\WINDOWS\\system32;C:\\WINDOWS;C:\\WINDOWS\\System32\\Wbem;C:\\Program Files\\ATI Technologies\\ATI Control Panel\\\njava.runtime.name\u003dJava(TM) 2 Runtime Environment, Standard Edition\njava.runtime.version\u003d1.5.0_06-b05\njava.specification.name\u003dJava Platform API Specification\njava.specification.vendor\u003dSun Microsystems Inc.\njava.specification.version\u003d1.5\njava.vendor\u003dSun Microsystems Inc.\njava.vendor.url\u003dhttp://java.sun.com/\njava.vendor.url.bug\u003dhttp://java.sun.com/cgi-bin/bugreport.cgi\njava.version\u003d1.5.0_06\njava.vm.info\u003dmixed mode\njava.vm.name\u003dJava HotSpot(TM) 64-Bit Server VM\njava.vm.specification.name\u003dJava Virtual Machine Specification\njava.vm.specification.vendor\u003dSun Microsystems Inc.\njava.vm.specification.version\u003d1.0\njava.vm.vendor\u003dSun Microsystems Inc.\njava.vm.version\u003d1.5.0_06-b05\nline.separator\u003d\n\norg.osgi.framework.bootdelegation\u003d*\norg.osgi.framework.executionenvironment\u003dOSGi/Minimum-1.0,OSGi/Minimum-1.1,JRE-1.1,J2SE-1.2,J2SE-1.3,J2SE-1.4,J2SE-1.5\norg.osgi.framework.language\u003den\norg.osgi.framework.os.name\u003dWindows2003\norg.osgi.framework.os.version\u003d5.2\norg.osgi.framework.processor\u003damd64\norg.osgi.framework.system.packages\u003djavax.accessibility,javax.activity,javax.crypto,javax.crypto.interfaces,javax.crypto.spec,javax.imageio,javax.imageio.event,javax.imageio.metadata,javax.imageio.plugins.bmp,javax.imageio.plugins.jpeg,javax.imageio.spi,javax.imageio.stream,javax.management,javax.management.loading,javax.management.modelmbean,javax.management.monitor,javax.management.openmbean,javax.management.relation,javax.management.remote,javax.management.remote.rmi,javax.management.timer,javax.naming,javax.naming.directory,javax.naming.event,javax.naming.ldap,javax.naming.spi,javax.net,javax.net.ssl,javax.print,javax.print.attribute,javax.print.attribute.standard,javax.print.event,javax.rmi,javax.rmi.CORBA,javax.rmi.ssl,javax.security.auth,javax.security.auth.callback,javax.security.auth.kerberos,javax.security.auth.login,javax.security.auth.spi,javax.security.auth.x500,javax.security.cert,javax.security.sasl,javax.sound.midi,javax.sound.midi.spi,javax.sound.sampled,javax.sound.sampled.spi,javax.sql,javax.sql.rowset,javax.sql.rowset.serial,javax.sql.rowset.spi,javax.swing,javax.swing.border,javax.swing.colorchooser,javax.swing.event,javax.swing.filechooser,javax.swing.plaf,javax.swing.plaf.basic,javax.swing.plaf.metal,javax.swing.plaf.multi,javax.swing.plaf.synth,javax.swing.table,javax.swing.text,javax.swing.text.html,javax.swing.text.html.parser,javax.swing.text.rtf,javax.swing.tree,javax.swing.undo,javax.transaction,javax.transaction.xa,javax.xml,javax.xml.datatype,javax.xml.namespace,javax.xml.parsers,javax.xml.transform,javax.xml.transform.dom,javax.xml.transform.sax,javax.xml.transform.stream,javax.xml.validation,javax.xml.xpath,org.ietf.jgss,org.omg.CORBA,org.omg.CORBA_2_3,org.omg.CORBA_2_3.portable,org.omg.CORBA.DynAnyPackage,org.omg.CORBA.ORBPackage,org.omg.CORBA.portable,org.omg.CORBA.TypeCodePackage,org.omg.CosNaming,org.omg.CosNaming.NamingContextExtPackage,org.omg.CosNaming.NamingContextPackage,org.omg.Dynamic,org.omg.DynamicAny,org.omg.DynamicAny.DynAnyFactoryPackage,org.omg.DynamicAny.DynAnyPackage,org.omg.IOP,org.omg.IOP.CodecFactoryPackage,org.omg.IOP.CodecPackage,org.omg.Messaging,org.omg.PortableInterceptor,org.omg.PortableInterceptor.ORBInitInfoPackage,org.omg.PortableServer,org.omg.PortableServer.CurrentPackage,org.omg.PortableServer.POAManagerPackage,org.omg.PortableServer.POAPackage,org.omg.PortableServer.portable,org.omg.PortableServer.ServantLocatorPackage,org.omg.SendingContext,org.omg.stub.java.rmi,org.w3c.dom,org.w3c.dom.bootstrap,org.w3c.dom.events,org.w3c.dom.ls,org.xml.sax,org.xml.sax.ext,org.xml.sax.helpers\norg.osgi.framework.vendor\u003dEclipse\norg.osgi.framework.version\u003d1.3.0\norg.osgi.supports.framework.extension\u003dtrue\nos.arch\u003damd64\nos.name\u003dWindows 2003\nos.version\u003d5.2\nosgi.arch\u003damd64\nosgi.bundles\u003dorg.eclipse.equinox.common@2:start, org.eclipse.update.configurator@3:start, org.eclipse.core.runtime@start\nosgi.bundlestore\u003dD:\\ides\\eclipse\\configuration\\org.eclipse.osgi\\bundles\nosgi.configuration.area\u003dfile:/D:/ides/eclipse/configuration/\nosgi.framework\u003dfile:/d:/ides/eclipse/plugins/org.eclipse.osgi_3.2.0.v20060510.jar\nosgi.framework.beginningstartlevel\u003d1\nosgi.framework.shape\u003djar\nosgi.framework.version\u003d3.2.0.v20060510\nosgi.install.area\u003dfile:/D:/ides/eclipse/\nosgi.instance.area\u003dfile:/D:/ides/eclipse/testworkspace/\nosgi.instance.area.default\u003dfile:/C:/Documents and Settings/rail/workspace/\nosgi.logfile\u003dD:\\ides\\eclipse\\testworkspace\\.metadata\\.log\nosgi.manifest.cache\u003dD:\\ides\\eclipse\\configuration\\org.eclipse.osgi\\manifests\nosgi.nl\u003den_US\nosgi.os\u003dwin32\nosgi.splashLocation\u003dd:\\ides\\eclipse\\plugins\\org.eclipse.platform_3.2.0.v20060519a\\splash.bmp\nosgi.splashPath\u003dplatform:/base/plugins/org.eclipse.platform\nosgi.syspath\u003dd:\\ides\\eclipse\\plugins\nosgi.ws\u003dwin32\npath.separator\u003d;\nsun.arch.data.model\u003d64\nsun.boot.class.path\u003dD:\\Java\\jdk1.5.0_06\\jre\\lib\\rt.jar;D:\\Java\\jdk1.5.0_06\\jre\\lib\\i18n.jar;D:\\Java\\jdk1.5.0_06\\jre\\lib\\sunrsasign.jar;D:\\Java\\jdk1.5.0_06\\jre\\lib\\jsse.jar;D:\\Java\\jdk1.5.0_06\\jre\\lib\\jce.jar;D:\\Java\\jdk1.5.0_06\\jre\\lib\\charsets.jar;D:\\Java\\jdk1.5.0_06\\jre\\classes\nsun.boot.library.path\u003dD:\\Java\\jdk1.5.0_06\\jre\\bin\nsun.cpu.endian\u003dlittle\nsun.cpu.isalist\u003damd64\nsun.desktop\u003dwindows\nsun.io.unicode.encoding\u003dUnicodeLittle\nsun.jnu.encoding\u003dCp1252\nsun.management.compiler\u003dHotSpot 64-Bit Server Compiler\nsun.os.patch.level\u003dService Pack 1\nuser.country\u003dUS\nuser.dir\u003dD:\\ides\\eclipse\nuser.home\u003dC:\\Documents and Settings\\rail\nuser.language\u003den\nuser.name\u003drail\nuser.timezone\u003dAmerica/Los_Angeles\nuser.variant\u003d\n\n*** Features:\norg.eclipse.jdt (3.2.0.v20060518-0800-F7snp7fkt1-SXVP) \"Eclipse Java Development Tools\"\norg.eclipse.jdt.source (3.2.0.v20060518-0800-F7snp7fkt1-SXVP) \"Eclipse Java Development Tools SDK\"\norg.eclipse.pde (3.2.0.v20060511-1200-6zXJJzJsQooFXED) \"Eclipse Plug-in Development Environment\"\norg.eclipse.pde.source (3.2.0.v20060511-1200-6zXJJzJsQooFXED) \"Eclipse Plug-in Development Environment Developer Resources\"\norg.eclipse.platform (3.2.0.v20060518-_OZ2g5CC6lxEcKN) \"Eclipse Platform\"\norg.eclipse.platform.source (3.2.0.v20060518-_OZ2g5CC6lxEcKN) \"Eclipse Platform Plug-in Developer Resources\"\norg.eclipse.rcp (3.2.0.v20060511-2000-VDNgUk84W-MjLLR) \"Eclipse RCP\"\norg.eclipse.rcp.source (3.2.0.v20060511-2000-VDNgUk84W-MjLLR) \"Eclipse RCP Plug-in Developer Resources\"\norg.eclipse.sdk (3.2.0.v20060404-uDflzhCgQw7A-gJ) \"Eclipse Project SDK\"\n\n*** Plug-in Registry:\ncom.ibm.icu (3.4.4.1) \"International Components for Unicode for Java (ICU4J)\" [Active]\ncom.ibm.icu.source (3.4.4.1) \"International Components for Unicode for Java (ICU4J) source plug-in\" [Resolved]\ncom.jcraft.jsch (0.1.28) \"JSch\" [Resolved]\norg.apache.ant (1.6.5) \"Apache Ant\" [Resolved]\norg.apache.lucene (1.4.103.v20060510a) \"Apache Lucene\" [Resolved]\norg.eclipse.ant.core (3.1.100.v20060511) \"Ant Build Tool Core\" [Resolved]\norg.eclipse.ant.ui (3.2.0.v20060511) \"Ant UI\" [Resolved]\norg.eclipse.compare (3.2.0.v20060511) \"Compare Support\" [Resolved]\norg.eclipse.core.boot (3.1.100.v20060511) \"Core Boot\" [Resolved]\norg.eclipse.core.commands (3.2.0.I20060511-0800a) \"Commands\" [Resolved]\norg.eclipse.core.contenttype (3.2.0.v20060511) \"Eclipse Content Mechanism\" [Active]\norg.eclipse.core.expressions (3.2.0.v20060518-0800) \"Expression Language\" [Active]\norg.eclipse.core.filebuffers (3.2.0.v20060518-0800) \"File Buffers\" [Active]\norg.eclipse.core.filesystem (1.0.0.v20060510) \"Core File Systems\" [Resolved]\norg.eclipse.core.filesystem.win32.x86 (1.0.0.v20060510) \"Core File System for Windows\" [Resolved]\norg.eclipse.core.jobs (3.2.0.v20060511) \"Eclipse Jobs Mechanism\" [Active]\norg.eclipse.core.resources (3.2.0.v20060512) \"Core Resource Management\" [Active]\norg.eclipse.core.resources.compatibility (3.2.0.v20060510) \"Core Resource Management Compatibility Fragment\" [Resolved]\norg.eclipse.core.resources.win32 (3.2.0.v20060510) \"Core Resource Management Win32 Fragment\" [Resolved]\norg.eclipse.core.runtime (3.2.0.v20060511) \"Core Runtime\" [Active]\norg.eclipse.core.runtime.compatibility (3.1.100.v20060511) \"Core Runtime Plug-in Compatibility\" [Active]\norg.eclipse.core.runtime.compatibility.auth (3.2.0.v20060511) \"Authorization Compatibility Plug-in\" [Active]\norg.eclipse.core.runtime.compatibility.registry (3.2.0.v20060426) \"Eclipse Registry Compatibility Fragment\" [Resolved]\norg.eclipse.core.variables (3.1.100.v20060517) \"Core Variables\" [Resolved]\norg.eclipse.debug.core (3.2.0.v20060518) \"Debug Core\" [Active]\norg.eclipse.debug.ui (3.2.0.v20060518) \"Debug UI\" [Active]\norg.eclipse.equinox.common (3.2.0.v20060512) \"Common Eclipse Runtime\" [Active]\norg.eclipse.equinox.preferences (3.2.0.v20060511) \"Eclipse Preferences Mechanism\" [Active]\norg.eclipse.equinox.registry (3.2.0.v20060511) \"Extension Registry Support\" [Active]\norg.eclipse.help (3.2.0.v20060518) \"Help System Core\" [Active]\norg.eclipse.help.appserver (3.1.100.v20060510b) \"Help Application Server\" [Resolved]\norg.eclipse.help.base (3.2.0.v20060510a) \"Help System Base\" [Resolved]\norg.eclipse.help.ui (3.2.0.v20060510b) \"Help System UI\" [Resolved]\norg.eclipse.help.webapp (3.2.0.v20060510b) \"Help System Webapp\" [Resolved]\norg.eclipse.jdt (3.2.0.v20060518-0800) \"Eclipse Java Development Tools\" [Resolved]\norg.eclipse.jdt.apt.core (3.2.0.v20060510-1830) \"Java Annotation Processing Core\" [Resolved]\norg.eclipse.jdt.apt.ui (3.2.0.v20060510-1830) \"Java Annotation Processing UI\" [Resolved]\norg.eclipse.jdt.core (3.2.0.v_667) \"Java Development Tools Core\" [Active]\norg.eclipse.jdt.core.manipulation (1.0.0.v20060518-0800) \"Java Code Manipulation Functionality\" [Resolved]\norg.eclipse.jdt.debug (3.2.0.v20060518) \"JDI Debug Model\" [Resolved]\norg.eclipse.jdt.debug.ui (3.2.0.v20060517) \"JDI Debug UI\" [Resolved]\norg.eclipse.jdt.doc.isv (3.2.0.v20060518-0800) \"Eclipse JDT Plug-in Developer Guide\" [Resolved]\norg.eclipse.jdt.doc.user (3.2.0.v20060518-0800) \"Eclipse Java Development User Guide\" [Resolved]\norg.eclipse.jdt.junit (3.2.0.v20060518-0800) \"Java Development Tools JUnit support\" [Resolved]\norg.eclipse.jdt.junit.runtime (3.2.0.v20060518-0800) \"Java Development Tools JUnit runtime support\" [Resolved]\norg.eclipse.jdt.junit4.runtime (1.0.0.v20060518-0800) \"Java Development Tools JUnit4 runtime support\" [Resolved]\norg.eclipse.jdt.launching (3.2.0.v20060517) \"Java Development Tools Launching Support\" [Resolved]\norg.eclipse.jdt.source (3.2.0.v20060518-0800-F7snp7fkt1-SXVP) \"Eclipse Java Development Tools SDK\" [Resolved]\norg.eclipse.jdt.ui (3.2.0.v20060518-0800) \"Java Development Tools UI\" [Active]\norg.eclipse.jface (3.2.0.I20060511-0800a) \"JFace\" [Resolved]\norg.eclipse.jface.databinding (1.0.0.I20060511-2000) \"JFace Data Binding\" [Resolved]\norg.eclipse.jface.text (3.2.0.v20060518-0800) \"JFace Text\" [Resolved]\norg.eclipse.ltk.core.refactoring (3.2.0.v20060518-0800) \"Refactoring Core\" [Resolved]\norg.eclipse.ltk.ui.refactoring (3.2.0.v20060518-0800) \"Refactoring UI\" [Resolved]\norg.eclipse.osgi.services (3.1.100.v20060511) \"OSGi Release 3 Services\" [Resolved]\norg.eclipse.osgi.util (3.1.100.v20060511) \"OSGi R3 Utility Classes\" [Resolved]\norg.eclipse.pde (3.2.0.v20060511-1200) \"Eclipse Plug-in Development Environment\" [Resolved]\norg.eclipse.pde.build (3.2.0.v20060518) \"Plug-in Development Environment Build Support\" [Resolved]\norg.eclipse.pde.core (3.2.0.v20060512-0010) \"Plug-in Development Core\" [Resolved]\norg.eclipse.pde.doc.user (3.2.0.v20060519a) \"Eclipse Plug-in Development User Guide\" [Resolved]\norg.eclipse.pde.junit.runtime (3.2.0.v20060511-0800) \"PDE JUnit Plug-in Test\" [Resolved]\norg.eclipse.pde.runtime (3.2.0.v20060511-0800) \"Plug-in Development Environment Runtime\" [Resolved]\norg.eclipse.pde.source (3.2.0.v20060511-1200-6zXJJzJsQooFXED) \"Eclipse Plug-in Development Environment Developer Resources\" [Resolved]\norg.eclipse.pde.ui (3.2.0.v20060519-1200) \"Plug-in Development UI\" [Resolved]\norg.eclipse.platform (3.2.0.v20060519a) \"Eclipse Platform\" [Resolved]\norg.eclipse.platform.doc.isv (3.2.0.v20060518) \"Eclipse Platform Plug-in Developer Guide\" [Resolved]\norg.eclipse.platform.doc.user (3.2.0.v20060519-0010) \"Eclipse Workbench User Guide\" [Resolved]\norg.eclipse.platform.source (3.2.0.v20060518-_OZ2g5CC6lxEcKN) \"Eclipse Platform Plug-in Developer Resources\" [Resolved]\norg.eclipse.platform.source.win32.win32.x86 (3.2.0.v20060518-_OZ2g5CC6lxEcKN) \"Eclipse Platform Plug-in Developer Resources\" [Resolved]\norg.eclipse.rcp (3.2.0.v20060511-1200) \"Eclipse RCP\" [Resolved]\norg.eclipse.rcp.source (3.2.0.v20060511-2000-VDNgUk84W-MjLLR) \"Eclipse RCP Plug-in Developer Resources\" [Resolved]\norg.eclipse.rcp.source.win32.win32.x86 (3.2.0.v20060511-2000-VDNgUk84W-MjLLR) \"Eclipse RCP Plug-in Developer Resources\" [Resolved]\norg.eclipse.sdk (3.2.0.v20060519a) \"Eclipse Project SDK\" [Resolved]\norg.eclipse.search (3.2.0.v20060518-0800) \"Search Support\" [Resolved]\norg.eclipse.swt (3.2.0.v3232j) \"Standard Widget Toolkit\" [Resolved]\norg.eclipse.swt.win32.win32.x86 (3.2.0.qualifier) \"Standard Widget Toolkit for Windows\" [Resolved]\norg.eclipse.team.core (3.2.0.I200605181830) \"Team Support Core\" [Active]\norg.eclipse.team.cvs.core (3.2.0.I20060510) \"CVS Team Provider Core\" [Resolved]\norg.eclipse.team.cvs.ssh (3.2.0.I20060510) \"CVS SSH Core\" [Resolved]\norg.eclipse.team.cvs.ssh2 (3.2.0.I20060510) \"CVS SSH2\" [Resolved]\norg.eclipse.team.cvs.ui (3.2.0.I200605191155) \"CVS Team Provider UI\" [Resolved]\norg.eclipse.team.ui (3.2.0.I200605181830) \"Team Support UI\" [Resolved]\norg.eclipse.text (3.2.0.v20060518-0800) \"Text\" [Resolved]\norg.eclipse.tomcat (4.1.130.v20060510a) \"Tomcat Wrapper\" [Resolved]\norg.eclipse.ui (3.2.0.I20060519-0010) \"Eclipse UI\" [Active]\norg.eclipse.ui.browser (3.2.0.v20060518) \"Browser Support\" [Resolved]\norg.eclipse.ui.cheatsheets (3.2.0.v20060516) \"Cheat Sheets\" [Resolved]\norg.eclipse.ui.console (3.1.100.v20060518) \"Console\" [Resolved]\norg.eclipse.ui.editors (3.2.0.v20060518-0800) \"Default Text Editor\" [Active]\norg.eclipse.ui.externaltools (3.1.100.v20060511) \"External Tools\" [Active]\norg.eclipse.ui.forms (3.2.0.v20060510) \"Eclipse Forms\" [Resolved]\norg.eclipse.ui.ide (3.2.0.I20060519-0010) \"Eclipse IDE UI\" [Active]\norg.eclipse.ui.intro (3.2.0.v20060518) \"Welcome Framework\" [Resolved]\norg.eclipse.ui.intro.universal (3.2.0.v20060510b) \"Universal Welcome\" [Resolved]\norg.eclipse.ui.navigator (3.2.0.I20060519-0010) \"Common Navigator View\" [Resolved]\norg.eclipse.ui.navigator.resources (3.2.0.I20060511-2000) \"Navigator Workbench Components\" [Resolved]\norg.eclipse.ui.presentations.r21 (3.2.0.I20060511-2000) \"R21 Presentation Plug-in\" [Resolved]\norg.eclipse.ui.views (3.2.0.I20060511-2000) \"Views\" [Active]\norg.eclipse.ui.views.properties.tabbed (3.2.0.I20060511-0800a) \"Tabbed Properties View\" [Resolved]\norg.eclipse.ui.win32 (3.2.0.I20060511-2000) \"Eclipse UI Win32 Enhancements\" [Resolved]\norg.eclipse.ui.workbench (3.2.0.I20060519-0010b) \"Workbench\" [Active]\norg.eclipse.ui.workbench.compatibility (3.2.0.I20060511-2000) \"Workbench Compatibility\" [Resolved]\norg.eclipse.ui.workbench.texteditor (3.2.0.v20060518-0800) \"Text Editor Framework\" [Active]\norg.eclipse.update.configurator (3.2.0.v20060511) \"Install/Update Configurator\" [Active]\norg.eclipse.update.core (3.2.0.v20060511) \"Install/Update Core\" [Active]\norg.eclipse.update.core.win32 (3.2.0.v20060511) \"Install/Update Core for Windows\" [Resolved]\norg.eclipse.update.scheduler (3.2.0.v20060511) \"Automatic Updates Scheduler\" [Active]\norg.eclipse.update.ui (3.2.0.v20060511) \"Install/Update UI\" [Resolved]\norg.junit (3.8.1) \"JUnit Testing Framework\" [Resolved]\norg.junit4 (4.1.0) \"JUnit Testing Framework Version 4\" [Resolved]\nsystem.bundle (3.2.0.v20060510) \"OSGi System Bundle\" [Active]\n\n*** User Preferences:\n#Tue May 30 10:30:46 PDT 2006\n/instance/org.eclipse.jdt.ui/org.eclipse.jface.textfont\u003d1|Courier New|10|0|WINDOWS|1|0|0|0|0|0|0|0|0|1|0|0|0|0|Courier New;\n/instance/org.eclipse.jdt.ui/org.eclipse.jdt.ui.formatterprofiles.version\u003d10\n/instance/org.eclipse.ui/showIntro\u003dfalse\n@org.eclipse.ui\u003d3.2.0.I20060519-0010\n\\!/\u003d\n/instance/org.eclipse.ui.ide/platformState\u003d1149010226242\n/configuration/org.eclipse.ui.ide/SHOW_WORKSPACE_SELECTION_DIALOG\u003dtrue\n/instance/org.eclipse.core.resources/version\u003d1\n/instance/org.eclipse.ui.ide/tipsAndTricks\u003dtrue\n/instance/org.eclipse.jdt.ui/org.eclipse.jdt.ui.editor.tab.width\u003d\n/instance/org.eclipse.jdt.ui/proposalOrderMigrated\u003dtrue\n@org.eclipse.core.resources\u003d3.2.0.v20060512\n/instance/org.eclipse.jdt.ui/useQuickDiffPrefPage\u003dtrue\n@org.eclipse.ui.ide\u003d3.2.0.I20060519-0010\n@org.eclipse.jdt.ui\u003d3.2.0.v20060518-0800\n/instance/org.eclipse.jdt.ui/tabWidthPropagated\u003dtrue\n/configuration/org.eclipse.ui.ide/RECENT_WORKSPACES_PROTOCOL\u003d2\n/configuration/org.eclipse.ui.ide/MAX_RECENT_WORKSPACES\u003d5\n/configuration/org.eclipse.ui.ide/RECENT_WORKSPACES\u003dD\\:\\\\ides\\\\eclipse\\\\testworkspace\n/instance/org.eclipse.jdt.ui/fontPropagated\u003dtrue\n/instance/org.eclipse.jdt.ui/useAnnotationsPrefPage\u003dtrue\n/instance/org.eclipse.jdt.ui/org.eclipse.jdt.ui.javadoclocations.migrated\u003dtrue\nfile_export_version\u003d3.0\n\n*** Current Install Configuration:\nInstall configuration:\n Last changed on May 26, 2006\n Location: file:/D:/ides/eclipse/configuration/org.eclipse.update/platform.xml\n\n Configured sites:\n  platform:/base/\n\n Configured features:\n  ID: org.eclipse.platform, Version: 3.2.0.v20060518-_OZ2g5CC6lxEcKN\n  ID: org.eclipse.platform.source, Version: 3.2.0.v20060518-_OZ2g5CC6lxEcKN\n  ID: org.eclipse.rcp, Version: 3.2.0.v20060511-2000-VDNgUk84W-MjLLR\n  ID: org.eclipse.jdt, Version: 3.2.0.v20060518-0800-F7snp7fkt1-SXVP\n  ID: org.eclipse.jdt.source, Version: 3.2.0.v20060518-0800-F7snp7fkt1-SXVP\n  ID: org.eclipse.pde, Version: 3.2.0.v20060511-1200-6zXJJzJsQooFXED\n  ID: org.eclipse.pde.source, Version: 3.2.0.v20060511-1200-6zXJJzJsQooFXED\n  ID: org.eclipse.sdk, Version: 3.2.0.v20060404-uDflzhCgQw7A-gJ\n  ID: org.eclipse.rcp.source, Version: 3.2.0.v20060511-2000-VDNgUk84W-MjLLR\n\n Configured plug-ins:\n  file:/D:/ides/eclipse/plugins/com.ibm.icu.source_3.4.4.1/\n  file:/D:/ides/eclipse/plugins/com.ibm.icu_3.4.4.1.jar\n  file:/D:/ides/eclipse/plugins/com.jcraft.jsch_0.1.28.jar\n  file:/D:/ides/eclipse/plugins/org.apache.ant_1.6.5/\n  file:/D:/ides/eclipse/plugins/org.apache.lucene_1.4.103.v20060510a/\n  file:/D:/ides/eclipse/plugins/org.eclipse.ant.core_3.1.100.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ant.ui_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.compare_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.boot_3.1.100.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.commands_3.2.0.I20060511-0800a.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.contenttype_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.expressions_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.filebuffers_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.filesystem.win32.x86_1.0.0.v20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.filesystem_1.0.0.v20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.jobs_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.resources.compatibility_3.2.0.v20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.resources.win32_3.2.0.v20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.resources_3.2.0.v20060512.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.runtime.compatibility.auth_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.runtime.compatibility.registry_3.2.0.v20060426/\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.runtime.compatibility_3.1.100.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.runtime_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.core.variables_3.1.100.v20060517.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.debug.core_3.2.0.v20060518.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.debug.ui_3.2.0.v20060518.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.equinox.common_3.2.0.v20060512.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.equinox.preferences_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.equinox.registry_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.help.appserver_3.1.100.v20060510b.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.help.base_3.2.0.v20060510a.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.help.ui_3.2.0.v20060510b.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.help.webapp_3.2.0.v20060510b/\n  file:/D:/ides/eclipse/plugins/org.eclipse.help_3.2.0.v20060518.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.apt.core_3.2.0.v20060510-1830.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.apt.ui_3.2.0.v20060510-1830.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.core.manipulation_1.0.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.core_3.2.0.v_667.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.debug.ui_3.2.0.v20060517.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.debug_3.2.0.v20060518/\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.doc.isv_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.doc.user_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.junit.runtime_3.2.0.v20060518-0800/\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.junit4.runtime_1.0.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.junit_3.2.0.v20060518-0800/\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.launching_3.2.0.v20060517.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.source_3.2.0.v20060518-0800-F7snp7fkt1-SXVP/\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt.ui_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jdt_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jface.databinding_1.0.0.I20060511-2000.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jface.text_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.jface_3.2.0.I20060511-0800a.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ltk.core.refactoring_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ltk.ui.refactoring_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.osgi.services_3.1.100.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.osgi.util_3.1.100.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.osgi_3.2.0.v20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde.build_3.2.0.v20060518/\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde.core_3.2.0.v20060512-0010.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde.doc.user_3.2.0.v20060519a.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde.junit.runtime_3.2.0.v20060511-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde.runtime_3.2.0.v20060511-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde.source_3.2.0.v20060511-1200-6zXJJzJsQooFXED/\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde.ui_3.2.0.v20060519-1200.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.pde_3.2.0.v20060511-1200.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.platform.doc.isv_3.2.0.v20060518.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.platform.doc.user_3.2.0.v20060519-0010.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.platform.source.win32.win32.x86_3.2.0.v20060518-_OZ2g5CC6lxEcKN/\n  file:/D:/ides/eclipse/plugins/org.eclipse.platform.source_3.2.0.v20060518-_OZ2g5CC6lxEcKN/\n  file:/D:/ides/eclipse/plugins/org.eclipse.platform_3.2.0.v20060519a/\n  file:/D:/ides/eclipse/plugins/org.eclipse.rcp.source.win32.win32.x86_3.2.0.v20060511-2000-VDNgUk84W-MjLLR/\n  file:/D:/ides/eclipse/plugins/org.eclipse.rcp.source_3.2.0.v20060511-2000-VDNgUk84W-MjLLR/\n  file:/D:/ides/eclipse/plugins/org.eclipse.rcp_3.2.0.v20060511-1200.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.sdk_3.2.0.v20060519a/\n  file:/D:/ides/eclipse/plugins/org.eclipse.search_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.swt.win32.win32.x86_3.2.0.v3232.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.swt_3.2.0.v3232j.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.team.core_3.2.0.I200605181830.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.team.cvs.core_3.2.0.I20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.team.cvs.ssh2_3.2.0.I20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.team.cvs.ssh_3.2.0.I20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.team.cvs.ui_3.2.0.I200605191155.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.team.ui_3.2.0.I200605181830.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.text_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.tomcat_4.1.130.v20060510a/\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.browser_3.2.0.v20060518.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.cheatsheets_3.2.0.v20060516.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.console_3.1.100.v20060518.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.editors_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.externaltools_3.1.100.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.forms_3.2.0.v20060510.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.ide_3.2.0.I20060519-0010.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.intro.universal_3.2.0.v20060510b/\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.intro_3.2.0.v20060518.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.navigator.resources_3.2.0.I20060511-2000.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.navigator_3.2.0.I20060519-0010.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.presentations.r21_3.2.0.I20060511-2000.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.views.properties.tabbed_3.2.0.I20060511-0800a.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.views_3.2.0.I20060511-2000.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.win32_3.2.0.I20060511-2000.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.workbench.compatibility_3.2.0.I20060511-2000/\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.workbench.texteditor_3.2.0.v20060518-0800.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui.workbench_3.2.0.I20060519-0010b.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.ui_3.2.0.I20060519-0010.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.update.configurator_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.update.core.win32_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.update.core_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.update.scheduler_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.eclipse.update.ui_3.2.0.v20060511.jar\n  file:/D:/ides/eclipse/plugins/org.junit4_4.1.0/\n  file:/D:/ides/eclipse/plugins/org.junit_3.8.1/\n",
    "The os is XP on a 2 disk sata raid 0 setup.\namd x2 3800+\nATI FireGL V3100\n\nI have ati multidesk running.\nI unloaded that and tried but the problem is still present.",
    "On a side note.\nThe problem that I am seeing also happens with the 32 bit version of eclipse 3.2 running in a 32 bit vm under xp 64.\n\nEclipse 3.1 running under a 32 bit vm doesn\u0027t have that problem. 3.1 has rendering issues. So possibly some change between 3.1 and 3.2 screwed it up.",
    "To Roshan:\n\nIt\u0027s strange, but the problem (mouse does not work in New Project wizard)\ndoes not occur both with 32 and 64 bit JVM version (Sun 1.5.06). With 32\nbit, standard Eclipse 3.2RC6 was used. With 64bit, our 64-bit version runs.\nThe same situation with JRockit JVM (works both on 32 and 64 bit).\n",
    "Oleg,\n\nLooks like there is something with hydravision that messes up eclipse.\nI uninstalled hydravision and restarted the OS and now eclipse works fine.\n\nI don\u0027t know whether you guys need to spend time looking into this.\nBut just a note in case anybody else runs into problems with hydravision.\n\nDamn, now I have to search for another multi desktop manager :)",
    "OK, we\u0027ll bear it in mind, of course.\nFor now, we have not such SW to test.",
    "Some additional information on Hydravision from a support email from ATI.\n\"At this point in time, Hydravision is not supported under XP 64 bit edition.\"\nIt may work, but it has issues with some applications.",
    "ive just found the cause of the new project bug, it appears to be logitech setpoint software causing it. i just killed the process and the tree view in new project dialog is now acceping mouse inputs, where as it wasn\u0027t before.",
    "(In reply to comment #65)\n\u003e ive just found the cause of the new project bug, it appears to be logitech\n\u003e setpoint software causing it. i just killed the process and the tree view in\n\u003e new project dialog is now acceping mouse inputs, where as it wasn\u0027t before.\n\u003e \nMicrosoft Intellipoint software may also have some issues too.",
    "With this enhancement cover both IPF (Itanium/ia64) and EMT64T (x64/Opteron AMD/Xeon Intel/AMD64) chip architectures?",
    "Jawohl. \n\nThe changes are applicable both to IA64 (Itanium) and x86_64  \n(AKA amd64, em64t etc).\n\nWe\u0027ve put alles Win64 versions to Eclipse download page.\n\nWe\u0027re waiting for external test \u0026 approval. According to \ninternal testing, 64-bit version works just like 32-bit one.  \nBugs are welcome.\n\n\n",
    "(In reply to comment #68)\n\u003e We\u0027re waiting for external test \u0026 approval. According to \n\u003e internal testing, 64-bit version works just like 32-bit one.  \n\nI did a bit of testing of RC6 on Windows Server 2003 x64 (AMD Athlon 64 3500+, 4 GB memory).  I compared the 32-bit and 64-bit versions side-by-side using the latest Sun JVMs.  I found that they both worked the same except that the 64-bit version is slower.  The 64-bit version was a couple seconds slower to start (about 8 seconds vs. 6 seconds).  Similarly, the 64-bit version took a couple seconds longer to compile a project.  I didn\u0027t encounter any other issues.\n",
    "The early access 64-bit builds seemed to have been dropped for 3.2 final - any update on these?",
    "Win64 versions for Eclipse 3.2 release will be available soon.\nBuilds are already made, but links are not established yet on\ndownload page. ",
    "I see that the 3.2 x86_64 build is listed now.\n\nI\u0027ve downloaded it but I\u0027m seeing various problems with it. Things I didn\u0027t see with the last RC.\n\nI\u0027ve got the following installed:\nR-3.2-200606291905/eclipse-SDK-3.2-win32-x86_64.zip\nR-1.2-200606280938/VE-SDK-1.2.zip\nR200606271057/emf-sdo-xsd-SDK-2.2.0.zip\nR-3.2-200606270816/GEF-SDK-3.2.zip\n\nI\u0027m starting with a fresh workspace. When I try to create a new project in my new workspace, the \"New Project - Select a wizard\" popup has a tree widget but non of the branches will expand. Also get the same for the \"New... Other\" popup.\n\nOpening the project gives the following warning error... \"Could not load library: localfile_1_0_0.dll. \"\n\nWhen I try to add the SWT plugin library to my new project I get various errors in the Error log. The session data is the same:\n\neclipse.buildId\u003dM20060629-1905\njava.version\u003d1.5.0_07\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dwin32, ARCH\u003damd64, WS\u003dwin32, NL\u003den_US\nCommand-line arguments:  -data D:\\src\\workspace_test -os win32 -ws win32 -arch amd64\n\n\nUnhandled event loop exception:An exception stack trace is not available.:\n\nand\n\njava.lang.NullPointerException\n\tat org.eclipse.ve.internal.swt.SWTContainer$ContainerType.getPlatformVersion(SWTContainer.java:198)\n\tat org.eclipse.ve.internal.swt.SWTContainerWizardContent.setPlatform(SWTContainerWizardContent.java:168)\n\tat org.eclipse.ve.internal.swt.SWTContainerWizardContent.setContainerType(SWTContainerWizardContent.java:232)\n\tat org.eclipse.ve.internal.swt.SWTContainerWizardPage.initializeFromSelection(SWTContainerWizardPage.java:53)\n\tat org.eclipse.ve.internal.swt.SWTContainerWizardPage.createControl(SWTContainerWizardPage.java:43)\n\tat org.eclipse.jface.wizard.WizardDialog.updateForPage(WizardDialog.java:1046)\n\tat org.eclipse.jface.wizard.WizardDialog.access$2(WizardDialog.java:1038)\n\tat org.eclipse.jface.wizard.WizardDialog$4.run(WizardDialog.java:1028)\n\tat org.eclipse.swt.custom.BusyIndicator.showWhile(BusyIndicator.java:67)\n\tat org.eclipse.jface.wizard.WizardDialog.showPage(WizardDialog.java:1026)\n\tat org.eclipse.jface.wizard.WizardDialog.nextPressed(WizardDialog.java:757)\n\tat org.eclipse.jface.wizard.WizardDialog.buttonPressed(WizardDialog.java:351)\n\tat org.eclipse.jface.dialogs.Dialog$3.widgetSelected(Dialog.java:660)\n\tat org.eclipse.swt.widgets.TypedListener.handleEvent(TypedListener.java:90)\n\tat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\n\tat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:928)\n\tat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3358)\n\tat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2978)\n\tat org.eclipse.jface.window.Window.runEventLoop(Window.java:820)\n\tat org.eclipse.jface.window.Window.open(Window.java:796)\n\tat org.eclipse.jdt.internal.ui.wizards.buildpaths.ClasspathContainerWizard.openWizard(ClasspathContainerWizard.java:230)\n\tat org.eclipse.jdt.ui.wizards.BuildPathDialogAccess.chooseContainerEntries(BuildPathDialogAccess.java:272)\n\tat org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage.openContainerSelectionDialog(LibrariesWorkbookPage.java:811)\n\tat org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage.libaryPageCustomButtonPressed(LibrariesWorkbookPage.java:243)\n\tat org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage.access$0(LibrariesWorkbookPage.java:230)\n\tat org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage$LibrariesAdapter.customButtonPressed(LibrariesWorkbookPage.java:185)\n\tat org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.buttonPressed(TreeListDialogField.java:167)\n\tat org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.doButtonSelected(TreeListDialogField.java:385)\n\tat org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.access$2(TreeListDialogField.java:381)\n\tat org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField$2.widgetSelected(TreeListDialogField.java:346)\n\tat org.eclipse.swt.widgets.TypedListener.handleEvent(TypedListener.java:90)\n\tat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\n\tat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:928)\n\tat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3358)\n\tat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2978)\n\tat org.eclipse.jface.window.Window.runEventLoop(Window.java:820)\n\tat org.eclipse.jface.window.Window.open(Window.java:796)\n\tat org.eclipse.ui.dialogs.PropertyDialogAction.run(PropertyDialogAction.java:156)\n\tat org.eclipse.jface.action.Action.runWithEvent(Action.java:499)\n\tat org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection(ActionContributionItem.java:539)\n\tat org.eclipse.jface.action.ActionContributionItem.access$2(ActionContributionItem.java:488)\n\tat org.eclipse.jface.action.ActionContributionItem$5.handleEvent(ActionContributionItem.java:400)\n\tat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\n\tat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:928)\n\tat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3358)\n\tat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2978)\n\tat org.eclipse.ui.internal.Workbench.runEventLoop(Workbench.java:1914)\n\tat org.eclipse.ui.internal.Workbench.runUI(Workbench.java:1878)\n\tat org.eclipse.ui.internal.Workbench.createAndRunWorkbench(Workbench.java:419)\n\tat org.eclipse.ui.PlatformUI.createAndRunWorkbench(PlatformUI.java:149)\n\tat org.eclipse.ui.internal.ide.IDEApplication.run(IDEApplication.java:95)\n\tat org.eclipse.core.internal.runtime.PlatformActivator$1.run(PlatformActivator.java:78)\n\tat org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.runApplication(EclipseAppLauncher.java:92)\n\tat org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.start(EclipseAppLauncher.java:68)\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:400)\n\tat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:177)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)\n\tat sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)\n\tat java.lang.reflect.Method.invoke(Method.java:585)\n\tat org.eclipse.core.launcher.Main.invokeFramework(Main.java:336)\n\tat org.eclipse.core.launcher.Main.basicRun(Main.java:280)\n\tat org.eclipse.core.launcher.Main.run(Main.java:977)\n\tat org.eclipse.core.launcher.Main.main(Main.java:952)",
    "Ok. Figured out my widgets problem. I\u0027ve been trialing \"Ultramon\" for my multiple monitor setup. While ultramon is running, many 32bit or 64bit eclipse widgets stop working correctly. :(\n\n\nI am still getting errors with VE on the 64bit eclipse though, including the wonderful error message of:\n\n\n*** ERROR ***: Wed Jul 12 03:46:46 EDT 2006    should not be here\n\nFrom org.eclipse.ve.java.core.",
    "Created an attachment (id\u003d48457)\n64-bit support for SWT (Eclipse 3.3M1)- proposed patch \n\n",
    "Created an attachment (id\u003d48581)\n64-bit support for SWT (Eclipse 3.3M1) - code adjusted.\n\nPrevious patch has contained wrong copyrights for ~200 files.\nIt\u0027s fixed. In addition, some trivial changes (empty lines, order\nof declarations) were eliminated.\nAs a result, patch file became smaller by ~180k.\nFunctionality remains the same.",
    "I am having the same problem with the non reactive new project wizard as Roshan and John Rimell but I do not have ultramon or hydravision installed and I am now having issues with rendering in 3.1.2 that I don\u0027t recall seeing before.  I am not certain of this as I am not yet willing to uninstall it but the only thing I can think of that I have installed that MIGHT effect it is IE7.  Trillian originally had some issues with the new dll being installed too.  Of course, it could have been an windows automatic update too (DAEMON Tools 4 had an issue with that a little while back).  Whatever, the problem is, with the upcoming release of Vista and the growing prevalence of 64 bit systems, this seems like a pretty serious problem.  I am having the same problem with the 32 bit 3.3M1 and the 64 bit Eclipse 3.2 as well.  I also believe that whatever the cause of the problem in Eclipse 3.2/3.3 the fact that now 3 separate people have reported the same problem with supposedly different causes indicates that there is something wrong in the eclipse code [SWT ?] and it is not necessarily a problem in the other pieces of software that are causing the problem to manifest.\n\nI suppose I should also mention that I have had some problems with Eclipse controlling Tomcat as well.  It does not happen every time and it happens too quickly for the IDE to write anything to the log but every now and then when I have eclipse restart an already running instance of tomcat, the machine just reboots.  I assume it is a blue screen error but I cannot be sure.  I just thought I should mention it.\n\nWhile 3.1.2 is still usable (even with it\u0027s rendering issues) and I have another machine that is 32 bit I can work on for now I am hopeful that these issue can be resolved.\n\nFinally, lest I seem too negative, I really like Eclipse, it is a wonderful IDE that I feel is significantly better than Rational Developer, Netbeans and in many ways better than IntelliJ/IDEA (whatever the name is).  I have used all of them and Eclipse is BY FAR the most intuitive and the least resource intensive.",
    "From what I have read, the general approach to the Win32/Win64 differences is to declare a HWND or whatever as \"int /*long*/ myHandle;\".  Then, basically generate two versions of the JNI code.\n\nThis seems to me to be ugly, error-prone, and non-declarative.  It also relies upon a lot of pre-processing at build time.\n\nWhy not create a NativeHandle java class to encapsulate handles/pointers on Windows that could be 32 or 64 bits, depending on platform.  Then, everywhere that these handles and pointers are being held as Java ints, replace with the NativeHandle class.  The NativeHandle would have a 32-bit and a 64-bit implementation (wrapping either a Java int or long), but this should be the only java class with a different implementation for the Win32 and Win64 versions of SWT.  Also, when and if 128-bit Windows comes along, only the NativeHandle class should have to change to provide a 128-bit impl.\n\nOn the JNI side, the C functions would have to change signatures of course, and then a simple function could be written to extract the 32 or 64 bit integer from the NativeHandle object; the return value would be \"INT_PTR\", which is a 32 or 64 bit integer typedef, depending on pre-processor definitions.  So, the resulting C\\C++ code base should be the same for the 32 and 64 bit versions for Windows, just re-compiled for the destination platform.\n\nThis technique is similar to the IntPtr type used in .NET.\n\nHas this technique been tried?  Would there be any sort of performance hit?\n\npublic final class NativeHandle {\n\t\n\t// 32-bit implementation\n\t//\n\n\tprivate int wrapped32;\n\t\n\tpublic static final int sizeof \u003d 4;\n\t\n\tpublic static final NativeHandle Zero \u003d new NativeHandle(0);\n\t\n\tpublic NativeHandle(int value)\n\t{\n\t\twrapped32 \u003d value;\n\t}\n\t\n\tpublic int getValue()\n\t{\n\t\treturn wrapped32;\n\t}\n\t\n\tpublic String toString()\n\t{\n\t\treturn (new Integer(wrapped32)).toString(); \n\t}\t\n\t\n\tpublic boolean equals(NativeHandle other)\n\t{\n\t\tif (other \u003d\u003d null)\n\t\t\treturn false;\n\t\treturn (this.getValue() \u003d\u003d other.getValue());\n\t}\t\n\t\n\t/*\n\t// 64-bit implementation\n\t//\n\tprivate long wrapped64;\n\t\n\tpublic static final int sizeof \u003d 8;\n\t\n\tpublic static final NativeHandle Zero \u003d new NativeHandle(0);\n\t\n\tpublic NativeHandle(long value)\n\t{\n\t\twrapped64 \u003d value;\n\t}\n\n\tpublic long getValue()\n\t{\n\t\treturn wrapped64;\n\t}\n\t\n\tpublic String toString()\n\t{\n\t\treturn (new Long(wrapped64)).toString(); \n\t}\n\t\n\tpublic boolean equals(NativeHandle other)\n\t{\n\t\tif (other \u003d\u003d null)\n\t\t\treturn false;\n\t\treturn (this.getValue() \u003d\u003d other.getValue());\n\t}\n\t*/\n}\n",
    "It\u0027s not as simple as that.  The size of structures and offets into memory change too.\n\nMany options were discussed.  The idea was to be as fast as possible and as close to the operating system as possible on both platforms.  The /*long*/ markup approach has this attribute.  There is zero penalty on either platform.",
    "\n\u003e------- Comment #78 From Steve Northover 2006-09-28 18:25 [reply] ------- \n\u003eIt\u0027s not as simple as that.  The size of structures and offets into memory\n\u003echange too.\n\nSize of structures can be obtained via native calls like \n\"WNDCLASS_sizeof()\". They are already implemented and \ntrack differences bethween Itanium \u0026 AMD64 also.\nOffsets are easy to calculate if we know PTR_size.\n\n",
    "By the way, which tool is used to compile the latest SWT ?\nPrevious versions (up to SWT 3.3M1) were accepted by Win2003 \nPlatform SDK. \n3.3M2 cannot be compiled in this way, because it uses some\nVista-specific structures (NMTVITEMCHANGE etc). By the way, \nno explicit mentions were issued - moreover, Vista is not \ndeclared yet as supported OS...\n \n \n\n",
    "(In reply to comment #78)\n\u003e It\u0027s not as simple as that.  The size of structures and offets into memory\n\u003e change too.\n\u003e Many options were discussed.  The idea was to be as fast as possible and as\n\u003e close to the operating system as possible on both platforms.  The /*long*/\n\u003e markup approach has this attribute.  There is zero penalty on either platform.\n\nI read the following doc which discusses various aspects of the 32/64 problem: https://bugs.eclipse.org/bugs/attachment.cgi?id\u003d36808\n\nI realize that the NativeHandle class I proposed is not the entire solution, just a very large part of it.  \n\nI also realize I am joining this conversation very late in the game; my business very recently became interested in developing a cross-platform version of our app (currently written in C#/.Net) and SWT is a candidate technology.  With any technology, I am always interested in the internals, to see if the implementation is good, so I have spent the past few weeks studying the SWT source code.  So far, I think the implementation is pretty good, but this 32/64 change is pretty scary...\n\nI understand what you means about size of stuctures and offeset into memory.  That is why the NativeHandle class I proposed has a sizeof field which is set to 4 for 32-bit versions and to 8 for 64-bit versions.  Many primitive types in C/C++ on Windows have not changed size between 32 and 64 bits.  So, instead of having a \"sizeof\" field on all the java declarations of the structs, have a sizeof method that takes the total size of those fields whose size remains constant between 32/64 platforms, and then adds to that the number of fields that change from 4 bytes to 8 bytes multiplied by NativeHandle.sizeof.\n\nAs far as speed is concerned, I would have to see real performance benchmarks before making (possibly) a \"premature optimization\".  Probably, the overhead of using the NativeHandle class in negligible in most scenarios.  I think that clear, declarative code is more important than a few extra CPU cycles.  .Net took this approach with the System.IntPtr type (used to PInvoke to the OS), and in my experience, GUI apps I have written in .Net are reasonably fast, with no perceptible difference in GUI responsiveness versus those I have written in native C++.",
    "Thanks for your input Robert.  However, we won\u0027t redesign our 64-bit strategy at this time.  If someday we do, then there is nothing in our current strategy that will stop us moving to a \"NativeHandle\" implementation.",
    "Created an attachment (id\u003d51459)\n64bit support-Eclipse 3.3M2-patch for org.eclipse.swt.tools\\JNI Generation\n\nThis patch affects 3 \"properties\" files.\nNew structures and functions description added. ",
    "Created an attachment (id\u003d51460)\n64bit support-Eclipse 3.3M2-patch for org.eclipse.swt\n\n64-bit modification of SWT code for Eclipse 3.3M2\n",
    "Created an attachment (id\u003d51461)\n64bit support-Eclipse 3.3M2-SWT plaform-specific packages (ia64 \u0026 x86_64)\n\nNew packages for Win64 build:\norg.eclipse.swt.win32.win32.ia64\norg.eclipse.swt.win32.win32.x86_64\nPrevious version of the same packages made obsolete.\nMost changes are in build.xml files.\n",
    "Hi Oleg,\n\nDespite the fact that this is not a committed Eclipse plan item, Grant and I are slogging through the low level OS and OLE classes.  When we get to a clean point with something running, we\u0027ll post back what we found.\n\nSteve",
    "We\u0027ve released the first phase of this work to HEAD, which includes the native-level classes (all classes in Eclipse SWT PI) + the Accessibility class.  The patches from Intel were a huge help and saved us a lot of time (thanks again!).  Because the details of the changes are so meticulous yet important, we had to do a check on each change.  The vast majority of them were correct; here\u0027s a summary of the changes that we modified or did not take (in no particular order):\n\n-\u003e _sizeof\u0027s of structs that come in A and W varieties: separated into two natives to ensure that correct value is returned based on whether unicode is being used\n-\u003e GetKeyNameText: the first parameter should be an int\n-\u003e various places: HRESULT is an int\n-\u003e SystemParametersInfo (4th implementation): the third argument should be an int[]\n-\u003e ITypeInfo contained three 4\u0027s that became OS.PTR_SIZEOF\n-\u003e ELEMDESC struct deleted because only being used to compute size; will create custom native in COM class instead\n-\u003e NOTIFYICONDATA?.sizeof: should use NOTIFYICONDATA?_V2_SIZE\n-\u003e OS.PTR_sizeof became PTR_SIZEOF (to match 64-bit swt on gtk), and is now initialized with a native\n-\u003e accessibility support was not working as a result of VARIANT pain: a custom solution was implemented to make these callbacks come in properly\n-\u003e LinearGradientBrush_SetInterpolationColors: second parameter should be int /*long*/[]\n-\u003e GdiplusStartup: first parameter should be int /*long*/[]\n-\u003e GdiplusShutdown: first parameter should be int /*long*/\n-\u003e missing GraphicsPath_new custom function\n-\u003e PathGradientBrush_SetSurroundColors: second parameter should be int /*long*/[]\n-\u003e removed the \"strange bug\" workaround in LVITEM because not applicable to 32-bit environment, which is still what HEAD supports (may ultimately need to be re-added)\n\nAdditionally, we added /*long*/s as appropriate to all native functions and structs added to swt between 3.3M1 and 3.3M3.\n\nThese changes were released immediately following 3.3M3, so they first appear in the November 7 integration build (http://download.eclipse.org/downloads/drops/I20061107-0800/index.php), which in cvs is swt version v3315.  To easily see the released changes compare swt version v3315 to version v3314eBefore64PImerge in cvs.  (Same goes for the tools plugin).\n\nWe may have incorrectly not taken some of your changes.  Can you take the native-level classes in this version of swt and:\n1. verify that these changes still work for you with your changes in higher-level classes (will require some updates in higher-level classes that call the changed methods)\n2. generate a new patch based on this (and it would be very helpful if tabs were not converted to spaces in modified lines since these show up as differences to be resolved)\n",
    "\u003e Ok. Figured out my widgets problem. I\u0027ve been trialing \"Ultramon\" for my\n\u003e multiple monitor setup. While ultramon is running, many 32bit or 64bit eclipse\n\u003e widgets stop working correctly. :(\n\nI was having a similar problem with Eclipse and ultra mon. Reported it here: https://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d163591\n\nThis is a follow up on that, I contacted the ultra mon developer(s) and this is the response I got (give or take a few lines):\n\n--- SNIP ----\nI\u0027ve been able to reproduce the issue with the new project dialog, seems to be either an Eclipse or Windows issue. The problem occurs if certain types of hooks are installed, even if those hooks don\u0027t do anything.\n\nThere is no good workaround for this, you would need to disable the following UltraMon features so that the hooks which cause the problem no longer get installed: Smart Taskbar, moving of maximized windows with the mouse, window buttons and menu commands.\n--- SNIP ----\n\n--- SNIP ----\nI would recommend contacting Eclipse Support as well, tell them that installing either a global WH_CALLWNDPROC or WH_CALLWNDPROCRET hook causes the problem, even if the hook procedure doesn\u0027t do anything except call the next hook via CallNextHookEx.\n--- SNIP ----\n\nI would like to hear from the eclipse guys what they have to say on this topic.\n\nSeeing that people using hydravision have reported problems too (and I can imagine the implementation between the hydravision and ultra mon are not so far apart) my guess would be that this is a bug in XP 64 Pro. So 2 questions: 1) Will it be possible for Eclipse to get a work around and 2) I wonder where I should complain @ ms...\n\nCheers\n    Caleb Lyness",
    "Unfortunately, source build for M3 does not have 64-bit changes yet.\nSo, we continue merging 64-bit changes with latest SWT in usual mode.\n64-bit version will be published soon (I hope tomorrow).\n",
    "Regarding comment 89, is this a request to add support for win64 to the source build? If so, please open a bug against platform-releng.",
    "Sorry for possible bad wording.\n\nI\u0027ve tried to say that 64-bit code changes \n(described in Comment#87) are not included\nto SWT source related to Eclipse 3.3 M3.\n\nWhat about request for source build, it was\ncreated long time ago (bug #142495), but\nit cannot be performed before source code\nmodification.\n",
    "Created an attachment (id\u003d54172)\n64-bit org.eclipse.swt\n\n64-bit changes are made on the basis of code from\neclipse-sourceBuild-srcIncluded-I20061114-1636.zip\n\nSmall modifications in native methods:\nOS.MCIWndRegisterClass() should have 1 parameter, not zero.\nOS.NOTIFYICONDATAA_V2_SIZE() cannot be called - it is not a function but define. Temporary replaced by hard-coded values.\n\n",
    "NOTE: MCIWndRegisterClass() does not take a parameter and will crash when forced to do so and called dynamically (which it needs to be).  Grant, do not make this change.\n\nNot sure about the other change.  Probably a bug in our latest changes.",
    "\u003e NOTE: MCIWndRegisterClass() does not take a parameter and will crash when\n\u003e forced to do so and called dynamically (which it needs to be).  Grant, do not\n\u003e make this change.\n\nOK. But MSDN declares 1 parameter. MS SDK refuses compiling without this value.\nIf you use another compiler, please say which one. Thanks.\n\n",
    "The MSDN is wrong.  If the function is looked up dyamically (as it should be when generated by the JNI generator tool), then there should be no compile errors.  Can you confirm this?",
    "Reply to #95 From Steve Northover:\n\n\u003eThe MSDN is wrong.  If the function is looked up dyamically (as it should be\n\u003ewhen generated by the JNI generator tool), then there should be no compile\n\u003eerrors.  Can you confirm this?\n\nYes.\n\nIn fact, MCIWndRegisterClass() was changed.\nIn Windows Server 2003 R2 Platform SDK and\nnewer versions, it has no parameters. But\nearlier PSDK version declares 1 parameter.\n",
    "*** Bug 168345 has been marked as a duplicate of this bug. ***",
    "Any plans of making a 3.3 milestone build available for download.",
    "(In reply to comment #76)\n\u003e I am having the same problem with the non reactive new project wizard as Roshan\n\u003e and John Rimell but I do not have ultramon or hydravision installed and I am\n\u003e now having issues with rendering in 3.1.2 that I don\u0027t recall seeing before.  I\n\u003e am not certain of this as I am not yet willing to uninstall it but the only\n\u003e thing I can think of that I have installed that MIGHT effect it is IE7. \nI have same bug. I\u0027ve tried different versions of Eclipse - in 3.3M4/win32, 3.2.1/win32 i have no wizard and list works incorrect. In 3.2/x86_64 wizard shows,  but lists are not working (i can scroll it by keybord, but can\u0027t select by mouse).\n\nMy configuration: WinXP x64 Pro.\nx64 JRE:\njava version \"1.5.0_06\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.5.0_06-b05)\nJava HotSpot(TM) 64-Bit Server VM (build 1.5.0_06-b05, mixed mode)\n\nx32 JRE:\njava version \"1.5.0_09\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.5.0_09-b03)\nJava HotSpot(TM) Client VM (build 1.5.0_09-b03, mixed mode, sharing)\n\nNo ultramon or hydravision installed, single monitor. nvidia card.",
    "Exactly the same here\n\nnVidia desktop manager is \"responsible\" - you\u0027ll have to disable it until Eclipse developers find the fix\n",
    "Created an attachment (id\u003d61844)\n64-bit org.eclipse.swt\n\nI\u0027ve attached source of 64-bit SWT merged with latest changes.",
    "This bug just had it\u0027s 3rd birthday! \nWhen will eclipse be fully 64bit enabled? \nWhich milestone is this planned for?\nThanks",
    "We tried to merge the changes for Eclipse 3.3 but ran out of time.  \n\nBecause there can only be one SWT source stream for all win32 platforms (including WinCE) and the size of structs and various paramters are different between win32 platforms (98, 2000, XP, Vista), every single line needs to be checked, double checked and tested.  The is VERY time consuming.  Grant and I released the first phase but could not get to the rest for 3.3.",
    "Do we have an estimated date/milestone for seeing a 64 bit Windows version?",
    "(In reply to comment #100)\n\u003e nVidia desktop manager is \"responsible\" - you\u0027ll have to disable it until\n\u003e Eclipse developers find the fix\n\nI got a related problem on XP_X64. Subversive Plugin Propperties can not be seen/are distroyed. E.g. the Authentication Area is completely white. No input boxes etc. I also shut down nVidia Desktop Manager with no luck.\nThis is on Eclipse 3.2.\nTried with 32bit SUN 1.5.0_11 and 64bit 1.6.0_02 with the same effect.\nSubversive is completely unusable on XP_X64.",
    "Created an attachment (id\u003d70367)\n64-bit org.eclipse.swt for Eclipse 3.3RC3\n\nSource code with 64-bit-specific changes.\nCorresponds to Eclipse 3.3 RC3.\nBinaries (Eclipse packages for Win64 on Itanium and EM64T)\nwill be published soon on Eclipse Downloads page.",
    "Created an attachment (id\u003d70368)\n64bit JNI Generation for Eclipse 3.3RC3\n\nThe only significant change is *.properties files contents.",
    "Created an attachment (id\u003d70369)\n64bit plaform-specific packages for Eclipse 3.3RC3\n\nBuild directories for x86_64 and ia64\n",
    "Some words about binaries.\n\n64-bit build for x86_64 is ok.\n\nBut there\u0027s a problem when building C sources for Itanium.\nAlthough there\u0027s no compiler/linker errors, resulting DLLs\nare not recognized by Windows. There was no such problem\nwhile using MS PSDK 2003, but the latest SWT requires\nPSDK-Vista to build binaries. \n\nProblem is under investigation now.\n\nThat\u0027s why 64-bit binaries are not published yet.\n\nAnyway, 64-bit version for RC5 will be made available\nASAP after this release, even for x86_64 only.\n\nSorry for bad news.\n ",
    "\u003e We\u0027re going through your latest changes \n\u003e for merging into swt post-3.3 and have a \n\u003e couple questions: \n\u003e1.  There are a few places where: \n\u003e    int [] lpRgnData \u003d new int [nBytes / 4]; \n\u003ebecame: \n\u003e    int [] lpRgnData \u003d new int [(nBytes / 4) + 1]; \n\u003e We\u0027re not sure why this change is necessary, \n\u003e do you remember why it is there? \n\nBuffer \"lpRgnData\" should be long enougth to keep all \"nBytes\".\nBut, [nBytes/4] returns integer result which is less than required,\nif nBytes cannot be divided by 4 w/o reminder.\nFor example, 14/4 \u003d 3; 3*INT_SIZE\u003d12; 12 \u003c 14;\n\n\u003e 2.  There are a few places where \"\u0026 7FFFFFFF\" \n\u003e disappeared, such as Combo.getTextLimit().  \n\nIt is my error. \nThere was no reasons to remove this masking.\n",
    "When we stepped through the code for GetRegionData() on both 32-bit and 64-bit systems, the results was always an even number of integers (never 64-bit pointer values) so we believe the \"+ 1\" is not necessary.\n\nDo you have a case the fails?",
    "\u003eWhen we stepped through the code for GetRegionData() on both 32-bit and 64-bit\n\u003esystems, the results was always an even number of integers (never 64-bit\n\u003epointer values) so we believe the \"+ 1\" is not necessary.\n\u003e\n\u003eDo you have a case the fails?\n\nThere were a lot of strange failures before Win64 became running.\nRoot causes were not clear in some situations. That\u0027s why we\u0027ve \nchecked all code which _can_ raise a problem. Anyway, if mentioned\nvalue cannot be odd, \"+1\" can be removed.\n ",
    "Ok, we\u0027ll remove it.  We won\u0027t add code that we don\u0027t know what it does, even if \"harmless\".  Experience has shown that this burns us.",
    "Created an attachment (id\u003d72474)\n64-bit org.eclipse.swt for Eclipse 3.3RC4\n\n",
    "I downloaded the 3.3 x64 build. I ran into issues with the update manager.\nThe Europa update site is not configured in the update dialog.\nSo I added the following url as an update site.\nhttp://europa-mirror1.eclipse.org/releases/europa/\n\nI selected the \"Web and J2EE Development\" feature. Then selected the \"Select Required\" button.\n\nIt selected all the required projects and then it gave me an error saying \"Resulting configuration does not contain the platform.\".\n\nIs this a bug in the x64 build or do I need to do something here.\n\n",
    "(In reply to comment #115)\nHi Roshan,\n\nOleg is on vacation now till August 7, so I\u0027ll try to answer your question instead of him.\n\n\u003e I downloaded the 3.3 x64 build.\nWhat kind of x64 platform are you using: is it Itanium or x86_64 architecture?\n\nMikhail",
    "(In reply to comment #116)\n\u003e (In reply to comment #115)\n\u003e Hi Roshan,\n\u003e \n\u003e Oleg is on vacation now till August 7, so I\u0027ll try to answer your question\n\u003e instead of him.\n\u003e \n\u003e \u003e I downloaded the 3.3 x64 build.\n\u003e What kind of x64 platform are you using: is it Itanium or x86_64 architecture?\n\u003e \n\u003e Mikhail\n\u003e \n\nX86_64.\nI am running it under sun jdk6 udpate 2",
    "Hello Oleg Krasilinikov,\n\nWe are working on the migration of our Java applications to XP 64-bit platform. And our applications use RCP and SWT extensively.\n\nI downloaded the zip file containing the sources uploaded by you from the eclipse site (BugZilla). Thank you for providing them.\n\nHowever I could not able build the source to get binaries and jars. \n\nCan you pls provide the link from where I can download the binaries and jars of the same? This will be very helpful for us.\n\nThank you in advance.\n\nThanks \u0026 Regards,\nAmar\n",
    "re: comments 115-117\n\nI\u0027ve extracted this question into new bug 198685 because I\u0027m looking to close this bug soon.\n\n\nre: comment 118\n\nOleg contributed eclipse 3.3 for windows x86_64 recently, it\u0027s available at http://download.eclipse.org/downloads/drops/R-3.3-200706251500/index.php (thank-you Oleg!).  The only issue I noticed with it when I tried it briefly was that I had to use eclipsec.exe to launch it, eclipse.exe did not work for me.  I don\u0027t know if others will have this problem or not.\n",
    "Created an attachment (id\u003d75239)\ntypes of changes made to the patch for 3.4\n\nWow!  We are finally finished going over every single line of code in your patch (and in all of SWT to find things you missed).  We made a summary of what we did as we were making the changes (attached), but it\u0027s not complete.  For example, we are now using macros like HIWORD, rather than shifting and casting (well behaved C programs were already using these macros).  It was painful but we are done.",
    "Fixed \u003e 20070802\n\nThanks to Oleg and everyone else who contributed to this.  We are particularly greatful for the 3.3 contribution.  When it became clear that 64-bit would not make it into 3.3, Oleg stepped up, updated his patch and provided a binary for download.\n\nIt took a while, but we now have one code base that we can maintain and works on both 32 and 64 bit.  It has now joined the regular build lineup for 3.4 (nightly builds, integration builds, etc.) and is fully supported.  Download it, try it out, report bugs!\n",
    "Created an attachment (id\u003d76226)\nProperty files for JNI Generator\n\nAlthough the bug is closed, it would be nice to update JNI Generator property files, to be able to generate and build 64-bit native code.\n\nAttached files are derived from 3.4M1 code and merged with 64-bit-specific changes. In brief, most changes introduce new functions signatures, which\nare changed in 64-bit. All existing additions of 32-bit version are preserved,\nso it would be no problem while using new files for 32-bit compilation.",
    "I do not see why these changes are necessary. The JNIGenerator tool already converts the method signatures in the properties files when generating the 64-bit C code. So once the Java code is converted to 64-bit, the tool will generate 64-bit C code accordingly (without losing cast, etc).",
    "Silentio,\n\nI agree. It works.\nSorry. I\u0027ll disable my attach.\n\n",
    "(From update of attachment 76226)\nExisting JNI props work OK. No need to change."
  ],
  "commentCreationDates": [
    "2004-04-02T00:22:58+02:00",
    "2004-04-02T15:04:40+02:00",
    "2004-10-25T16:10:53+02:00",
    "2005-06-10T20:53:41+02:00",
    "2005-06-25T15:45:35+02:00",
    "2005-08-14T12:10:06+02:00",
    "2005-09-18T08:09:59+02:00",
    "2005-10-26T23:38:24+02:00",
    "2005-11-12T22:01:55+01:00",
    "2005-12-09T09:17:42+01:00",
    "2005-12-22T21:19:06+01:00",
    "2006-01-11T15:13:58+01:00",
    "2006-01-11T16:44:56+01:00",
    "2006-01-11T16:51:41+01:00",
    "2006-01-15T10:28:47+01:00",
    "2006-01-16T15:08:36+01:00",
    "2006-01-17T00:24:55+01:00",
    "2006-01-17T11:49:55+01:00",
    "2006-01-17T11:56:35+01:00",
    "2006-03-13T19:13:25+01:00",
    "2006-03-15T14:56:56+01:00",
    "2006-03-15T20:27:34+01:00",
    "2006-03-16T06:01:13+01:00",
    "2006-03-16T22:57:03+01:00",
    "2006-03-21T15:44:10+01:00",
    "2006-03-21T17:37:01+01:00",
    "2006-03-23T14:57:57+01:00",
    "2006-03-29T12:50:07+02:00",
    "2006-03-30T13:56:36+02:00",
    "2006-04-03T11:24:28+02:00",
    "2006-04-05T22:17:44+02:00",
    "2006-04-11T10:42:56+02:00",
    "2006-04-12T16:14:12+02:00",
    "2006-04-12T16:41:04+02:00",
    "2006-04-13T13:54:09+02:00",
    "2006-04-13T17:53:24+02:00",
    "2006-05-06T16:27:54+02:00",
    "2006-05-18T10:00:05+02:00",
    "2006-05-19T12:00:56+02:00",
    "2006-05-19T12:06:56+02:00",
    "2006-05-19T18:03:29+02:00",
    "2006-05-19T21:20:52+02:00",
    "2006-05-22T12:39:08+02:00",
    "2006-05-22T12:55:22+02:00",
    "2006-05-22T13:10:48+02:00",
    "2006-05-22T15:52:32+02:00",
    "2006-05-22T15:54:37+02:00",
    "2006-05-22T15:59:32+02:00",
    "2006-05-22T16:15:26+02:00",
    "2006-05-22T16:43:16+02:00",
    "2006-05-22T16:46:35+02:00",
    "2006-05-23T02:59:39+02:00",
    "2006-05-23T03:01:23+02:00",
    "2006-05-23T03:06:50+02:00",
    "2006-05-23T14:07:24+02:00",
    "2006-05-26T09:01:53+02:00",
    "2006-05-26T20:55:02+02:00",
    "2006-05-29T10:51:50+02:00",
    "2006-05-30T19:28:15+02:00",
    "2006-05-30T20:54:21+02:00",
    "2006-05-31T03:44:22+02:00",
    "2006-05-31T10:28:15+02:00",
    "2006-05-31T19:59:23+02:00",
    "2006-06-01T10:44:51+02:00",
    "2006-06-02T02:58:01+02:00",
    "2006-06-03T02:24:33+02:00",
    "2006-06-04T14:42:48+02:00",
    "2006-06-08T21:49:37+02:00",
    "2006-06-09T09:23:45+02:00",
    "2006-06-22T16:09:24+02:00",
    "2006-07-04T09:52:35+02:00",
    "2006-07-04T11:17:59+02:00",
    "2006-07-12T09:26:04+02:00",
    "2006-07-12T09:48:40+02:00",
    "2006-08-23T15:44:29+02:00",
    "2006-08-24T15:53:51+02:00",
    "2006-09-04T20:15:37+02:00",
    "2006-09-28T22:44:13+02:00",
    "2006-09-29T00:25:09+02:00",
    "2006-09-29T08:52:51+02:00",
    "2006-09-29T09:02:37+02:00",
    "2006-09-29T17:07:37+02:00",
    "2006-10-04T17:24:24+02:00",
    "2006-10-05T12:04:25+02:00",
    "2006-10-05T12:08:25+02:00",
    "2006-10-05T12:12:14+02:00",
    "2006-10-25T19:39:07+02:00",
    "2006-11-07T22:12:57+01:00",
    "2006-11-11T18:38:56+01:00",
    "2006-11-16T12:53:37+01:00",
    "2006-11-16T13:49:42+01:00",
    "2006-11-16T14:19:49+01:00",
    "2006-11-20T14:50:35+01:00",
    "2006-11-20T20:38:55+01:00",
    "2006-11-21T08:03:24+01:00",
    "2006-11-28T21:21:23+01:00",
    "2006-11-29T09:58:52+01:00",
    "2006-12-21T16:27:45+01:00",
    "2006-12-29T02:18:35+01:00",
    "2007-01-04T22:10:50+01:00",
    "2007-03-13T16:36:11+01:00",
    "2007-03-23T16:58:56+01:00",
    "2007-04-02T09:56:03+02:00",
    "2007-04-03T02:39:30+02:00",
    "2007-05-25T00:07:39+02:00",
    "2007-05-30T16:10:23+02:00",
    "2007-06-06T18:55:37+02:00",
    "2007-06-06T18:58:17+02:00",
    "2007-06-06T19:00:17+02:00",
    "2007-06-18T10:37:32+02:00",
    "2007-06-20T16:14:46+02:00",
    "2007-06-20T17:44:42+02:00",
    "2007-06-21T07:44:37+02:00",
    "2007-06-21T13:36:45+02:00",
    "2007-06-26T16:05:10+02:00",
    "2007-07-27T02:02:35+02:00",
    "2007-08-01T16:01:14+02:00",
    "2007-08-01T19:54:31+02:00",
    "2007-08-02T10:08:32+02:00",
    "2007-08-02T17:25:32+02:00",
    "2007-08-02T17:44:54+02:00",
    "2007-08-02T18:01:39+02:00",
    "2007-08-16T17:07:28+02:00",
    "2007-08-16T18:31:51+02:00",
    "2007-08-17T11:53:42+02:00",
    "2007-08-17T12:01:37+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.UnsatisfiedLinkError",
      "message": "C:\\Program  Files\\eclipse\\plugins\\org.eclipse.swt.win32_3.0.0\\os\\win32\\x86\\swt-win32- 3044.dll: %1 is not a valid Win32 application",
      "elements": [
        {
          "method": "java.lang.ClassLoader$NativeLibrary.load",
          "source": "Native Method"
        },
        {
          "method": "java.lang.ClassLoader.loadLibrary0",
          "source": "ClassLoader.java:1737"
        },
        {
          "method": "java.lang.ClassLoader.loadLibrary",
          "source": "ClassLoader.java:1646"
        },
        {
          "method": "java.lang.Runtime.loadLibrary0",
          "source": "Runtime.java:817"
        },
        {
          "method": "java.lang.System.loadLibrary",
          "source": "System.java:986"
        },
        {
          "method": "org.eclipse.swt.internal.Library.loadLibrary",
          "source": "Library.java:100"
        },
        {
          "method": "org.eclipse.swt.internal.win32.OS.\u003cclinit\u003e",
          "source": "OS.java:18"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.internal_new_GC",
          "source": "Display.java:1605"
        },
        {
          "method": "org.eclipse.swt.graphics.Device.init",
          "source": "Device.java:555"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.init",
          "source": "Display.java:1630"
        },
        {
          "method": "org.eclipse.swt.graphics.Device.\u003cinit\u003e",
          "source": "Device.java:99"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.\u003cinit\u003e",
          "source": "Display.java:337"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.\u003cinit\u003e",
          "source": "Display.java:333"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.createDisplay",
          "source": "Workbench.java:281"
        },
        {
          "method": "org.eclipse.ui.PlatformUI.createDisplay",
          "source": "PlatformUI.java:151"
        },
        {
          "method": "org.eclipse.ui.internal.ide.IDEApplication.run",
          "source": "IDEApplication.java:66"
        },
        {
          "method": "org.eclipse.core.internal.runtime.PlatformActivator$1.run",
          "source": "PlatformActivator.java:277"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:239"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:117"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "NativeMethodAccessorImpl.java:39"
        },
        {
          "method": "sun.reflect.DelegatingMethodAccessorImpl.invoke",
          "source": "DelegatingMethodAccessorImpl.java:25"
        },
        {
          "method": "java.lang.reflect.Method.invoke",
          "source": "Method.java:494"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:267"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:692"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:676"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "57151",
      "date": "2004-04-02T00:22:58+02:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "enhancement"
    },
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.ve.internal.swt.SWTContainer$ContainerType.getPlatformVersion",
          "source": "SWTContainer.java:198"
        },
        {
          "method": "org.eclipse.ve.internal.swt.SWTContainerWizardContent.setPlatform",
          "source": "SWTContainerWizardContent.java:168"
        },
        {
          "method": "org.eclipse.ve.internal.swt.SWTContainerWizardContent.setContainerType",
          "source": "SWTContainerWizardContent.java:232"
        },
        {
          "method": "org.eclipse.ve.internal.swt.SWTContainerWizardPage.initializeFromSelection",
          "source": "SWTContainerWizardPage.java:53"
        },
        {
          "method": "org.eclipse.ve.internal.swt.SWTContainerWizardPage.createControl",
          "source": "SWTContainerWizardPage.java:43"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.updateForPage",
          "source": "WizardDialog.java:1046"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.access$2",
          "source": "WizardDialog.java:1038"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog$4.run",
          "source": "WizardDialog.java:1028"
        },
        {
          "method": "org.eclipse.swt.custom.BusyIndicator.showWhile",
          "source": "BusyIndicator.java:67"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.showPage",
          "source": "WizardDialog.java:1026"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.nextPressed",
          "source": "WizardDialog.java:757"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.buttonPressed",
          "source": "WizardDialog.java:351"
        },
        {
          "method": "org.eclipse.jface.dialogs.Dialog$3.widgetSelected",
          "source": "Dialog.java:660"
        },
        {
          "method": "org.eclipse.swt.widgets.TypedListener.handleEvent",
          "source": "TypedListener.java:90"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:928"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3358"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2978"
        },
        {
          "method": "org.eclipse.jface.window.Window.runEventLoop",
          "source": "Window.java:820"
        },
        {
          "method": "org.eclipse.jface.window.Window.open",
          "source": "Window.java:796"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.buildpaths.ClasspathContainerWizard.openWizard",
          "source": "ClasspathContainerWizard.java:230"
        },
        {
          "method": "org.eclipse.jdt.ui.wizards.BuildPathDialogAccess.chooseContainerEntries",
          "source": "BuildPathDialogAccess.java:272"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage.openContainerSelectionDialog",
          "source": "LibrariesWorkbookPage.java:811"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage.libaryPageCustomButtonPressed",
          "source": "LibrariesWorkbookPage.java:243"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage.access$0",
          "source": "LibrariesWorkbookPage.java:230"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.buildpaths.LibrariesWorkbookPage$LibrariesAdapter.customButtonPressed",
          "source": "LibrariesWorkbookPage.java:185"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.buttonPressed",
          "source": "TreeListDialogField.java:167"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.doButtonSelected",
          "source": "TreeListDialogField.java:385"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField.access$2",
          "source": "TreeListDialogField.java:381"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.wizards.dialogfields.TreeListDialogField$2.widgetSelected",
          "source": "TreeListDialogField.java:346"
        },
        {
          "method": "org.eclipse.swt.widgets.TypedListener.handleEvent",
          "source": "TypedListener.java:90"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:928"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3358"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2978"
        },
        {
          "method": "org.eclipse.jface.window.Window.runEventLoop",
          "source": "Window.java:820"
        },
        {
          "method": "org.eclipse.jface.window.Window.open",
          "source": "Window.java:796"
        },
        {
          "method": "org.eclipse.ui.dialogs.PropertyDialogAction.run",
          "source": "PropertyDialogAction.java:156"
        },
        {
          "method": "org.eclipse.jface.action.Action.runWithEvent",
          "source": "Action.java:499"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection",
          "source": "ActionContributionItem.java:539"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.access$2",
          "source": "ActionContributionItem.java:488"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem$5.handleEvent",
          "source": "ActionContributionItem.java:400"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:928"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3358"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2978"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runEventLoop",
          "source": "Workbench.java:1914"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runUI",
          "source": "Workbench.java:1878"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.createAndRunWorkbench",
          "source": "Workbench.java:419"
        },
        {
          "method": "org.eclipse.ui.PlatformUI.createAndRunWorkbench",
          "source": "PlatformUI.java:149"
        },
        {
          "method": "org.eclipse.ui.internal.ide.IDEApplication.run",
          "source": "IDEApplication.java:95"
        },
        {
          "method": "org.eclipse.core.internal.runtime.PlatformActivator$1.run",
          "source": "PlatformActivator.java:78"
        },
        {
          "method": "org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.runApplication",
          "source": "EclipseAppLauncher.java:92"
        },
        {
          "method": "org.eclipse.core.runtime.internal.adaptor.EclipseAppLauncher.start",
          "source": "EclipseAppLauncher.java:68"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:400"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:177"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "NativeMethodAccessorImpl.java:39"
        },
        {
          "method": "sun.reflect.DelegatingMethodAccessorImpl.invoke",
          "source": "DelegatingMethodAccessorImpl.java:25"
        },
        {
          "method": "java.lang.reflect.Method.invoke",
          "source": "Method.java:585"
        },
        {
          "method": "org.eclipse.core.launcher.Main.invokeFramework",
          "source": "Main.java:336"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:280"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:977"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:952"
        }
      ],
      "number": 1,
      "commentIndex": 72,
      "bugId": "57151",
      "date": "2006-07-12T09:26:04+02:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "enhancement"
    }
  ],
  "groupId": "57151",
  "bugId": "57151",
  "date": "2004-04-02T00:22:58+02:00",
  "product": "Platform",
  "component": "SWT",
  "severity": "enhancement"
}