{
  "comments": [
    "Whenever opening a visual (Swing) class in visual editor, eclipse crashes with\nthe error message \"Error IWAV0138E: Remote VM terminated to soon\", followed by a\nmessage saying \"Error to set new file in editor\", which cannot be clicked away -\neclipse freezes and has to be terminated from the task manager.\n\nprobably this is an issue depending on processor power, since this problem does\nnot occur on my desktop machine, but only on my laptop (1.000 MHz PIII, 512MB\nRAM), using the identical eclipse version and settings.\n\nUsing VE Build id: 200403251209, but also noticed this in the most recent\nintegration build.",
    "I can\u0027t reproduce this with our latest builds. Please try with the M1RC1 driver\non M8 Eclipse and see if it still occurs. If it does, please reopen the bug.",
    "with M1RC1 it fails silently on my laptop - of course i cannot tell if this is\nthe same bug. when i open or create a visual class, synchronizing stops after\n25% and nothing is displayed in the upper half of the visual editor.\n\nas mentioned before, this only happes on my notebook.",
    "Please attach the .log file so we can see what errors it produced.",
    "Created an attachment (id\u003d10063)\n.log file of eclipse session with failed attempt to open visual class\n\nattached a log file of a single session, trying to open a single visual class\nin the visual editor. it contains a few line saying\n\njava.lang.NoClassDefFoundError: org/eclipse/ui/PlatformUI\n\tat\norg.eclipse.jem.internal.beaninfo.adapters.UICreateRegistryJobHandler.processCreateRegistry(UICreateRegistryJobHandler.java:42)\n",
    "Ah yes! This is an older (i.e. used once already for VE) eclipse configuration\nwhere you unzipped a new VE over top of it, right? We changed abd added a\npre-req to one of the plugins and the old configuration was cached in the\neclipse and it would  not see the new requirement. Had to go to the\neclipse/.config directory and delete the .config directory. That way it will\nrebuild the cache and see the new requirement. \n\nIt seems to only see changes like this when you add a new version of a plugin.\nIt doesn\u0027t see that the old version plugin.xml has been modified.",
    "i cannot find any .config directory in my installation - neither in the eclipse\nprogram directory, nor in the workspace.",
    "Sorry, it is configuration directory in the eclipse installation.",
    "ok, i got that to work, but now i see the original bug again. only this time the\nerror says \"IWAV0067E No Standard Bean Type Proxy Factory has been set\"\n\nthe bad thing is that i cannot click \"ok\" on this, so i have to kill eclipse\nevery time this happens.\n\ni will attach the .log file of this session below.",
    "Created an attachment (id\u003d10068)\nlog file of crash session\n\nthis is the original error. there seems to be some problem with our classes\n(com.inteligand.*) involved, but still it shouldn\u0027t crash so badly. also the\nquestion remains why it works on my desktop machine (same setup)",
    "I see this piece of output coming from your code that we execute:\n\ngetClass()class com.inteligand.ilib.config.PathFinder\npath/com/inteligand/ilib\ngetResource()file:/C:/data/projects/ilib/bin/com/inteligand/ilib\nCould not load essentials:\nC:\\data\\projects\\ilib\\bin\\com\\inteligand\\ilib\\moldata\\essentials\\oh.mol (Das\nSystem kann den angegebenen Pfad nicht finden)\n\n\nAnd right after this the remote vm is terminated. Do you have a System.exit()\ncall somewhere in your code when you get this error? If you do, you will\nterminate our remote vm where we run the code. It looks it is hitting that. The\nfile mentioned doesn\u0027t exist on your system, so it can\u0027t find it.\n\nThere were other hard-coded (i.e. looking on the C: drive for them) files, and\nthey couldn\u0027t be found either.\n\nWe already have an enhancement requirement to see if we can put in a security\nmanager which will prevent system.exit() from being called.",
    "I just tested a case where a System.exit() is thrown in the user class. We still\nget message about remote vm terminated too soon. It will try three times, after\nthe third try it gives up. But it doesn\u0027t lock up and prevent you from using the\ntext editor portion. The code in M1RC1 doesn\u0027t have the necessary fixes yet to\nnot lock up. \n\nThe next M1 release should be tried and see if you still lock up. You won\u0027t be\nable to do anything with the visual part because you are still doing the\nSystem.exit(). But you shouldn\u0027t be locking up.",
    "I\u0027ve released changes to HEAD to get rid of the freeze problems when vm\nterminated prematurely. However, I can\u0027t stop the premature termination. That is\ndone in user code.",
    "M1 released, move all resolved to Verified, as prelude to closing.",
    "M1 released, move all resolved/verified to Closed."
  ],
  "commentCreationDates": [
    "2004-04-25T19:11:21+02:00",
    "2004-04-27T23:58:47+02:00",
    "2004-04-28T16:55:12+02:00",
    "2004-04-28T17:05:02+02:00",
    "2004-04-28T17:27:03+02:00",
    "2004-04-28T17:44:14+02:00",
    "2004-04-28T18:00:31+02:00",
    "2004-04-28T18:11:32+02:00",
    "2004-04-28T18:21:02+02:00",
    "2004-04-28T18:29:50+02:00",
    "2004-04-28T20:03:50+02:00",
    "2004-04-28T20:16:01+02:00",
    "2004-04-28T22:31:04+02:00",
    "2004-05-03T23:32:23+02:00",
    "2004-05-03T23:35:58+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NoClassDefFoundError",
      "message": "org/eclipse/ui/PlatformUI",
      "elements": [
        {
          "method": "org.eclipse.jem.internal.beaninfo.adapters.UICreateRegistryJobHandler.processCreateRegistry",
          "source": "UICreateRegistryJobHandler.java:42"
        }
      ],
      "number": 0,
      "commentIndex": 4,
      "bugId": "59883",
      "date": "2004-04-28T17:27:03+02:00",
      "product": "VE",
      "component": "Java Core",
      "severity": "major"
    }
  ],
  "groupId": "59883",
  "bugId": "59883",
  "date": "2004-04-25T19:11:21+02:00",
  "product": "VE",
  "component": "Java Core",
  "severity": "major"
}