{
  "comments": [
    "This problem came up after I migrated to M7, and has continued in M8.  \n\nNormally with Eclipse 3.x, if I check out a project from CVS - then work with it, like if I begin editing a \n.java file in the eclipse editor, Eclipse used to mark it editable and then allow me to edit it.  But now \nafter M7, I would be blocked from editing the file, and I would have to do one of a few things which \nwere really annoying.\n\n1. Pick Team \u003e Edit to have eclipse attempt ot make it editable, which would result in a \"Errors in \ndeleting resources\" message.  Then I would have to pick Properties, then un-check the Read-Only \nattribute and then I finally can edit it. \n\nOR\n\n1. Go to terminal and type \u0027chflags -R nouchg .\u0027 in the workspace directory, to mark the files not read-\nonly and then eclipse will allow me to edit the files normally.  \n\nHowever problem with the above solutions is that as soon as I refresh from CVS, or do a replace file \nfrom CVS or anything (or set up a new workspace), those files would be read-only again, and I\u0027d run \ninto the same problems again.  My co-worker here also uses Eclipse on his Powerbook and has been \nexperiencing the same problems.   Another co-worker with a PC does not have this problem.\n\nJust wondering if anything was changed w/ how Eclipse handles marking files read-only, and vice versa \nbetween M7 and earlier versions, that might have brought about this regression.  Everything worked \nfine prior to M7 in our development environment.  (Note, we did skip M5, M6, I believe).  I am willing to \ntry out earlier milestones or do tests on my computer to give additional information, if any of you \nrequest it.",
    "This works on Windows. Can you set the read-only status of a file through the \nProperties dialog in Eclipse?",
    "Like I said in my original comment, a co-worker using a PC does not see this problem.  \n\nAnd I also mentioned in my original comment that unsetting the Read-Only flag in Properties window \ndoes allow me to edit it, but as soon as that file is checked in, or if I do a \u0027replace from HEAD\u0027 - the file \nagain exhibits the same problems.",
    "Sorry, I\u0027m not having one of my better days. Is there anything in the log file \n(the contents of the log can be viewed using the Error Log view)? It sounds \nlike it could be related to previous project state. Have you tried working \nwith a project that has been checkout out from scratch?",
    "Ok, I wasn\u0027t able to find this Error Log you referred to - if u can tell me where to find this, I will look at \nit.\n\nI also tried to reproduce this problem with the latest integration build from eclipse.org and a clean \nproject checkout from cvs.. same problems occured.\n\n I did open up a tail console on the .log file in the workspace directory and then I did these steps.\n\n1. Selected file to be edited.  Hit return to try to add a new line.  Nothing happend.\n2. Right-click file and selected Team \u003e Edit\n3. Progress view came up, no errors or problems reported.\n4. Tried to add new lines.  Still couldnt.\n5. Right-click file and selected Team \u003e Edit again\n6. Got a prompt that someone was \u0027editing\u0027 the file (which was my host information)\n7. Went ahead and edited anyway\n8. Got a progress bar again (something to do w/ setting cvs properties, didnt see, went by too fast)\n9. Error popup with \u0027Problems encountered while deleting resources\u0027\n\nHere\u0027s the stack trace that came up in the log console.\n\n!ENTRY org.eclipse.team.cvs.ui 4 0 May 11, 2004 15:11:05.968\n!MESSAGE Problems encountered while deleting resources.\n!STACK 1\norg.eclipse.team.internal.ccvs.core.CVSException[4]: \norg.eclipse.core.internal.resources.ResourceException: Problems encountered while deleting resources.\n        at org.eclipse.core.internal.resources.Resource.delete(Resource.java:663)\n        at org.eclipse.core.internal.resources.Resource.delete(Resource.java:623)\n        at \norg.eclipse.team.internal.ccvs.core.util.SyncFileWriter.writeFileToBaseDirectory(SyncFileWriter.java:561)\n        at \norg.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.copyFileToBaseDirectory(EclipseSynch\nronizer.java:1274)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseFile$1.run(EclipseFile.java:350)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.run(EclipseSynchronizer.java:\n1403)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseResource$2.run(EclipseResource.java:268)\n        at org.eclipse.core.internal.resources.Workspace.run(Workspace.java:1559)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseResource.run(EclipseResource.java:265)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseFile.edit(EclipseFile.java:319)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider$9.visitFile(CVSTeamProvider.java:1156)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseFile.accept(EclipseFile.java:154)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider$11.run(CVSTeamProvider.java:1210)\n        at org.eclipse.core.internal.resources.Workspace.run(Workspace.java:1559)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider.notifyEditUnedit(CVSTeamProvider.java:\n1246)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider.edit(CVSTeamProvider.java:1153)\n        at org.eclipse.team.internal.ccvs.ui.actions.EditAction$3.execute(EditAction.java:52)\n        at \norg.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction(WorkspaceAction.java:\n501)\n        at \norg.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction(WorkspaceAction.java:\n510)\n        at org.eclipse.team.internal.ccvs.ui.actions.EditAction$2.execute(EditAction.java:50)\n        at org.eclipse.ui.actions.WorkspaceModifyOperation$1.run(WorkspaceModifyOperation.java:91)\n        at org.eclipse.core.internal.resources.Workspace.run(Workspace.java:1559)\n        at org.eclipse.ui.actions.WorkspaceModifyOperation.run(WorkspaceModifyOperation.java:105)\n        at org.eclipse.team.internal.ccvs.ui.repo.RepositoryManager.run(RepositoryManager.java:741)\n        at org.eclipse.team.internal.ccvs.ui.actions.CVSAction$1.run(CVSAction.java:225)\n        at org.eclipse.jface.operation.ModalContext$ModalContextThread.run(ModalContext.java:101)\n!SUBENTRY 1 org.eclipse.core.resources 4 4 May 11, 2004 15:11:05.973\n!MESSAGE Problems encountered while deleting resources.\n!STACK 1\norg.eclipse.core.internal.resources.ResourceException: Problems encountered while deleting resources.\n        at org.eclipse.core.internal.resources.Resource.delete(Resource.java:663)\n        at org.eclipse.core.internal.resources.Resource.delete(Resource.java:623)\n        at \norg.eclipse.team.internal.ccvs.core.util.SyncFileWriter.writeFileToBaseDirectory(SyncFileWriter.java:561)\n        at \norg.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.copyFileToBaseDirectory(EclipseSynch\nronizer.java:1274)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseFile$1.run(EclipseFile.java:350)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.run(EclipseSynchronizer.java:\n1403)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseResource$2.run(EclipseResource.java:268)\n        at org.eclipse.core.internal.resources.Workspace.run(Workspace.java:1559)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseResource.run(EclipseResource.java:265)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseFile.edit(EclipseFile.java:319)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider$9.visitFile(CVSTeamProvider.java:1156)\n        at org.eclipse.team.internal.ccvs.core.resources.EclipseFile.accept(EclipseFile.java:154)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider$11.run(CVSTeamProvider.java:1210)\n        at org.eclipse.core.internal.resources.Workspace.run(Workspace.java:1559)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider.notifyEditUnedit(CVSTeamProvider.java:\n1246)\n        at org.eclipse.team.internal.ccvs.core.CVSTeamProvider.edit(CVSTeamProvider.java:1153)\n        at org.eclipse.team.internal.ccvs.ui.actions.EditAction$3.execute(EditAction.java:52)\n        at \norg.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction(WorkspaceAction.java:\n501)\n        at \norg.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction(WorkspaceAction.java:\n510)\n        at org.eclipse.team.internal.ccvs.ui.actions.EditAction$2.execute(EditAction.java:50)\n        at org.eclipse.ui.actions.WorkspaceModifyOperation$1.run(WorkspaceModifyOperation.java:91)\n        at org.eclipse.core.internal.resources.Workspace.run(Workspace.java:1559)\n        at org.eclipse.ui.actions.WorkspaceModifyOperation.run(WorkspaceModifyOperation.java:105)\n        at org.eclipse.team.internal.ccvs.ui.repo.RepositoryManager.run(RepositoryManager.java:741)\n        at org.eclipse.team.internal.ccvs.ui.actions.CVSAction$1.run(CVSAction.java:225)\n        at org.eclipse.jface.operation.ModalContext$ModalContextThread.run(ModalContext.java:101)\n!SUBENTRY 2 org.eclipse.core.resources 4 4 May 11, 2004 15:11:05.974\n!MESSAGE Problems encountered while deleting resources.\n!SUBENTRY 3 org.eclipse.core.resources 4 273 May 11, 2004 15:11:05.975\n!MESSAGE Could not delete: /Users/timwork/CodeCentral/xxxx/com.xx.xx.xx.xx/src/com/xx/xx/\nmodule/xx/xx/CVS/Base/XXXXX.java.",
    "The error is being thrown because \nfile \"/Users/timwork/CodeCentral/xxxx/com.xx.xx.xx.xx/src/com/xx/xx/\nmodule/xx/xx/CVS/Base/XXXXX.java\" could not be deleted. Unfortunately, we are \njust using the return code from the java.io.File#delete() method which just \nreturns a boolean indicating success or failure. What VM are you using? Do you \nget the same behavior with other VMs?",
    "With OSX, there is just one VM (apple supplied).  Here\u0027s the simple output.\n\nlust:~ timwork$ java -version\njava version \"1.4.2_03\"\nJava(TM) 2 Runtime Environment, Standard Edition (build 1.4.2_03-117.1)\nJava HotSpot(TM) Client VM (build 1.4.2-34, mixed mode)\n\nYes, it seems to be that the problem is w/ deleting the resource in the CVS folder - and this problem \ndid not exist for me prior to M7.  So it probably appears to me that it could be one of two things.. \neither that Apple changed something in how the VM handles files, but I find this unlikely because I ran \nacross this problem almost immediately after upgrading to M7.  And its possible apple released an Java \nupdate at about the same time, but I cannot say with certainity either way, since it was a while ago.\n\nI\u0027m looking at the file that it\u0027s attempting to delete (same path as the one specified in the stack trace).  \nWhich appears to be read-only.  And its also interesting that this is a file within CVS/Base - which \nmeans is it a file that eclipse is creating with it\u0027s own CVS implementation?  Or is eclipse simply using \nthe CVS implementation provided by OS X?  I do not know those details.\n\n-r--r--r--  1 timwork  timwork  7615  6 May 17:09 Xxxxx.java\n\nSo, perhaps this is not what\u0027s supposed to  be happening.  Shouldnt this file be writeable as well, so \nthat it can be deleted by Eclipse?  Is it possible that theres a bug occuring when Eclipse is creating \nthose CVS files and setting them as read-only, instead of being read-writeable?\n\nI also took a look at the actual .java file (not the one in the CVS working directory):\n\n-r--r--r--   1 timwork  timwork   7615  6 May 17:09 Xxxxx.java\n\nAfter selecting Properties, and unchecking the read-only box, it changes to this:\n\n-rw-r--r--   1 timwork  timwork   7615  6 May 17:09 AuthenticationAction.java\n\nAnother thing I\u0027ve noted just now is that when I check those files out from CVS, they appear in OS X\u0027s \nfinder with \"locked\" icons next to each file.   I am quite certain this was not happening prior to M7. \n\nGetting information on the file, and un-locking the file does not modify the attributes that I pasted in \nabove.  So this bit/flag/whatever must be being set somewhere else.  It would seem to me that \nsomething has changed with how Eclipse is creating the CVS files and source files when getting them \nfrom CVS, and it manifests itself as a problem with how Eclipse is attempting to edit them.",
    "Forgot to Xxxx out the AuthenticationAction.java filename on the last example, so it\u0027s really not that \nthe filename itself actually changed.",
    "I looked at the code and we do copy the file before clearing the read-only \nbit. Perhaps the bit is copied on the Mac but not on Windows. I will update \nthe code to clear the read-only bit before deleting.",
    "I\u0027ve released the change to HEAD. It will be in next weeks integration build \nand in M9.",
    "Thanks.  I\u0027ll check the integration build when it is released and hopefully it will be all good.  ",
    "I\u0027m re-opening this bug report because it doesnt seem to be fixed in M9.  \n\nIn M9, I no longer get the \"errors in deleting resources\" message.  However here are the steps I have to \ntake if i want to edit a java file.\n\n1. Open java file in editor, attempt to add a new line.  Am not able to because the file is read only.\n2. Selected Team \u003e Edit \n3. Two separate \"operations in progress\" dialogues come up, one after the other, cannot read what they \nare (goes by too quickly).\n4. Control returned to editor.  Attempted to add a newline.  Still could not.  \n5. Selected Team \u003e Edit \n6. Single \"operation in progress\" comes up. \n7. Dialogue comes up, saying this resource currently has editors (hostname refers to myself), do i want \nto still send a edit message to the server.\n8. clicking yes returns control to the editor.\n9. file is now editable.  \n\nI monitored the .log as I was doing all this.  No errors were displayed in the log as far as I can see.",
    "One other addition.  This problem does not seem to affect any file types except .java files.   editing .txt, \n.properties, and .xml files with the basic text editor work just fine.",
    "Copying Andre since he is a Mac guy. Andre, have you seen anything like this?",
    "Could you please check whether you have CVS Watch/Edit mode enabled?\nSee Windows \u003e Preferences \u003e Team \u003e CVS \u003e Watch/Edit \u003e Configure projects to use...\n\nIf you create a new project (that is not shared with a repository) and create a new file within this project, \nis this file editable?",
    "Here are the options I have in the cvs \u003e watch/edit prefs pane.\n\n[ ] configure projects to use watch/edit on checkout (is not checked)\n\nSend a CVS edit notification to server (radio button is on)\n\nOnly Prompt if there are other editors (radio button is on)\n\nAs for the second question  - I created a new project, and createda HelloWorld.java file w/ the Class \nwizard and then attempted to edit it.  I was able to edit it immediately.",
    "The problem exist on amd 64 version also.  CVS edit is sending notification to the server as \"cvs \neditors\" show who has the editor on a file, but the file attribute remains read-only on amd 64 linux \nusing ext as protocol.\n\nhaving the same issue as the orignial poster on mac os-x also.\n\ni\u0027ll try the same on linux gtk sometime this weekend.",
    "on an additional note, unchecking the read only checkbox in the property window\u0027s info section doesn\u0027t \nchange the file attribute on amd 64 version.\n\nbtw, this problem exists on eclipse m9 and RC1.",
    "First of all, let me know if I should open a seperate bug report for this problem as it is possible the \nsame behavior displayed on Mac and amd 64 linux could be caused by two different problems.  \nBut this is what I did as a test.\n\nTesting Environment:\n- 3.0 RC1 on Mac OS X 10.3.3 with Apple\u0027s JDK 1.4.2\n- 3.0 RC1 Linux AMD 64 GTK on Mandrake 10.0 AMD 64 with Blackdown\u0027s AMD 64 JDK 1.4.2 RC1\n- 3.0 RC1 Linux GTK on Redhat 9.0 with Sun\u0027s JDK 1.4.2\n\nTesting Condition:\n- Fresh install of eclipse 3.0 RC1 on all three platforms (no existing .metadata)\n- after initial launch of eclipse, selected workbench then opened up cvs repository perspective.\n- created a new cvs repository location to cvs server using extssh as the protocol.\n- check out a module using \"check out\" context menu option.  (I created a simple cvs module that only \nhas eclipse project file, classpath and HellowWorld.java for this testing purpose).\n- Open up java perspective\n- Open up HelloWorld.java file.\n- Hit enter key from the source editor to trigger a cvs edit.\n\nAt this point, Mac version and AMD 64 version displayed the same behavior.  In both cases, the cursor \nstays at the position where I hit the enter key (ie didn\u0027t create a new line).  And checking on the file\u0027s \nreadonly attribute from the properties window\u0027s info section shows the file is still read only.  \n\nLinux 32 bit GTK version worked as it\u0027s supposed to - it created a new line and the file was writable.\n\nAs a next step. on Mac and AMD64, I tried explicitly unsetting the readonly attribute from the property \nwindow\u0027s info section by clearing the checkbox.\n\nOn Mac version, the check box was cleared and the file became writable.  On AMD64 version however, \nthe file still remained read-only, and checking back the property window reveals the file is still read-\nonly.  So apparently at this point the behavior on two platforms are slightly different.\n\nNo log entry was written for these on both platform (although amd 64 version dumps exception \nstacktrace for unzipping quite often, unrelated to this particular problem).\n\nRepeating the same test with ext as protocol produces the same result.\n\nAnother issue related to this one is that even though cvs edit was issued successfully while failing on \nsetting the file\u0027s write permission, the context menu on the file displays edit option, but unedit option \nis grayed out.  I\u0027m not sure which way I\u0027d prefer.  But since file is technically locked for edit from cvs \npoint of view, I would think I should get unedit instead of edit, since running cvs edit on that file will \nonly result in the cvs editor window popping up.\n\nFWIW, I tried this test with the source build for AMD 64.  I also added a few debug statements to \nEclipseFile.java and some others while building it, and I verified that after setReadOnly is called from \nthe edit method, the file still remains read only - readonly attribute if IFile is still set to true after \nsetReadOnly(false) is called.  Not having the depth of knowledge in eclipse source code, my initial \nsuspicion is that issue exists in the JNI level for amd 64 while the issue is on higher level for Mac \nversion.\n\nAnd just one additional information i just thought of, in the previous 3.0 build versions for mac (prior \nto m8), extssh protocol did work properly for both cvs edit notify and file permission.  however, ext \nprotocol always displayed the same behavior that the current builds of eclipse is displaying.  I don\u0027t \nknow if this means anything.",
    "Additional notes after some more debugging on amd 64, the platform is not able to load the core jni \nlibrary as it fails on initialization of CoreFileSystemLibrary.java, and hasNative stays false, which forces \nthe setReadOnly method of CoreFileSystemLibrary.java to bypass internalSetReadOnlyW call and just \nreturn false.\n\nI\u0027m going to submit a separate bug report for this.\n\nI might be able to debug this on Mac too, though now I am 100% positive they are different issues.",
    "This is not an issue with CVS. We just use the API provided by Core to set and \nclear the read-only bit. Moving to Core.",
    "not sure if this is still the bug id to use for the issue with os x.\n\nno more amd 64 issue.  it\u0027s handled in bug 12358.\n\non osx, what seems to be happening is when you edit a file that still marked as unedited (with \nimmutable bit and readonly bit), it fires up cvs edit command but still remains read only.  i close the file \nthat i just tried to edit, reopen it and try editing it again, then it pops up the cvs editors window saying \nit\u0027s already checked out by me, then it unsets the read only bit.  i confirmed this with my coworker as \nwell.   thought this might be useful.",
    "Ok, I looked at this with MichaelV and we verified that this is not a Team problem. Here are simple \nsteps to show the underlying problem:\n\n1) Create a project\n2) Create a file in the project (any file, say \"foo.txt\")\n3) Open (Eclipse) properties dialog for file, and check \"Read only\".\n4) Close dialog\n5) Re-open properties dialog; file is (correctly) marked read only\n6) Uncheck read only\n7) Close dialog\n8) Use Mac \"Get Info\" dialog to verify that file is now not read only\n9) Open properties dialog\n10) Notice that read only is _still_checked_\n11) Uncheck the read only check box (again)\n12) Close and re-open properties dialog\n13) Notice that this time the read only check box _is_not_checked_.\n\nFrom looking at the code quickly, it seems like on the Mac, after the first IResource.setReadOnly(true) \ncall is made IResource.getReadOnly() still returns false. However, the setReadOnly(true) call *did* \nsucceed, and calling setReadOnly(true) a second time, leaves it in a state that getReadOnly() will return \ntrue.\n\nAssigning to Andre, since I believe this is a problem in the Mac C natives.\n",
    "Clearing the readOnly state of a file fails in the native code: \nCoreFileSystemLibrary.setReadOnly(...).\n\nA correct error status is returned but ignored in Resources.setReadOnly:\n\n\tpublic void setReadOnly(boolean readonly) {\n\t\tIPath location \u003d getLocation();\n\t\tif (location !\u003d null)\n\t\t\tCoreFileSystemLibrary.setReadOnly(location.toOSString(), readonly);\n\t}\n",
    "A chmod call fails after immutable flag has been set.\nFix is to swap the order of chmod and chflags calls when readOnly state is cleared.",
    "Created an attachment (id\u003d11865)\npatch for core.c\n",
    " DJ to fix the bug in Resources.setReadOnly described in Comment  #23 and make sure that the patch \nis released.\n\n",
    "Let me know if you want me to release the binary for Mac.",
    "Andre, please release the changes to the library. \n\nSince IResource#setReadOnly doesn\u0027t have a return value or throw an exception,\nwe only have a couple of choices:\n1). throw an unchecked exception\n2). log a message every time\n3). log a message the first time\n\nIf the user is running on a platform in which we don\u0027t ship our natives and they\ntry to make a read-only file read-write, they will come across this situation\neverytime. I will update the code in Resource#setReadOnly to silently log a\nmessage the first time it happens.",
    "Fix and binary released.",
    "Released changes to Resource#setReadOnly.\nWill be included in today\u0027s noon build."
  ],
  "commentCreationDates": [
    "2004-05-11T18:29:42+02:00",
    "2004-05-11T18:41:12+02:00",
    "2004-05-11T19:40:29+02:00",
    "2004-05-11T20:01:21+02:00",
    "2004-05-11T21:29:09+02:00",
    "2004-05-11T21:41:44+02:00",
    "2004-05-11T22:18:26+02:00",
    "2004-05-11T22:20:50+02:00",
    "2004-05-11T22:38:56+02:00",
    "2004-05-11T22:43:13+02:00",
    "2004-05-11T23:08:31+02:00",
    "2004-05-26T21:34:33+02:00",
    "2004-05-26T21:38:28+02:00",
    "2004-05-26T22:09:05+02:00",
    "2004-05-26T22:29:34+02:00",
    "2004-05-26T23:43:28+02:00",
    "2004-06-05T03:08:38+02:00",
    "2004-06-05T03:14:16+02:00",
    "2004-06-06T07:26:46+02:00",
    "2004-06-06T21:51:22+02:00",
    "2004-06-07T15:27:17+02:00",
    "2004-06-08T04:55:10+02:00",
    "2004-06-09T18:13:13+02:00",
    "2004-06-10T14:04:19+02:00",
    "2004-06-10T15:18:13+02:00",
    "2004-06-10T15:22:37+02:00",
    "2004-06-10T15:46:46+02:00",
    "2004-06-10T16:07:12+02:00",
    "2004-06-10T16:43:34+02:00",
    "2004-06-10T16:53:59+02:00",
    "2004-06-10T17:09:30+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.core.internal.resources.ResourceException",
      "message": "Problems encountered while deleting resources.",
      "elements": [
        {
          "method": "org.eclipse.core.internal.resources.Resource.delete",
          "source": "Resource.java:663"
        },
        {
          "method": "org.eclipse.core.internal.resources.Resource.delete",
          "source": "Resource.java:623"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.util.SyncFileWriter.writeFileToBaseDirectory",
          "source": "SyncFileWriter.java:561"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.copyFileToBaseDirectory",
          "source": "EclipseSynch ronizer.java:1274"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseFile$1.run",
          "source": "EclipseFile.java:350"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.run",
          "source": "EclipseSynchronizer.java: 1403"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseResource$2.run",
          "source": "EclipseResource.java:268"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.run",
          "source": "Workspace.java:1559"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseResource.run",
          "source": "EclipseResource.java:265"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseFile.edit",
          "source": "EclipseFile.java:319"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider$9.visitFile",
          "source": "CVSTeamProvider.java:1156"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseFile.accept",
          "source": "EclipseFile.java:154"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider$11.run",
          "source": "CVSTeamProvider.java:1210"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.run",
          "source": "Workspace.java:1559"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider.notifyEditUnedit",
          "source": "CVSTeamProvider.java: 1246"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider.edit",
          "source": "CVSTeamProvider.java:1153"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.EditAction$3.execute",
          "source": "EditAction.java:52"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction",
          "source": "WorkspaceAction.java: 501"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction",
          "source": "WorkspaceAction.java: 510"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.EditAction$2.execute",
          "source": "EditAction.java:50"
        },
        {
          "method": "org.eclipse.ui.actions.WorkspaceModifyOperation$1.run",
          "source": "WorkspaceModifyOperation.java:91"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.run",
          "source": "Workspace.java:1559"
        },
        {
          "method": "org.eclipse.ui.actions.WorkspaceModifyOperation.run",
          "source": "WorkspaceModifyOperation.java:105"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.repo.RepositoryManager.run",
          "source": "RepositoryManager.java:741"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.CVSAction$1.run",
          "source": "CVSAction.java:225"
        },
        {
          "method": "org.eclipse.jface.operation.ModalContext$ModalContextThread.run",
          "source": "ModalContext.java:101"
        }
      ],
      "number": 0,
      "commentIndex": 4,
      "bugId": "61755",
      "date": "2004-05-11T21:29:09+02:00",
      "product": "Platform",
      "component": "Resources",
      "severity": "major"
    },
    {
      "exceptionType": "org.eclipse.core.internal.resources.ResourceException",
      "message": "Problems encountered while deleting resources.",
      "elements": [
        {
          "method": "org.eclipse.core.internal.resources.Resource.delete",
          "source": "Resource.java:663"
        },
        {
          "method": "org.eclipse.core.internal.resources.Resource.delete",
          "source": "Resource.java:623"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.util.SyncFileWriter.writeFileToBaseDirectory",
          "source": "SyncFileWriter.java:561"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.copyFileToBaseDirectory",
          "source": "EclipseSynch ronizer.java:1274"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseFile$1.run",
          "source": "EclipseFile.java:350"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseSynchronizer.run",
          "source": "EclipseSynchronizer.java: 1403"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseResource$2.run",
          "source": "EclipseResource.java:268"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.run",
          "source": "Workspace.java:1559"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseResource.run",
          "source": "EclipseResource.java:265"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseFile.edit",
          "source": "EclipseFile.java:319"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider$9.visitFile",
          "source": "CVSTeamProvider.java:1156"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.EclipseFile.accept",
          "source": "EclipseFile.java:154"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider$11.run",
          "source": "CVSTeamProvider.java:1210"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.run",
          "source": "Workspace.java:1559"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider.notifyEditUnedit",
          "source": "CVSTeamProvider.java: 1246"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.CVSTeamProvider.edit",
          "source": "CVSTeamProvider.java:1153"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.EditAction$3.execute",
          "source": "EditAction.java:52"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction",
          "source": "WorkspaceAction.java: 501"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.WorkspaceAction.executeProviderAction",
          "source": "WorkspaceAction.java: 510"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.EditAction$2.execute",
          "source": "EditAction.java:50"
        },
        {
          "method": "org.eclipse.ui.actions.WorkspaceModifyOperation$1.run",
          "source": "WorkspaceModifyOperation.java:91"
        },
        {
          "method": "org.eclipse.core.internal.resources.Workspace.run",
          "source": "Workspace.java:1559"
        },
        {
          "method": "org.eclipse.ui.actions.WorkspaceModifyOperation.run",
          "source": "WorkspaceModifyOperation.java:105"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.repo.RepositoryManager.run",
          "source": "RepositoryManager.java:741"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.actions.CVSAction$1.run",
          "source": "CVSAction.java:225"
        },
        {
          "method": "org.eclipse.jface.operation.ModalContext$ModalContextThread.run",
          "source": "ModalContext.java:101"
        }
      ],
      "number": 1,
      "commentIndex": 4,
      "bugId": "61755",
      "date": "2004-05-11T21:29:09+02:00",
      "product": "Platform",
      "component": "Resources",
      "severity": "major"
    }
  ],
  "groupId": "61755",
  "bugId": "61755",
  "date": "2004-05-11T18:29:42+02:00",
  "product": "Platform",
  "component": "Resources",
  "severity": "major"
}