{
  "comments": [
    "The CVS Plugin currently only supports the connection types pserver , extssh and ext. These \nrequire an accessible CVS server running either on a UNIX/LINUX machine or a Windows NT machine. \nIt is not possible to set up a CVS server on Windows 98, only local repositories are supported here. \n\nSo on a standalone Windows 98 machine, the whole CVS integration cannot be used.\n\nSo, please \nprovide also access to local repositories.\n\nAdditionally, it would be nice if local \nrepositories could be created from within eclipse, so a separate cvs client would not be needed.",
    "Not in 2.0",
    "It is very unlikely that Eclipse will ever support the local connection method \nsince this method requires the client to also contain an implementation of the \nserver (the cvs command line client executable is the same exectutable that is \nused on the server). The only way this would be possible is if someone \nimplemented a cvs server in Java and made it available as an Eclipse plugin.",
    "I think maybe the implementation-complexity issue is simply that Eclipse\ncurrently expects to manipulate CVS by exchanging commands with a \"cvs server\"\ninstance (whether that is running here or remotely) and it would be extra work\nto achieve local-repository support by directly invoking individual CVS commands\ninstead.\n\nBut that shouldn\u0027t be necessary; I don\u0027t know Windows 98, but does its CVS\nimplementation not even have a \"server\" command?  If it does, then you support a\nlocal repository just by configuring the \"ext command\" to do nothing but run\n\"cvs server\" directly and talk to it.  Doesn\u0027t require setting it up as an\nactual server with an IP port or anything like that.  (I\u0027m assuming Win 98 can\ndo a basic subprocess and pipes.)\n\nFor instance, on a posixlike OS, you can get local access to a repository just\nby setting up the Ext Connection Method preference as:\n\nCVS_RSH:  /bin/sh\nParameters: -c \u0027exec \"$@\"\u0027\nCVS_SERVER: cvs\n\n(In real life it\u0027s harder because of bug 35304; I\u0027ll attach a script I wrote\nthat works for the posixlike case.)\n\nOf course it\u0027s a little hackish to get \"local\" access as a special-case\nconfiguration of :ext: and it would be nice to be able to specify a \"local\"\nconnection method explicitly.  Implementation oughtn\u0027t be hard.\n\nIn the meantime, seeing that the :ext: connection mechanism can be used for\ndifferent types of connections by different configuration choices partly answers\nthe question (bug 5184) of why anybody would want the ext method preferences to\nbe per-connection.",
    "Created an attachment (id\u003d4247)\n:ext: wrapper works around bugs 6892, 35142, 35304\n",
    "Apologize that my attachment is written for Bourne shell and so will not address\nthe original Windows 98 need - but it should illustrate the technique.",
    "*** Bug 22835 has been marked as a duplicate of this bug. ***",
    "*** Bug 64403 has been marked as a duplicate of this bug. ***",
    "of course, standard windows has no cvs command. but, using\nthe cygwin utilities, you can get one. and, using the same utils\nyou can have various shells. knock yourself out.\n\ni too want local repository, and i\u0027m on a unix machine (mac os x).\nmy quick fix was to turn on ssh and pretend to be a remote\nrepository. sigh.",
    "I too wanted to setup Eclipse to use a repository I setup via cygwin.  I \nfollowed the workaround directions listed in this bug, but could not get \nEclipse under Windows to access the repository properly.  \n\nWhat I had to do was use the \":ext: wrapper\" script attached to this bug by \nChapman (thanks btw!).  I then did the following:\n\n1) Install cygwin and make sure to install the cvs module under the Devel node \nduring setup\n2) Make sure your \"PATH\" environment variable in Windows points to \nc:\\cygwin\\bin so Eclipse knows where cvs is.\n3) Download the attached script. For some reason the file contained duplicate \ntext in the script (i.e. the script, followed by \"Content-Type: text/plain\" \nand then a duplicate of the script), so delete everything from the line that \nstates \"Content-Type: text/plain\" (including that line) and save the file.\n4) Rename the script from cvswrap to cvswrap.sh\n5) In Eclipse goto \"Window-\u003ePreferences-\u003eTeam-\u003eCVS-\u003eExt Connection Method\" and \nuse the following settings:\nCVS_RSH: C:\\cygwin\\bin\\sh.exe\nParameters: C:\\cygwin\\bin\\cvswrap.sh\nCVS_SERVER: cvs\n*Of course replace C:\\cygwin with where ever you have cygwin installed\n6) In the CVS Repo Perspective create a new repository and enter the following:\nHost: \u003ctype a space\u003e\nRepository path: \u003ccygwin\u0027ized directory pointing to your cvsroot. \ni.e. /cygdrive/c/cvsroot\u003e\nUser: \u003ctype a space\u003e\nPassword: \u003cleave it blank\u003e\nConnection Type: ext\n\nThat should be it, you should now be able to navigate through your repository \nvia the CVS Repo Perspective and checkout your projects from you local \nrepository.\n",
    "*** Bug 82112 has been marked as a duplicate of this bug. ***",
    "*** Bug 83911 has been marked as a duplicate of this bug. ***",
    "It would also be nice to simply be able to type/paste in a complete CVS\nrepository string, i.e. \"/foo/bar\" from:\n\ncvs -d/foo/bar co xxx\n\n\nThis is handy even for pserver when e.g. connecting to a repository on the web.\nThe entire repository string is frequently available on the web-page.",
    "I would say that providing local CVS repository access is absolutely essential.\n\nIt is very common on UNIX/Linux/cygwin machines to have local CVS repositories,\neven personal ones under /home/\u003cuser\u003e etc. Another very common setup is having a\nrepository on a distributed / networked filesystem that is mounted locally. \n\nPossible workarounds by running local pserver/sshd are not acceptable, since on\na workstation this means running services that would not run otherwise, with the\nrelated security implications.\n\nFrom a design point of view I would say that a proper solution would use an\nexternal CVS mechanism where available (which would solve all sorts of problems,\nincluding, e.g., the ability to copy/paste CVS commands provided as a part of\ndocumentation by many projects), and only if none is available or configured use\na built-in facility, which may reasonably be limited.\n\nMy platform: \nEclipse Version: 3.0.0 Build id: 200406251208 \non Red Hat Enterprise Linux WS release 3 (Taroon Update 3)",
    "Some comments on the wrapper script (Attachment 4247):\n\n1) It worked for me once I followed the instructions in Comment 9 (with the\nappropriate changes as I am on Linux, not Windows - paths etc), and specified\nlocalhost and my username (not spaces as suggested in Comment 9).\n\n2) It is not a good solution though, since as I switch between repositories I\nneed to reconfigure the ext method settings. If I don\u0027t, and if I try to access\na remote repository while the ext method has the \"local\" settings, eclipse\nfreezes and stops reacting to anything.\n\nMy platform: \nEclipse Version: 3.0.0 Build id: 200406251208 \non Red Hat Enterprise Linux WS release 3 (Taroon Update 3)\n\n\n\n",
    "There is currently no plan to address this item",
    "Created an attachment (id\u003d26218)\nwrapper using Windows\u0027 built-in cmd.exe\n\nI\u0027m attaching an alternate script that can be used on Windows.\tFor the\nrepository location, localhost satisfies the requirement that a host be\nspecified.\n\nIn the Ext Connection Method preferences:\n\tCVS_RSH \u003d path to the attached runner.cmd\n\tParameters \u003d a single space character\n\tCVS_SERVER \u003d full path to cvs.exe (ex.: c:\\cygwin\\bin\\cvs.exe\n\nThe obvious drawback is that the cvs.exe still has to support the \"server\"\ncommand itself, so the binaries from cvshome.org won\u0027t work.  Cygwin provides a\nnewer version and their binary does support the \"server\" command.",
    "Ability to access local repository is very important for solo developers and\nalso for training purpose. In fact JBuilder was the most \"CVS user friendly\"\nIDE. It took just a few mins to be up and using the features thanks to the local\nrepository functionality. Since they are moving to Eclipse users of JB are going\nto be left out. \n\nPlease reconsider implementing access to local repository.\n\nIn any case I tried the work arounds being offered here. I tried both the\nscripts with Cygwin on WinXP. But, I get an error each time try to access the\nrepository:\n\n-----------------------------------------------------------------------------\nUnknown response received from cvs server:  \n\norg.eclipse.team.internal.ccvs.core.CVSException: Unknown response received from\ncvs server:  \n\tat\norg.eclipse.team.internal.ccvs.core.client.Request.executeRequest(Request.java:219)\n\tat org.eclipse.team.internal.ccvs.core.client.Command.doExecute(Command.java:404)\n\tat org.eclipse.team.internal.ccvs.core.client.Update.doExecute(Update.java:187)\n\tat org.eclipse.team.internal.ccvs.core.client.Command$1.run(Command.java:323)\n\tat\norg.eclipse.team.internal.ccvs.core.resources.RemoteFolder.run(RemoteFolder.java:457)\n\tat org.eclipse.team.internal.ccvs.core.client.Command.execute(Command.java:335)\n\tat org.eclipse.team.internal.ccvs.core.client.Command.execute(Command.java:785)\n\tat\norg.eclipse.team.internal.ccvs.core.resources.RemoteFolderMemberFetcher.performUpdate(RemoteFolderMemberFetcher.java:102)\n\tat\norg.eclipse.team.internal.ccvs.ui.operations.FetchMembersOperation$InternalRemoteFolderMemberFetcher.performUpdate(FetchMembersOperation.java:69)\n\tat\norg.eclipse.team.internal.ccvs.core.resources.RemoteFolderMemberFetcher.fetchMembers(RemoteFolderMemberFetcher.java:62)\n\tat\norg.eclipse.team.internal.ccvs.core.resources.RemoteFolderMemberFetcher.fetchMembers(RemoteFolderMemberFetcher.java:53)\n\tat\norg.eclipse.team.internal.ccvs.ui.operations.FetchMembersOperation.execute(FetchMembersOperation.java:107)\n\tat\norg.eclipse.team.internal.ccvs.ui.operations.CVSOperation.run(CVSOperation.java:80)\n\tat\norg.eclipse.team.internal.ccvs.ui.model.CVSTagElement.fetchDeferredChildren(CVSTagElement.java:134)\n\tat\norg.eclipse.ui.progress.DeferredTreeContentManager$1.run(DeferredTreeContentManager.java:192)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:76)\n-----------------------------------------------------------------------------\neclipse.buildId\u003dI20050923-1000\njava.version\u003d1.5.0_05\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dwin32, ARCH\u003dx86, WS\u003dwin32, NL\u003den_NZ\nCommand-line arguments:  -os win32 -ws win32 -arch x86\n\n-----------------------------------------------------------------------------\n\nHas this workaround broken 3.1 onwards ?",
    "(In reply to comment #17)\n\u003e Has this workaround broken 3.1 onwards ?\nThe workaround from comment 16 works fine with 3.1 and 3.1.1, but I haven\u0027t\ntried it on a 3.2 build yet.  Are you sure you set up the Ext Connection\npreferences properly including putting a \"space\" in the Parameters text field?",
    "I am sure I followed your instructions correctly.\n\nI subsequently searched the internet for alternatives and I found Subversion\n(new and improved CVS) and Subeclipse (Plug-in for Subversion).\n\nBoth are installed and working wonderfully with Eclipse 3.2M2.\n\nSubversion supports Local and remote repositories and it much much better than\nCVS and CVSNT.\n\nI thought I will note this here for anyone else wanting Local-Repositories.\nCheers",
    "*** Bug 114354 has been marked as a duplicate of this bug. ***",
    "*** Bug 137720 has been marked as a duplicate of this bug. ***",
    "I also believe that local repositories are essential. comment #13 is exactly my opinion (though I\u0027m already running sshd due to similar problems with another application).\n\nIn the meantime, how can the problem be worked around under linux? I tried to set SSH_RSH to /bin/sh or a script with contents \"/bin/sh -c $*\" but neigther works.\n\n(Btw. Bugzilla\u0027s authors say that \"resolved later\" is discouraged. The recomment to leave bugs open and set a target milestone far in future. I share their opinion)",
    "*** Bug 149100 has been marked as a duplicate of this bug. ***",
    "With 3.2 things seem to be worse. There seems to be a new spell checker that\nmakes the workaround of comment #9 unusable :-(. It is no longer possible to enter a space as a user name.\n",
    "Please note that there are some CVS repositories which are simply not available via remote CVS (anonymous or otherwise).  The OpenSSL repository is one such example.  They require the user to rsync their CVS repository to a local copy.  The user can then do local CVS operations on it.",
    "The original report contained two proposals, one to permit direct access to CVS repositories on the local machine, the other for Eclipse to perform CVS services itself. \n\nThe latter looks to me like a big undertaking, and it seems to me that most of the objections have been to that.  However, the former strikes me as being fairly easy to implement.  I also would like Eclipse to be able to use my computer\u0027s CVS service, without having to set up a pserver.\n\nWhat is the difficulty with executing CVS system commands from within Java using Runtime.exec?  The form of the system commands would be slightly different, depending on whether the system is DOS or a unix shell.  Apart from that issue, what is there to do besides\n    \u003cassemble the CVS command\u003e\n    cd \u003cproject-directory\u003e\n    cvs \u003ccvs-command\u003e\n(and report results to user, and handle errors)?\n\nI think that would satisfy my present needs.",
    "What you are suggesting would be possible. However, it would be impractical to add the behavior to the existing CVS plug-ins since a lot of the functionality would not be possible to achieve using the cvs executable (e.g. the repository explorer). What you could do is write an alternate plug-in that delegated CVS operations to the executable.",
    "Created an attachment (id\u003d67062)\nBash shell script for wrapping local/remote CVS execution\n\n",
    "Created an attachment (id\u003d67063)\nDOS batch script for wrapping local/remote CVS execution\n\n",
    "I think that this should be resolved by creating a new \u0027Local\u0027 connection method, which instead of a CVS_RSH parameter would take a SHELL parameter which one can use to specify the shell being executed (e.g. \u0027/bin/sh\u0027 under *nix, cmd.exe under Windows); otherwise it should take CVS_SERVER as the \u0027Ext\u0027 method but \"of course\" no username nor password. When this method is selected, the shell is executed instead of the CVS_RSH command.\n\nAs a workaround, I have created two shell scripts that mimics the parameters accepted by the ssh/plink command (\"-l {user} {host}\"), but which executes in a local shell if the username is the one of the interactive user and hostname is \"localhost\". Set CVS_RSH to the path of this script.\n\nThus, it can be used to browse both local and remote repositories without having to switch the Ext connection method everytime one desires to see another repository. It seems to work under my Ubuntu workstation, but I haven\u0027t tried Windows (yet).\n\nCaveat emptor!",
    "A local CVS repository is easy on Unix systems. If an ssh-server is running (accepting only local connections), and the usual cvs-command line command is installed, then just point Eclipse towards localhost, using extssh as the connection method.\n\nWindows however ... :-/\n"
  ],
  "commentCreationDates": [
    "2001-12-13T15:17:02+01:00",
    "2002-03-01T22:36:44+01:00",
    "2002-09-09T01:53:20+02:00",
    "2003-03-19T18:15:27+01:00",
    "2003-03-19T19:18:12+01:00",
    "2003-03-19T19:19:57+01:00",
    "2003-10-09T16:39:08+02:00",
    "2004-05-27T19:58:34+02:00",
    "2004-10-25T23:41:15+02:00",
    "2004-11-30T18:24:24+01:00",
    "2005-01-04T01:57:23+01:00",
    "2005-01-28T14:13:35+01:00",
    "2005-01-28T14:19:10+01:00",
    "2005-05-17T15:58:01+02:00",
    "2005-05-17T16:31:07+02:00",
    "2005-05-31T20:24:52+02:00",
    "2005-08-18T04:30:49+02:00",
    "2005-10-17T00:33:05+02:00",
    "2005-10-17T04:59:10+02:00",
    "2005-10-17T08:59:32+02:00",
    "2005-10-31T13:44:35+01:00",
    "2006-04-20T16:03:23+02:00",
    "2006-04-26T23:08:41+02:00",
    "2006-06-29T14:14:06+02:00",
    "2006-07-11T10:45:15+02:00",
    "2007-01-11T21:35:28+01:00",
    "2007-02-25T12:13:02+01:00",
    "2007-02-26T13:05:59+01:00",
    "2007-05-14T16:29:56+02:00",
    "2007-05-14T16:30:49+02:00",
    "2007-05-14T16:37:51+02:00",
    "2007-06-27T21:45:26+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.team.internal.ccvs.core.CVSException",
      "message": "Unknown response received from cvs server:",
      "elements": [
        {
          "method": "org.eclipse.team.internal.ccvs.core.client.Request.executeRequest",
          "source": "Request.java:219"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.client.Command.doExecute",
          "source": "Command.java:404"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.client.Update.doExecute",
          "source": "Update.java:187"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.client.Command$1.run",
          "source": "Command.java:323"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.RemoteFolder.run",
          "source": "RemoteFolder.java:457"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.client.Command.execute",
          "source": "Command.java:335"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.client.Command.execute",
          "source": "Command.java:785"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.RemoteFolderMemberFetcher.performUpdate",
          "source": "RemoteFolderMemberFetcher.java:102"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.operations.FetchMembersOperation$InternalRemoteFolderMemberFetcher.performUpdate",
          "source": "FetchMembersOperation.java:69"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.RemoteFolderMemberFetcher.fetchMembers",
          "source": "RemoteFolderMemberFetcher.java:62"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.core.resources.RemoteFolderMemberFetcher.fetchMembers",
          "source": "RemoteFolderMemberFetcher.java:53"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.operations.FetchMembersOperation.execute",
          "source": "FetchMembersOperation.java:107"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.operations.CVSOperation.run",
          "source": "CVSOperation.java:80"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.model.CVSTagElement.fetchDeferredChildren",
          "source": "CVSTagElement.java:134"
        },
        {
          "method": "org.eclipse.ui.progress.DeferredTreeContentManager$1.run",
          "source": "DeferredTreeContentManager.java:192"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:76"
        }
      ],
      "number": 0,
      "commentIndex": 17,
      "bugId": "6892",
      "date": "2005-10-17T00:33:05+02:00",
      "product": "Platform",
      "component": "Team",
      "severity": "enhancement"
    }
  ],
  "groupId": "6892",
  "bugId": "6892",
  "date": "2001-12-13T15:17:02+01:00",
  "product": "Platform",
  "component": "Team",
  "severity": "enhancement"
}