{
  "comments": [
    "Why do you have to install GTK on the server where I want to start the\nstand-alone help system. As I read in the documentation it is a web application\nrunning in a modified version of Tomcat. So why does the system need GTK installed?\n\nIs there a switch to turn of this dependance? My server does not have a\ngraphical user interface, so no GTK installed!",
    "One of the reasons might be that the default help browser adapter on Linux is \nand SWT window with an embedded Browser widget (using Mozilla).\nIf your server does not have GUI, why would you run stand-alone help on it?  \nYou could run infocenter instead.  If it does not work, could you add what \ndoes not work - what errors are reported?\nKonrad",
    "I tried to install the Infocenter. \n\nFirst I tried to generate the index for the different language versions of my \nhelp. This already stopped with an exception because the indexTool could not \nfind the GTK lib.\n\nThen I thought maybe the Infocenter itself will run without GTK. But that also \nwants to have GTK installed.\n\nI tried the Motif version and that runs without special installation of a window \nmanager or system.",
    "My infocenter call\n\nThis command line I tried:\njava -classpath plugins/org.eclipse.help.base_3.0.0/helpbase.jar\n org.eclipse.help.standalone.Infocenter -command start -port 8086\n\nand that is the error message I got:\n/var/tmp/1/eclipse/eclipse: error while loading shared libraries: libgtk-x11-2.0\n.so.0: cannot open shared object file: No such file or directory\n",
    "You must add -noexec option to your command, as \"eclipse\" executable are built \nfor specific platforms.",
    "I called this now:\n\njava -classpath plugins/org.eclipse.help.base_3.0.0/helpbase.jar\n org.eclipse.help.standalone.Infocenter -command start -port 8086 -noexec\n\nand got following exception:\n\njava.lang.Exception: Unknown exception.\n        at org.eclipse.help.internal.standalone.Eclipse.run(Eclipse.java:121)\n\nAlso the documentation which I found here \n\nhttp://dev.eclipse.org/viewcvs/index.cgi/~checkout~/org.eclipse.platform.doc.isv\n/reference/misc/help_infocenter.html?rev\u003dHEAD\u0026content-type\u003dtext/html\u0026only_with_t\nag\u003dR3_0\n\nis not correct for the Motif version of the infocenter. The list in \nthe paragraph \"[Optional] Installing a minimal set of plug-ins\" is incomplete. I \ndid not find out which plugin has to stay in the plugins directory but when I \ndelete all others except them in the list then Eclipse does not start at all.\n",
    "I do not have a machine without GTK installed.  The error indicates that \nsystem launching of eclipse process (the second VM process launched by the \nfirst VM with the Infocenter class ) failed.  Please check for error logs in \nthe workspace and configuration directories.  If they are not there, ensure \nthere is not an infocenter started already and running with the same port or \nworkspace, or an error in your command.\n\nLaunching of the minimal subset of motif build (my eclipse directory has only \nstartup.jar and plugins directory with the 10 plug-ins listed) works well for \nme.  In fact this subset is common between motif and gtk builds.\n\n",
    "See bug 72690 for related problem.\n\nCan you try running infocenter using just the minimal set of plug-ins:\norg.apache.ant\norg.apache.lucene\norg.eclipse.core.runtime\norg.eclipse.help\norg.eclipse.help.appserver\norg.eclipse.help.base\norg.eclipse.help.webapp\norg.eclipse.osgi\norg.eclipse.tomcat\norg.eclipse.update.configurator\n\nwithout any UI plugins?\nThanks.",
    "Bug 73111 has been fixed in runtime.  It should get you going again when \nhaving all plug-ins installed.\nI am marking the bug as fixed.  Please reopen if you continue to see problems."
  ],
  "commentCreationDates": [
    "2004-08-23T12:00:10+02:00",
    "2004-08-23T19:39:20+02:00",
    "2004-08-24T09:20:21+02:00",
    "2004-08-24T09:51:02+02:00",
    "2004-08-24T19:54:07+02:00",
    "2004-08-25T11:36:56+02:00",
    "2004-08-25T23:03:49+02:00",
    "2004-09-02T01:07:21+02:00",
    "2004-09-08T21:15:51+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.Exception",
      "message": "Unknown exception.",
      "elements": [
        {
          "method": "org.eclipse.help.internal.standalone.Eclipse.run",
          "source": "Eclipse.java:121"
        }
      ],
      "number": 0,
      "commentIndex": 5,
      "bugId": "72419",
      "date": "2004-08-25T11:36:56+02:00",
      "product": "Platform",
      "component": "User Assistance",
      "severity": "normal"
    }
  ],
  "groupId": "72419",
  "bugId": "72419",
  "date": "2004-08-23T12:00:10+02:00",
  "product": "Platform",
  "component": "User Assistance",
  "severity": "normal"
}