{
  "comments": [
    "1. In the desired package, create a new Visual Class\n\n2. In the \"New Java Visual Class\" dialog, enter the name of the new class. In\nthe Style tree, under Swing, select Frame (this will set the superclass to\n\"javax.swing.JFrame\".\n\n3: Make sure that the \"main\" checkbox is checked and that the \"inherited\nabstract methods\" checkbox is checked.\n\n4: Click on \"finish\".\n\nResult:\n\n   The resulting visual component generation is unusable. The visual editor\ndisplay is blank. There is no component tree generated in the Java Beans window\n(in other words, no JFrame or Content Pane appears, either in the visual editor\nor in the Java Beans window). \n\n   The code exists and is editable (though main is empty; it would be nice if\nyou\u0027d put the minimum amount of code in that method to display the\napplication!). An initialize() method is created, as is a getContentPane()\nmethod. The application operates properly (provided proper code is entered by\nhand into the main() method).\n\n   While the application itself works, the visual editor does not operate\nproperly. There is no way to add copmponents visually to the application. The\nJPanel that is the content pane, when selected, displays only one property:\nname. This property cannot be edited. The JPanel displays plenty of properties,\nbut its properties also cannot be edited.\n\n   Attempts to add components to the application fail. When a component is added\nin the visual editor, code for creating it is added, but there is no code\nlinking the new component to the content pane. The component itself appears in\nthe Java Beans window and in the Visual Editor, but the component is not linked\nin any way to the content pane. Worse, while you can edit the component in the\nvisual editor (not always; the component often disappears from the visual\neditor!), changes to its properties are not reflected in the code. In fact, I\nhave often seen a tooltip message saying \"round trip is disabled\" while editing\na component, and the component won\u0027t appear in the running application even when\nI add it to the context pane by hand.\n\n   There are other problems, but what I have reported here is sufficient for\nnow. The way this system is behaving makes this \"Visual Editor\" unusable.\nFrankly, I am amazed and disappointed that you people would release such a non-\nfunctioning system.\n\n   I await a fix to this problem with great interest...\n\n-Robert Brown III",
    "Robert,\nWhat you have described here is definitely an \"unusable visual editor\" and we\ncertainly wouldn\u0027t have released it in such a state had there been as many\nproblems as you have experienced.\n\nSo it must have something to do with your setup and environment. Could you\nplease provide more information so I can help analyze and solve the problem.\n- What build levels of Eclipse, EMF, GEF, and VE do you have installed?\n- Did you start with a brand new workspace or use an existing workspace?\n- Is there any information in the .log file that would help debug the problem?\n  If so... please create and attachment.\n- When the Visual Editor is opened, is there a slide-out palette visible on the   \n  right side of the graph viewer?\n- Do you have the EMF examples installed?\n  If so... please uninstall the EMF examples so VE can work properly.",
    "- What build levels of Eclipse, EMF, GEF, and VE do you have installed?\nI have Eclopse 3.0.1 installed, along with the following plugins (taken from \nmy plugin list):\n\n1. The EMF itself (Version 2.0.1)\n2. EMF Programming Guide and Source (Both Version 2.0.1)\n3: EMF Service Data Objects (SDO) Version 2.0.1)\n4: SDO Programmer\u0027s Guide and Source (Both components: Version 2.0.1)\n5: Java EMF Model (JEM? Version 1.0.1)\n6: Java EMF Model SDK (Version 1.0.1)\n\n7: Visual Editor (Version 3.0.1)\n8: Visual Editor SDK (Version 3.0.1)\n9: Visual Editor Source (Version 3.0.1)\n10: Graphical Editing Framework (GEF? Version 3.0.1)\n11: Graphical Editing Framework Developer Resources (Version 3.0.1)\n\n\n- Did you start with a brand new workspace or use an existing workspace?\n\nI started up a brand new workspace, specifically to test the Swing creation.\n\n- Is there any information in the .log file that would help debug the problem?\n  If so... please create and attachment.\n\nI do not know. Which .log file? Where is it???\n\n- When the Visual Editor is opened, is there a slide-out palette visible on \nthe right side of the graph viewer?\n\nYes. I use the palette pretty heavily.\n\n- Do you have the EMF examples installed?\n\nNot to my knowledge, unless one of the EMF plugins I mentioned above has these \nexamples you mention.\n\n",
    "Robert, from what you have listed here, the plugin levels look fine and I don\u0027t\nsee the EMF examples in your list either (which is good!).\nThere must be something else wrong. Something I forgot to ask is:\nWhat JDK level are you using? The minimal is JDK 1.4.2.\n\nAlso the .log file often contains error information for Eclipse and VE when\nthings don\u0027t work correctly in Eclipse workspaces. This is located in your\nworkspace_dir\\.metadata directory. Please create an attachment for the .log file\nand attach it to this bug.  Thanks...",
    "I\u0027ve seen the same problem in my installation under similar testing \ncircumstances. Here\u0027s the error from the .log file:\n\n!ENTRY org.eclipse.ve.java.core 4 0 Oct 05, 2004 15:49:05.536\n!MESSAGE Exception thrown.\n!STACK 0\njava.lang.ClassCastException\n\tat \norg.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.createJavaInstan\nces(JavaSourceTranslator.java:705)\n\tat \norg.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.buildComposition\nModel(JavaSourceTranslator.java:774)\n\tat \norg.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.decodeDocument\n(JavaSourceTranslator.java:881)\n\tat \norg.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.loadModel\n(JavaSourceTranslator.java:656)\n\tat \norg.eclipse.ve.internal.java.codegen.editorpart.JavaVisualEditorPart$Setup.run\n(JavaVisualEditorPart.java:1444)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:66)\n\nI\u0027m running Windows XP Pro/j2sdk1.4.2_05/Eclipse3.0.1 with latest VE and \nsupporting components installed from Help/Software Updates",
    "About comment 5, Steve, your\u0027s is definitly due to having EMF Examples\ninstalled. They have a conflict with us and we have not released the fix yet. So\nplease uninstall the EMF examples and see if it works.",
    "Comment 4 not 5. Seesh I can\u0027t even type that right! :-)",
    "Removing EMF examples solved this problem for me. I have other problems, but \nwill scan the bug list and add comments or enter new bugs as appropriate.",
    "Created an attachment (id\u003d15107)\nLog file for attempt to open the Eclipse VE\n\nGreetings:\n\n   Attached is the desired .log file, as requested. It has some interesting\nClassNotFound exceptions when accessing classes within the VE...",
    "The log file is attached, as requested. Also please note: the JDK that I am \nusing is 1.4.2\n\n-Robert\n",
    "Did you install the new Eclipse Webtools project? If you did, that version of\nWTP is old and only works with Eclipse 3.0.0 and is incompatible with the latest\nVE. It was dropped right in the middle of the VE development and we\u0027ve changed\ndrastically since then. If you have, you need to uninstall it and then reinstall\nVE to get the correct version of WTP commen features.",
    "How do I uninstall a plugin? Which of the directories in this particular \nplugin do I need to remove?\n",
    "The easiest way is to do a clean install of everything except WTP tools.\nOtherwise you need to unzip the original wtp zip and see what features and\nplugins are in there, then remove those from the eclipse installation and then\nreinstall the VE and then start with the -clean option once.            ",
    "I have reinstalled just about everything; I removed Eclipse, reinstalled it, \nput EMF, VE, and GEF back in, and attempted to create a new Swing application.\n\nThe Visual Editor is generating the following error:\n\nAn internal error occurred during: \"Setup Java Visual Editor\".\njava.lang.NoClassDefFoundError: com/ibm/wtp/common/util/TimerTests\norg.eclipse.ve.internal.java.codegen.editorpart.JavaVisualEditorPart$Setup.run\n(JavaVisualEditorPart.java:1391)\norg.eclipse.core.internal.jobs.Worker.run(Worker.java:66)\n\nand the editor is not loading.\n\nNote please: I did not explicitely install WTP. Where is it coming from???\n",
    "I have discovered a few things:\n\nI have been installing the VE Runtime, (VE-runtime-1.0.zip) which contasins \nthe following plugins:\n\n1. com.ibm.wtp.common.util_1.0.1\n2. com.ibm.wtp.emf.workbench_1.0.1\n\nAre these the correct versions for these plugins? If so, then one of them is \napparently missing a class or three, because of the error that I get when \ntrying to load an application into the VE. This error was recorded before, but \nis repeated here for convenience:\n\nAn internal error occurred during: \"Setup Java Visual Editor\".\njava.lang.NoClassDefFoundError: com/ibm/wtp/common/util/TimerTests\norg.eclipse.ve.internal.java.codegen.editorpart.JavaVisualEditorPart$Setup.run\n(JavaVisualEditorPart.java:1391)\norg.eclipse.core.internal.jobs.Worker.run(Worker.java:66)\n\nBased on the above, I suspect that there is a bug in the deployment of your VE \nruntime.\n\nAre my suspicions correct? Where can I find the correct wtp plugins?",
    "I don\u0027t know what\u0027s going on. I just took a look in that zip file. The class\nexists in the util.jar in com.ibm.wtp.common.util_1.0.1. \n\nI took that exact zip and created a brand new install of Eclipse, GEF, EMF, and\nVE and it worked.\n\n1) What is the date/time/size of this jar (util.jar) on your system?\n\n2) Try starting once with the -clean option.\n\n3) Your original append said you had the SDK (see comment 2), your last append\nsaid you had the runtime? Did you install a different one the last time versus\nthe first time?\n\n\nAs for WTP, we ship those two wtp features within VE. The Eclipse Web tools had\nan older version. Since you don\u0027t have the older version installed there is\nsomething wrong with what you have.",
    "Created an attachment (id\u003d15121)\nLog generated when I attempted to do an eclipse -clean\n\nWhen I attempted to do an eclipse -clean, I got an error message that referred\nme to a log file in the config directory. That file is now attached.\n",
    "1. I am presuming that the util.jar file you are referring to is the one in \ncom.ibm.wtp.common.util_1.0.1. That file is dated 9/19/2004. Its size is 33k.\n\n2. It is interesting that your installation works (though not surprising); I \nsuspect that what you are using and what I am downloading are not the same \nthing.\n\nIn order to simplify things, I did not seek the SDKs. I *erased* my previous \neclipse installation. I cleaned out the entire eclipse directory, eliminated \neverything in the wastebasket, then installed the 3.0.1 distribution. For \nsimplicity\u0027s sake, after installing eclipse I went with all runtimes:\n\nVE-runtime-1.0.zip\nGEF-runtime-3.0.1.zip\nemf-sdo-runtime-2.0.1.zip\n\nThese are the only things I installed after Eclipse.\n\nMy attempts to load the VE for a Swing application generated the error I \nmentioned before. I find it significant that the error is a \nNoClassDefFoundException, which indicates that at least one class is missing \nfrom whatever is supposed to be in com.ibm.wtp.common.util_1.0.1.\n\nWhat is really weird, though, is that I looked inside the util.jar file. The \nclass which is supposedly missing (TimerTests.class) is actually in that jar \nfile(!) in exactly the path where it is supposed to be \n(com.ibm.wtp.common.util). Could it be that the util.jar file is not being \nproperly loaded? Or does some other plugin also have a util.jar file that \ncontains different classes and is being loaded instead of this one?\n\nI will be looking into this possibility.\n\n3. I attempted to do an eclipse -clean, only to find more errors. These are in \na new attachment which I have added to this bug report.\n\n\n",
    "About comment 16. I noticed that one was started with 1.3.1 JDK.\n\n!SESSION Oct 12, 2004 11:48:55.750 ---------------------------------------------\neclipse.buildId\u003dM200409161125\njava.version\u003d1.3.1_01\njava.vendor\u003dSun Microsystems Inc.\nBootLoader constants: OS\u003dwin32, ARCH\u003dx86, WS\u003dwin32, NL\u003den_US\n\n\nThat is why the clean failed. Try again using your 1.4.2 (by the way is that Sun\nor IBM 1.4.2?)",
    "I apparently have 2 JDKs on my system; unfortunately, I need both of them.\nApparently, my latest installation is using the wrong JRE for some reason (it \nwasn\u0027t in my previous installation).\n\nHow do I setup eclipse to use the one that I want???\n\nAnd by the way: the JDK I am using is Sun\u0027s 1.4.2 JDK.\n\n",
    "eclipse.exe -vm x:/xyz/jre/bin/javaw.exe\n\nThe -vm argument tells what java to use.",
    "I have performed the following:\n\neclipse -clean -vm C:\\jsdk14\\bin\\javaw.exe\n\nThis has changed nothing. Eclipse is still failing to find the TimerTests \nclass.\n\nFurthermore, as I suspected, I have found another util.jar file. It is in a \nplugin directory called org.eclipse.osgi.util_3.0.0. It contains a whole other \nset of classes, different from the ones used by the WTP plugin.\n\nQuestion: is this plugin necessary? If it is, then is it possible to change \nthe jar file and clear up the name clash I am seeing?\n",
    "No, I have the same jar and I don\u0027t have that problem.\n\nWould you mind trying something? Can you zip up your entire eclipse directory,\nincluding the features and plugins directory? That way I can take a look at it\nand see if there is anything strange about it. Don\u0027t attach to bugzilla, just\nsend it to me at richkulp@us.ibm.com\n\nThanks.",
    "Problem was that there was installed another product which had released its own\ncopy of com.ibm.wtp.common.util, but they had made it 1.0.3. But they had picked\nup a pre-final release version of 1.0.1 and this version did not have TimerTests\nin it. Because it was labeled 1.0.3, it was treated as an uplevel version of the\nplugin, but it really wasn\u0027t.",
    "Closing now."
  ],
  "commentCreationDates": [
    "2004-10-07T00:21:35+02:00",
    "2004-10-07T16:41:44+02:00",
    "2004-10-08T21:43:54+02:00",
    "2004-10-11T15:27:03+02:00",
    "2004-10-11T16:38:02+02:00",
    "2004-10-11T17:05:09+02:00",
    "2004-10-11T17:05:49+02:00",
    "2004-10-11T17:23:35+02:00",
    "2004-10-12T13:21:17+02:00",
    "2004-10-12T13:22:27+02:00",
    "2004-10-12T15:37:58+02:00",
    "2004-10-12T15:41:50+02:00",
    "2004-10-12T15:52:43+02:00",
    "2004-10-12T16:54:17+02:00",
    "2004-10-12T17:11:30+02:00",
    "2004-10-12T17:54:03+02:00",
    "2004-10-12T18:04:06+02:00",
    "2004-10-12T18:25:52+02:00",
    "2004-10-12T18:36:51+02:00",
    "2004-10-12T18:45:58+02:00",
    "2004-10-12T18:58:16+02:00",
    "2004-10-12T19:06:04+02:00",
    "2004-10-12T20:01:25+02:00",
    "2004-10-27T17:58:02+02:00",
    "2004-10-27T17:58:17+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.ClassCastException",
      "elements": [
        {
          "method": "org.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.createJavaInstances",
          "source": "JavaSourceTranslator.java:705"
        },
        {
          "method": "org.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.buildCompositionModel",
          "source": "JavaSourceTranslator.java:774"
        },
        {
          "method": "org.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.decodeDocument",
          "source": "JavaSourceTranslator.java:881"
        },
        {
          "method": "org.eclipse.ve.internal.java.codegen.core.JavaSourceTranslator.loadModel",
          "source": "JavaSourceTranslator.java:656"
        },
        {
          "method": "org.eclipse.ve.internal.java.codegen.editorpart.JavaVisualEditorPart$Setup.run",
          "source": "JavaVisualEditorPart.java:1444"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:66"
        }
      ],
      "number": 0,
      "commentIndex": 4,
      "bugId": "75751",
      "date": "2004-10-11T16:38:02+02:00",
      "product": "VE",
      "component": "JFC/Swing",
      "severity": "blocker"
    }
  ],
  "groupId": "75751",
  "bugId": "75751",
  "date": "2004-10-07T00:21:35+02:00",
  "product": "VE",
  "component": "JFC/Swing",
  "severity": "blocker"
}