{
  "comments": [
    "I do not know for certain if this is really a bug or a miss in my setup. However, I hava done enough \nexperimentation that I feel I may bring the problem to the attention of someone more knowledgeable.\n\n\u003d\u003d\u003d\u003d\u003d Thu Nov 25 2004 \u003d\u003d\u003d\u003d\u003d 11:25:16 Europe/Amsterdam \u003d\u003d\u003d\u003d\u003d\nDescription of a problem in generating (SWT-)applications on the Macintosh.\n\nThis is Eclipse 3.1M3 running on Macintosh G5 MacOSX 10.3.6.\nThe project to be exported runs normally when run in Eclipse as JavaApplication.\nAfter \"Eclipse\u003eExport\u003eMac OS X application bundle\u003eFinish\" an application folder Application.app is \ngenerated with in it the following items:\n    Contents\n    (a) MacOS (empty)\n    (b) PkgInfo (APPL????)\nAfter that the following exception occurs; in the stack trace is no further indication given as to the \ncause of the exception:\t\t\njava.io.IOException\n\tat org.eclipse.jdt.internal.ui.macbundler.BundleBuilder.createBundle(BundleBuilder.java:53)\n\tat org.eclipse.jdt.internal.ui.macbundler.MacBundleWizard.performFinish(MacBundleWizard.java:\n65)\n\tat org.eclipse.jface.wizard.WizardDialog.finishPressed(WizardDialog.java:670)\n\tat org.eclipse.jface.wizard.WizardDialog.buttonPressed(WizardDialog.java:342)\n             .... many intermediate steps ....\n\tat org.eclipse.core.launcher.Main.run(Main.java:704)\n\tat org.eclipse.core.launcher.Main.main(Main.java:688)\n\nSpitting in the sources.\nSource of BundleBuilder.java in macosxlaunchingsrc.zip in \norg.eclipse.jdt.source.macosx.carbon.ppc_3.1.0 in Eclipse plugins directory. The source sows that not \na launcher_path is present:\n50:\t\tFile macos_dir\u003d createDir(contents_dir, \"MacOS\", false);\n\t//$NON-NLS-1$\n51:\t\tString launcher_path\u003d bd.get(LAUNCHER);\n52:\t\tif (launcher_path \u003d\u003d null)\n53:\t\t\tthrow new IOException();\nMet in BundleAttributes.java:\n17:\tstatic final String LAUNCHER \u003d \"CFBundleExecutable\"; //$NON-NLS-1$\nThis CFBundleExecutable appears to be the \"JavaApplicationStub\".\n\nWHERE DO I SPECIFY THIS ONE??? In the export wizard I see nothing of this kind. Or is something else \namiss? Is this some problem or error in the Eclipse 3.1M3 for MacOSX release?\n\nFurther experimenting that has been done:\n(1) generate the jar-file with the Eclipse Jar-Exporter wizard.\n(2) generate appliacation with Apple\u0027s \"Jar Bundler\".\nThen it is possible to get something running (after a little fiddling with the System property \n\"java.library.path\") but what runs is flaky, the GUI elements are unstable and the application often \ncrashes. For example, leaving out \t\t \u003ckey\u003eapple.laf.useScreenMenuBar\u003c/key\u003e\u003cstring\u003etrue\u003c/\nstring\u003e immediately crashes.\n\nWell, I think that having Eclipse generating the Application does something not understood be me. But \nhow to get around the BundleBuilder error ....?\n\nBelow the tweeked Info.plist that brought me this far:\n\u003c?xml version\u003d\"1.0\" encoding\u003d\"UTF-8\"?\u003e\n\u003c!DOCTYPE plist SYSTEM \"file://localhost/System/Library/DTDs/PropertyList.dtd\"\u003e\n\u003cplist version\u003d\"0.9\"\u003e\n\u003cdict\u003e\n\t\u003ckey\u003eCFBundleName\u003c/key\u003e\n\t\u003cstring\u003eRunner\u003c/string\u003e\n\t\u003ckey\u003eCFBundleVersion\u003c/key\u003e\n\t\u003cstring\u003e1.0\u003c/string\u003e\n\t\u003ckey\u003eCFBundleAllowMixedLocalizations\u003c/key\u003e\n\t\u003cstring\u003etrue\u003c/string\u003e\n\t\u003ckey\u003eCFBundleExecutable\u003c/key\u003e\n\t\u003cstring\u003eJavaApplicationStub\u003c/string\u003e\n\t\u003ckey\u003eCFBundleDevelopmentRegion\u003c/key\u003e\n\t\u003cstring\u003eEnglish\u003c/string\u003e\n\t\u003ckey\u003eCFBundlePackageType\u003c/key\u003e\n\t\u003cstring\u003eAPPL\u003c/string\u003e\n\t\u003ckey\u003eCFBundleSignature\u003c/key\u003e\n\t\u003cstring\u003eHvdM\u003c/string\u003e\n\t\u003ckey\u003eCFBundleInfoDictionaryVersion\u003c/key\u003e\n\t\u003cstring\u003e6.0\u003c/string\u003e\n\t\u003ckey\u003eCFBundleIconFile\u003c/key\u003e\n\t\u003cstring\u003erunner.icns\u003c/string\u003e\n\t\u003ckey\u003eJava\u003c/key\u003e\n\t\u003cdict\u003e\n\t\t\u003ckey\u003eMainClass\u003c/key\u003e\n\t\t\u003cstring\u003eRunner\u003c/string\u003e\n\t\t\u003ckey\u003eJVMVersion\u003c/key\u003e\n\t\t\u003cstring\u003e1.4+\u003c/string\u003e\n\t\t\u003ckey\u003eArguments\u003c/key\u003e\n\t\t\u003cstring\u003eThese are the arguments\u003c/string\u003e\n\t\t\u003ckey\u003eClassPath\u003c/key\u003e\n\t\t\t\u003carray\u003e\n\t\t\t\u003cstring\u003e$JAVAROOT/runner.jar\u003c/string\u003e\n\t\t\t\u003cstring\u003e$JAVAROOT/swt.jar\u003c/string\u003e\n\t\t\t\u003cstring\u003e$JAVAROOT/swt-pi.jar\u003c/string\u003e\n\t\t\t\u003cstring\u003e$JAVAROOT/libswt-carbon-3111.jnilib\u003c/string\u003e\n\t\t\t\u003cstring\u003e$JAVAROOT/libswt-pi-carbon-3111.jnilib\u003c/string\u003e\n\t\t\t\u003c/array\u003e\n\t\t\u003ckey\u003eProperties\u003c/key\u003e\n\t\t\u003cdict\u003e\n\t\t\t\u003ckey\u003eapple.laf.useScreenMenuBar\u003c/key\u003e\n\t\t\t\u003cstring\u003etrue\u003c/string\u003e\n\t\t\t\u003ckey\u003ejava.library.path\u003c/key\u003e\n\t\t\t\u003cstring\u003e.:$JAVAROOT/libswt-carbon-3111.jnilib:$JAVAROOT/libswt-pi-carbon\n-3111.jnilib:$JAVAROOT/libswt-webkit-carbon-3111.jnilib:/Library/Java/Extensions:/System/Library/\nJava/Extensions:/usr/lib/java\u003c/string\u003e\n\t\t\u003c/dict\u003e\n\t\u003c/dict\u003e\n\u003c/dict\u003e\n\u003c/plist\u003e\n\nThe java files I used are the following two:\n/* File: Runner.java\n * Created on Sep 23, 2004 at 4:52:22 PM by hans. */\n\n/**\n * @author Hans van der Meer\n * @version 1.0 Class for dummy plugin.\n *          \u003cp\u003e\n *          Runs the class/classes created in \u003ccode\u003emain\u003c/code\u003e.\n */\npublic class Runner {\n\n/**\n * @param args The arguments on the command line.\n */\npublic static void main(String[] args)\n{\n\tSystem.err.println(\"Starting Runner Application\");\n\tif (args.length \u003e 0)\n\t{\n\t\tSystem.err.print(\"Arguments:\");\n\t\tfor (int i \u003d 0; i \u003c args.length; i++)\n\t\t\tSystem.err.print(\" \" + args[i]);\n\t\tSystem.err.println();\n\t}\n\tnew ButtonShell();\n\tSystem.err.println(\"Quitting Runner Application\");\n}\n}\n\nimport org.eclipse.swt.SWT;\nimport org.eclipse.swt.widgets.*;\nimport org.eclipse.swt.events.*;\nimport org.eclipse.swt.graphics.*;\n\n/* File: ButtonShell.java\n * Created on Nov 19, 2004 at 12:58:58 PM by hans.\n */\n\n/**\n * @author Hans van der Meer\n * @version $Id$\n */\npublic class ButtonShell {\n\nfinal ProgressBar progressBar;\n\n/** Constructor. */\npublic ButtonShell()\n{\n\tDisplay display \u003d new Display();\n\tShell shell \u003d new Shell(display);\n\tshell.setSize(500, 400);\n\tshell.setLocation(300, 300);\n\tshell.setText(\"Button demo\");\n\n\tfinal Button button1 \u003d new Button(shell, SWT.PUSH);\n\tbutton1.setBounds(50, 50, 100, 40);\n\tbutton1.setText(\"Click Me\");\n\tbutton1.addSelectionListener(new SelectionAdapter() {\n\n\t\tpublic void widgetSelected(SelectionEvent event)\n\t\t{\n\t\t\tfinal ProgressBar bar \u003d getProgressBar();\n\t\t\tint newValue \u003d bar.getSelection() + 10;\n\t\t\tif (newValue \u003e 100)\n\t\t\t{\n\t\t\t\tnewValue \u003d 100;\n\t\t\t\t((Button)event.getSource()).setEnabled(false);\n\t\t\t}\n\t\t\tbar.setSelection(newValue);\n\t\t}\n\t});\n\tFont button1Font \u003d button1.getFont();\n\tFontData[] fontdata \u003d button1Font.getFontData();\n\tSystem.err.println(\"button font: \" + fontdata[0].getName() + \" at size \"\n\t\t+ fontdata[0].getHeight());\n\tbutton1.setFont(new Font(display, fontdata[0].getName(), 14, SWT.BOLD\n\t\t| SWT.ITALIC));\n\n\tprogressBar \u003d new ProgressBar(shell, SWT.HORIZONTAL);\n\tprogressBar.setMinimum(0);\n\tprogressBar.setMaximum(100);\n\tprogressBar.setSelection(0);\n\tprogressBar.setBounds(50, 120, 200, 20);\n\n\tshell.open();\n\twhile (!shell.isDisposed())\n\t{\n\t\tif (!display.readAndDispatch())\n\t\t{\n\t\t\tdisplay.sleep();\n\t\t}\n\t}\n\tdisplay.dispose();\n}\n\n/**\n * Gets the progress bar.\n * @return the bar.\n */\nfinal ProgressBar getProgressBar()\n{\n\treturn progressBar;\n}\n}",
    "Hans,\ncould you please check whether the following path exists on your system:\n/System/Library/Frameworks/JavaVM.framework/Versions/A/Resources/MacOS/JavaApplicationStub\n\nDo you have the Apple Developer Tools installed?\n\nThanks.",
    "Hmm, this is really strange: I\u0027ve verified the code but I couldn\u0027t find a path through the code that could \npossibly result in launcher_path becoming null.\n\nCould you please give me the detailed steps after opening the Export wizard until you hit the \"Finish\" \nbutton. If you could make a screenshot of the wizard just before you hit \"Finished\", that would be great \ntoo.\n\nThanks a lot.",
    "Here is a link to a successfully exported \"Runner\" (based on your unmodified source code):\nhttp://www.weinand.org/eclipse/Runner.dmg\n",
    "Hans, any updates on this one?",
    "\tFrom: \t  hansm@science.uva.nl\n\tSubject: \tRe: [Bug 79637] impossible to generate java application on MacOSX\n\tDate: \tDecember 1, 2004 20:48:03 CET\n\tTo: \t  andre_weinand@ch.ibm.com\n\n\tFrom: \t  hansm@science.uva.nl\n\tSubject: \tRe: [Bug 79637] impossible to generate java application on MacOSX\n\tDate: \tDecember 1, 2004 20:42:41 CET\n\tTo: \t  bugzilla-daemon@eclipse.org\n\nI am sending this directly to your email address, replying to the bugzilla-generated message results in \nrejected mail.\n\n------- Additional Comments From andre_weinand@ch.ibm.com  2004-11-29 08:42 -------\nHans,\ncould you please check whether the following path exists on your system:\n/System/Library/Frameworks/JavaVM.framework/Versions/A/Resources/MacOS/JavaApplicationStub\n\nDo you have the Apple Developer Tools installed?\n\nThanks.\n\n\nTo this one the answer is: The path you gave above to JavaApplicationStub can be seen in the Finder.\n\nI do have Apples Development tools on my system, though not as XCode1.5 (too much of a download \nover a simple telephone line).\n\nHans van der Meer\n\n\nOn Nov 29, 2004, at 15:41, bugzilla-daemon@eclipse.org wrote:\n\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d79637\n\n------- Additional Comments From andre_weinand@ch.ibm.com  2004-11-29 09:41 -------\nHere is a link to a successfully exported \"Runner\" (based on your unmodified source code):\nhttp://www.weinand.org/eclipse/Runner.dmg\n\nI downloaded this export and can confirm that it works.\n\nI then proceeded to recreate the application from the export wizard --this time leaving no stone \nunturned so to speak-- and, mirabile dictu, something working resulted.\nExperimenting with the Runner application and another one (the AddressBook from the SWT-examples) \nbrings me to the following conclusion: \"everything has to be right, most of all the includes in the \nclasspath (the 2 swt-jars and  the \u003cbin\u003eclass-folder) plus the add-to-bundle in the second of the three \nscreens of the export wizard. As far as my experiments have gone, I guess that is the crucial step. Do \nsomething wrong there, and the bundle error appears because -I suspect- the wizard does not forms \nthe bundle-file from which the application must be constructed.\n\nI could not establish if there is connection with the \"Run configuration\". Should there be?\n\nThen I found two strange things.\n\n(1) In the second screen of the Mac Application wizard there are two \"Add File\" end \"Add Folder\" \nbuttons for respectively the classpath and the add-to-bundle files.\nThe \"Add Folder\" button does nothing. However, when one takes the \"Add File\" button and navigates to \na file then clicks \"Open\" two things happen: the file is selected but at once a new navigation window \nopens that allows one to select a folder with the \"Choose\" button. So a folder can be selected by \nselecting a file, then a folder and then removing the file. But perhaps this strange behaviour is already \ncorrected in later versions than M3.\n\n(2) The export wizard (sometimes?) seems to remember a succesfull \"Launch configuration\". In the first \nscreen of the wizard there is a popup where they can be selected. Are these perhaps the \nJavaApplications in the \"Run configuration\"? My Runner example now seems to work and all its pertinent \ndata are already present when I select it in the popup. But when I make another application (the \nAddressBook from the SWT-examples, running it first from the IDE), its name is in the popup, but its \ndata are not, not even after generation of a working application. I have no idea why this did seem to \nwork for the one and not for the other. Quitting and restarting Eclipse made no difference. I did look for \na configuration file(in the workspace and in ~/.eclipse/..), but cannot find where these configuration \ndata are kept and therefore cannot even guess whence the difference.\n\nWell, the fact that the wizard can be made to work, must be a relief for you. But after giving main class, \ndestination name and place, the \"finish\" button becomes enabled and that gave me the wrong \nimpression that a valid application can be generated at that point. Is it a suggestion to make \nsomewhere available the (stored) bundle data that are used by macbundler.BundleBuilder.createBundle \nor create them always, i.e. even if they are seemingly incomplete?\n\nI hope you may be able to shed some light on the storage mechanism behind the \"launch \nconfiguration\", because I am of the inquisitive type and unhappy when I do not know what to expect.\nAnyway, thanks for all the work you are doing about it.\n\nHans van der Meer\n\n",
    "Please see my answers marked with \"AW\u003e\":\n\nI then proceeded to recreate the application from the export wizard  \n--this time leaving no stone unturned so to speak-- and, mirabile  \ndictu, something working resulted.\nExperimenting with the Runner application and another one (the  \nAddressBook from the SWT-examples) brings me to the following  \nconclusion: \"everything has to be right, most of all the includes in  \nthe classpath (the 2 swt-jars and  the \u003cbin\u003eclass-folder) plus the  \nadd-to-bundle in the second of the three screens of the export wizard.  \nAs far as my experiments have gone, I guess that is the crucial step.  \nDo something wrong there, and the bundle error appears because -I  \nsuspect- the wizard does not forms the bundle-file from which the  \napplication must be constructed.\n\nAW\u003e OK, I think you are running in some fundamental problem: there is *no*\nAW\u003e need to go through the second and third page of the exporter!\nAW\u003e Everything will be automatically filled in if you have created a\nAW\u003e *working launch configuration*. You can test this by opening the Run \nAW\u003e menu in the Eclipse\u0027s tool bar: there should be an entry for your\nAW\u003e application and it should launch your application. \nAW\u003e If this name is selected from the pulldown menu on the first page\nAW\u003e of the application bundle exporter, the the second page should\nAW\u003e automatically have the correct paths and dlls. If not,\nAW\u003e the you don\u0027t have a correct launch configration.\n\nI could not establish if there is connection with the \"Run  \nconfiguration\". Should there be?\n\nAW\u003e Yes, the name of the launch configuration must appear in the\nAW\u003e pulldown menu of the app bundle exporter. It is used to fill in\nAW\u003e most of the fields of the exporter automatically.\n\nThen I found two strange things.\n\n(1) In the second screen of the Mac Application wizard there are two  \n\"Add File\" end \"Add Folder\" buttons for respectively the classpath and  \nthe add-to-bundle files.\nThe \"Add Folder\" button does nothing. However, when one takes the \"Add  \nFile\" button and navigates to a file then clicks \"Open\" two things  \nhappen: the file is selected but at once a new navigation window opens  \nthat allows one to select a folder with the \"Choose\" button. So a  \nfolder can be selected by selecting a file, then a folder and then  \nremoving the file. But perhaps this strange behaviour is already  \ncorrected in later versions than M3.\n\nAW\u003e has been fixed already; see bug #79988\n\n(2) The export wizard (sometimes?) seems to remember a succesfull  \n\"Launch configuration\". In the first screen of the wizard there is a  \npopup where they can be selected. Are these perhaps the  \nJavaApplications in the \"Run configuration\"? \n\nAW\u003e Yes!\n\nMy Runner example now  \nseems to work and all its pertinent data are already present when I  \nselect it in the popup. But when I make another application (the  \nAddressBook from the SWT-examples, running it first from the IDE), its  \nname is in the popup, but its data are not, not even after generation  \nof a working application. I have no idea why this did seem to work for  \nthe one and not for the other. \n\nAW\u003e I cannot explain this. Should not happen. Works for me....\n\nQuitting and restarting Eclipse made no  \ndifference. I did look for a configuration file(in the workspace and in  \n~/.eclipse/..), but cannot find where these configuration data are kept  \nand therefore cannot even guess whence the difference.\n\nAW\u003e Normally they are stored in Eclipse\u0027s metadata. However, on the\nAW\u003e last page of the launch configuratioin wizard you specify to\nAW\u003e \"share the launch configuration\", that is you can store the\nAW\u003e launch config as a xml file in the workspace, e.g. in the associated project.\nAW\u003e This makes it possible to share the launch config via CVS and you\u0027ll\nAWY never loose the settings contained in the config (dll path etc.).\n\nWell, the fact that the wizard can be made to work, must be a relief  \nfor you. But after giving main class, destination name $\n\nAW\u003e This should be not necessary since they are automatically filled in from\nAW\u003e the launch config.\n\nand place, the  \n\nAW\u003e Yes, the place is the *only* thing that you need to specify.\n\n\"finish\" button becomes enabled and that gave me the wrong impression  \nthat a valid application can be generated at that point. \n\nAW\u003e No, that\u0027s not a wrong impression. That\u0027s exactly the right impression.\nAW\u003e All the information is containd in the launch config!\n\nIs it a  \nsuggestion to make somewhere available the (stored) bundle data that  \nare used by macbundler.BundleBuilder.createBundle or create them  \nalways, i.e. even if they are seemingly incomplete?\n\nAW\u003e Most of the data is coming from the Launch Config which is already\nAW\u003e persisted. For the additional data that can be specified in the\nAW\u003e export wizard (and which effectively overrides the data from the launch config)\nAW\u003e it is planned to persist that too.\n",
    "So here are again the steps how I create a launch config and export an application\n(try to follow them word by word; there should be no need to do anything more!)\n\n- I select the class that contains the \"main\" in the package explorer\n- I open the Run menu and select \"Run As \u003e Java Application\"\nThis fails (due to the missing dll) but creates a new launch config named\nafter the class containg the \"main\".\n- I open the Run menu again but now I select \"Run...\"\nThe newly created launch config opens.\n- I select the \"Arguments\" page and fill in the -Djava.libary.path\u003d... property \n  in the VM arguments field. Typically I copy the library path from some other\n  existing launch config.\n- pressing the \"run\" button launches the application.\n- now I selecting the class containg the main again\n- I open the export wizard and select the Mac OS X application bundle exporter.\n- the Pulldown menu automatically shows the launch config that exists for the class\n  selected in the package explorer. Typically this is the previously created launch config.\nMain class and application name should already have been filled in\n- I enter the Destination Folder\n- Press \"Finish\"\n\nIf this doesn\u0027t work, repeat and go to the second page of the export wizard\nand verify that paths and dlls are automatically filled in.\n",
    "Please reopen if problem persists (and you can provide more details)."
  ],
  "commentCreationDates": [
    "2004-11-28T15:04:17+01:00",
    "2004-11-29T13:42:22+01:00",
    "2004-11-29T14:05:26+01:00",
    "2004-11-29T14:41:52+01:00",
    "2004-11-30T10:09:18+01:00",
    "2004-12-02T19:57:17+01:00",
    "2004-12-03T09:06:09+01:00",
    "2004-12-03T09:07:09+01:00",
    "2004-12-08T15:16:33+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.io.IOException",
      "elements": [
        {
          "method": "org.eclipse.jdt.internal.ui.macbundler.BundleBuilder.createBundle",
          "source": "BundleBuilder.java:53"
        },
        {
          "method": "org.eclipse.jdt.internal.ui.macbundler.MacBundleWizard.performFinish",
          "source": "MacBundleWizard.java: 65"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.finishPressed",
          "source": "WizardDialog.java:670"
        },
        {
          "method": "org.eclipse.jface.wizard.WizardDialog.buttonPressed",
          "source": "WizardDialog.java:342"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "79637",
      "date": "2004-11-28T15:04:17+01:00",
      "product": "JDT",
      "component": "UI",
      "severity": "major"
    }
  ],
  "groupId": "79637",
  "bugId": "79637",
  "date": "2004-11-28T15:04:17+01:00",
  "product": "JDT",
  "component": "UI",
  "severity": "major"
}