{
  "comments": [
    "I20041207\n\nIn 90% (I\u0027d even say the number is higher) when I use\n  Compare With \u003e Another Branch or Version...\n  Replace With \u003e Another Branch or Version...\n\nthe first thing is that the latest tags are missing and I have to press the\nrefresh button. Please add an option to enable auto-refresh.",
    "Really 90%? In my case I\u0027ve got a couple of branches with changes and don\u0027t want\nto auto-refresh because the branch lists are stable. I guess that if you are\ncomparing/replacing against versions (e.g. integration builds) it may mean that\nyou have to refresh once a week?\n\nAre you guys tagging that often? We removed the auto-refresh in 2.0 because\npeople complained.",
    "\u003eReally 90%? \nYes really (I have 63 source shared source projects from different repositories\nwith different development cycles - how many do you have?).\n\n\u003e In my case I\u0027ve got a couple of branches with changes and don\u0027t want\n\u003eto auto-refresh because the branch lists are stable\nThat\u0027s why it says \"Option to...\" ;-)\n\n\u003eAre you guys tagging that often? \nAt least once a week but the projects don\u0027t get tagged at the same day and not\nwith the same tag pattern. Note: we also have shared source projects from other\ncomponents in our workspaces.\n\nFor me it\u0027s really a pain and in my workflow this looks like a blooper.\nSometimes I have to replace a project with the newest tag but I don\u0027t know the\ntag. There\u0027s no indication that the dialog shows all tags and hence I am force\nto hit that button - no way around it. The current behavior is OK I think if you\nhave few projects and if the projects have the same release cycle and tags and\nif you know the tags and the release/tagging cycle.\n",
    "So you would like to hit the server *everytime* we prompt for a tag? Of course\nthis would be an option.",
    "I would keep the current behavior and add a preference that would enable\nauto-refreshing. Should be easy to do. Would you accept a patch along these lines?",
    "Sorry, I didn\u0027t want to change the priority.",
    "Yes, we would accept such a patch. However, I would suggest you self host on \nit for a week or two to get a feel for the performance impact of refreshing \nevery time you open a dialog that displays tags.",
    "We (ZRH lab) switch daily to latest code and self-host on it ;-)\n",
    "Here\u0027s the first version of the patch which computes the tags in a low priority\nbackground job i.e. the dialog opens immediately and is responsive. This feature\nis off by default, however, given the fact that the implementation doesn\u0027t block\nthe user in any way and we also want to reduce preferences I suggest you work\nwith it for a while too ;-) and then decide whether the preference is really needed.\n\nNote that I copied the following constants 1:1 since I wasn\u0027t sure whether you\nuse/like shared UI messages:\n\nTagRefreshButtonArea.0 -\u003e TagSelectionDialog.2\nTagRefreshButtonArea.1 -\u003e TagSelectionDialog.3\nTagRefreshButtonArea.2 -\u003e TagSelectionDialog.4\nTagRefreshButtonArea.3 -\u003e TagSelectionDialog.5\nTagRefreshButtonArea.4 -\u003e TagSelectionDialog.6\nTagRefreshButtonArea.5 -\u003e TagSelectionDialog.7\n\nThe second part of the patch contains the help message for the preference page.\n\nThanks, for considering this patch.",
    "Created an attachment (id\u003d16540)\nPatch for org.eclipse.team.cvs.ui\n",
    "Created an attachment (id\u003d16541)\nPatch for org.eclipse.platform.doc.user\n",
    "Patch released with a few changes. I\u0027ve enabled background refresh when the\nrefresh button is pressed in addition to if the preference is enabled. ",
    "Sorry I have to reopen this bug: your modification to my patch now causes the\nfollowing NPE when cancel gets pressed before the job finishes (see below).\nRising severity since this is nasty for an S-build.\n\n!ENTRY org.eclipse.core.runtime 4 2 2004-12-15 09:34:25.126\n!MESSAGE An internal error occurred during: \"Refreshing tags\".\n!STACK 0\njava.lang.NullPointerException\n\tat\norg.eclipse.team.internal.ccvs.ui.tags.TagSelectionDialog.setBusy(TagSelectionDialog.java:301)\n\tat\norg.eclipse.team.internal.ccvs.ui.tags.TagSelectionDialog.access$2(TagSelectionDialog.java:299)\n\tat\norg.eclipse.team.internal.ccvs.ui.tags.TagSelectionDialog$4.run(TagSelectionDialog.java:279)\n\tat org.eclipse.core.internal.jobs.Worker.run(Worker.java:66)\n\n",
    "No problem... I\u0027ve found some other small things that I will fix for M4.",
    "*** Bug 81228 has been marked as a duplicate of this bug. ***",
    "Fixed in HEAD",
    "Hmm, if no tags are found in the background job, the user gets interrupted by a\npopup asking for further steps (deep search or manual configuration). That\u0027s\nintrusive, I think the job should just fail gracefully and let the user be in\ncharge of taking additional mesures.",
    "I thought about that but decided that we want this dialog: if a user checked to\nhave the tags updated and then sees no tags he might think that there are no tags.\n\nYour scenario seems academic or triggered by a test pass, isn\u0027t? ;-)\nIf you decided during real work to either Replace or Compare with a version or a\nbranch and now you have no tags it means you\u0027re now force to press the button in\nwhich then pops up that same dialog. Or do simply decide not to perform your\nwork ;-)\n\nI vote for keeping as it is now.",
    "I second Dani\u0027s suggestion. There are cases where this could happen so it\u0027s \nnot just academic, however rare it may be. I have opened a separate bug 81431 \nto track the issue. All further discussion of this will take place there.",
    "Verified that original issue of the PR is fixed."
  ],
  "commentCreationDates": [
    "2004-12-08T16:10:33+01:00",
    "2004-12-08T16:44:51+01:00",
    "2004-12-08T16:56:28+01:00",
    "2004-12-08T17:50:30+01:00",
    "2004-12-08T17:54:26+01:00",
    "2004-12-08T17:54:58+01:00",
    "2004-12-08T18:46:08+01:00",
    "2004-12-09T10:20:12+01:00",
    "2004-12-12T17:20:00+01:00",
    "2004-12-12T17:20:57+01:00",
    "2004-12-12T17:21:23+01:00",
    "2004-12-14T16:45:56+01:00",
    "2004-12-15T08:39:08+01:00",
    "2004-12-15T15:42:25+01:00",
    "2004-12-15T19:09:07+01:00",
    "2004-12-16T16:12:42+01:00",
    "2004-12-16T17:04:21+01:00",
    "2004-12-16T17:18:31+01:00",
    "2004-12-16T17:27:27+01:00",
    "2004-12-16T19:12:24+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "org.eclipse.team.internal.ccvs.ui.tags.TagSelectionDialog.setBusy",
          "source": "TagSelectionDialog.java:301"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.tags.TagSelectionDialog.access$2",
          "source": "TagSelectionDialog.java:299"
        },
        {
          "method": "org.eclipse.team.internal.ccvs.ui.tags.TagSelectionDialog$4.run",
          "source": "TagSelectionDialog.java:279"
        },
        {
          "method": "org.eclipse.core.internal.jobs.Worker.run",
          "source": "Worker.java:66"
        }
      ],
      "number": 0,
      "commentIndex": 12,
      "bugId": "80478",
      "date": "2004-12-15T08:39:08+01:00",
      "product": "Platform",
      "component": "CVS",
      "severity": "major"
    }
  ],
  "groupId": "80478",
  "bugId": "80478",
  "date": "2004-12-08T16:10:33+01:00",
  "product": "Platform",
  "component": "CVS",
  "severity": "major"
}