{
  "comments": [
    "In build N20041222-0010, there are a number of scenarios which do not have \nresults available (i.e. n/a).  I assume this is a problem based on the \nassumption that the performance tests run the same way on Linux and Windows.",
    "Sonia, if I look at the Performance (J)Unit Results I see 0 failures and errors\nfor both Windows and Linux. Looking at the log I see two problems. The one which\nis probably causing this is the one reporting missing reference data (for all\nour suites):\n\n     [java] !ENTRY org.eclipse.test.performance 2 0 2004-12-22 08:02:15.374\n     [java] !MESSAGE no reference data named \u0027{config\u003dbachlnx,\nbuild\u003d3.0_200406251208_200412131002, jvm\u003dsun1.4.2_06}\u0027 found\n\nDo we have to generate that reference data? If so, how?\n\n\nThe other thing I see is an exception which also appears in the WinXp log:\n\n     [java] !ENTRY org.eclipse.core.runtime 4 2 2004-12-22 06:06:25.918\n     [java] !MESSAGE Problems occurred when invoking code from plug-in:\n\"org.eclipse.core.runtime\".\n     [java] !STACK 0\n     [java] java.lang.RuntimeException: The workbench should handle hostile\npulldown delegates.\n     [java] \tat\norg.eclipse.ui.tests.menus.BrokenWorkbenchWindowPulldownDelegate.getMenu(BrokenWorkbenchWindowPulldownDelegate.java:46)\n",
    "The reference data is collected by Releng every Friday given map file \nchanges.  There is a new baseline as 3.0_200406251208_200412241024 which \nshould exist for org.eclipse.jdt.text and should be apparent in builds \u003e \n20050104.\n\nAs for the second .log entry, this is due to bug 77528.",
    "This means we can close this bug?",
    "Please reopen if there\u0027s something we have to do on our side.",
    "In build N20050110-0010, I believe the \"n/a\" for the \nTextTypingInvocationCountTest#test* can be accounted for by the JUnit errors \nthat occured in this test run \n(http://download.eclipse.org/downloads/drops/N20050110-\n0010/performance/html/org.eclipse.jdt.text.tests_linux.gtk.perf.html)\n\nHowever, I cannot account for the \"n/a\" for these scenarios:\n\nperformance.OpenQuickOutlineTest#testOpenQuickOutline1()-cold   \nperformance.OpenQuickOutlineTest#testOpenQuickOutline1()-warm   \n\nI reran all the tests on the Linux test machine and could not find scenario \nresults for these (see next attachment).\n",
    "Created an attachment (id\u003d17123)\nconsole output from rerun of jdt text performance tests on Linux\n\nMissing Linux scenario results for:\nOpenQuickOutlineTest#testOpenQuickOutline1()-cold\nOpenQuickOutlineTest#testOpenQuickOutline1()-warm\n\nDo these tests run successfully for you locally?",
    "We are currently investigating the test failures in N200501150010.\n\nSonia, is the screen saver active on the performance test machine? If so, this\ncould interfere with the tests (eating keyboard and other events that are\nexpected by the test).  ",
    "Yes it is.  I am rerunning tests with the screensaver enabled/disabled to \nconfirm.",
    "I\u0027ve investigate further and there seem to be different issues here:\n\n- Missing Linux summaries even though the test results are there for some tests\n  \u003d\u003d\u003e might this be an upper/lower case typo in the scripts?\n\n- Some tests suites no longer seem to finish: PerformanceTestSuite seems not to \n  finish under Linux and WinXP and DebuggingPerformanceTest suite seems not to \n  finish under WinXP. We never noticed this failure because there\u0027s no DNF \n  indication on the JUnit results page: the suite is simply missing. The console\n  log then tells: \"xyz is not a valid XML document. It is possibly corrupted.\"\n  \u003d\u003d\u003e I\u0027ve added debugging output which will allow us to see at which test it\n      hangs\n\n- Some of the typing tests produced 0 as count which indicates that they never\n  worked correctly. Last week I\u0027ve added a temporary assert which has been \n  removed again since the failures can be found here:\nhttp://download.eclipse.org/downloads/drops/N20050116-0010/performance/html/org.eclipse.jdt.text.tests_linux.gtk.perf.html\n  \u003d\u003d\u003e we need to track down why they are 0.",
    "Another thing which confused while tracking this down was the wrong order of\ntest suites on the Unit Test Results page: they are listed alphabetically and\nnot in the order they run. The run order is important though for performance\ntests since they reuse the previous setup. I\u0027ve filed bug 82996 for that.\n",
    "Could the solution described in bug 81811 comment #9 apply here?",
    "which solution?",
    "The fix to use an event-loop, though it may be completely unrelated and not \napply to this situation.",
    "Sorry I didn\u0027t follow the link - thought it\u0027s comment 9 from this bug. We\nalready drive the event queue. Currently we investigate whether we can improve\nthis though.",
    "Fixed the assertion failures. The tests should now run.",
    "\u003eFixed the assertion failures. The tests should now run.\nThe test now passes but others now fail. Still investigating...",
    "I\u0027m moving the bug to releng since I really don\u0027t know what I can do more than\nensure that the tests which are used in the fingerprint run fine (we still have\nsome that sporadically fail but I\u0027d expect to only those being missed in the\nfingerprint).\n\nWe should really get this to work. Tell me if there\u0027s something left on my our side.",
    "Results from a conference call with Sonia, Andr? and Dani:\n- Sonia pointed out that the JDT Text tests use Dimension.ELAPSED_PROCESS for\ntheir summaries and this dimension is missing on Linux.\n\n- Andr? will look into this i.e. try to offer this under Linux as well\n- I suggested that a unit test fails if the summary is not available",
    "I don\u0027t see a way to get Dimension.ELAPSED_PROCESS on Linux.",
    "Added a workaround for emulating ELAPSED_TIME under Linux (and Mac):\nIf System property \"eclipse.startTime\" has been defined,\nELAPSED_TIME is calculated as System.currentTimeMillis() - eclipse.startTime.\n\nIn addition System.currentTimeMillis() is stored as SYSTEM_TIME.",
    "Ported changes back to 3.0.1, 3.0, and 2.1.3 branches "
  ],
  "commentCreationDates": [
    "2004-12-22T19:55:00+01:00",
    "2005-01-03T14:26:21+01:00",
    "2005-01-04T16:20:57+01:00",
    "2005-01-04T16:24:41+01:00",
    "2005-01-05T08:46:29+01:00",
    "2005-01-12T20:00:32+01:00",
    "2005-01-12T20:05:06+01:00",
    "2005-01-17T11:36:10+01:00",
    "2005-01-17T16:03:12+01:00",
    "2005-01-17T16:36:14+01:00",
    "2005-01-17T18:15:14+01:00",
    "2005-01-27T15:54:39+01:00",
    "2005-01-27T16:04:17+01:00",
    "2005-01-27T16:20:20+01:00",
    "2005-01-27T16:41:30+01:00",
    "2005-02-01T13:49:53+01:00",
    "2005-02-03T08:36:51+01:00",
    "2005-02-23T09:57:38+01:00",
    "2005-03-10T09:04:08+01:00",
    "2005-03-10T09:11:52+01:00",
    "2005-03-14T09:54:41+01:00",
    "2005-03-14T10:50:50+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.RuntimeException",
      "message": "The workbench should handle hostile pulldown delegates.      [java]",
      "elements": [
        {
          "method": "org.eclipse.ui.tests.menus.BrokenWorkbenchWindowPulldownDelegate.getMenu",
          "source": "BrokenWorkbenchWindowPulldownDelegate.java:46"
        }
      ],
      "number": 0,
      "commentIndex": 1,
      "bugId": "81816",
      "date": "2005-01-03T14:26:21+01:00",
      "product": "Platform",
      "component": "Releng",
      "severity": "normal"
    }
  ],
  "groupId": "81816",
  "bugId": "81816",
  "date": "2004-12-22T19:55:00+01:00",
  "product": "Platform",
  "component": "Releng",
  "severity": "normal"
}