{
  "comments": [
    "I20050201-0800\n\nWhen running an eclipse app, the splash screen is not displayed.\nThis is probably due to changes done in the launcher and in startup.jar, but\nthis needs to be confirmed.\n\nHow does PDE starts the splash screen?",
    "the -showsplash argument is added correctly on the command line of the launch.\nthe correct splash location is in the config.ini of the launch.\n\nMoving to runtime.",
    "Interestingly, here is an NPE I found in the log:\n\nError Feb 01, 2005 12:15:08.486 -showsplash\njava.lang.NullPointerException\nat java.lang.Runtime.exec(Runtime.java:551)\nat java.lang.Runtime.exec(Runtime.java:491)\nat java.lang.Runtime.exec(Runtime.java:457)\nat org.eclipse.core.launcher.Main.runCommand(Main.java:1337)\nat org.eclipse.core.launcher.Main.handleSplash(Main.java:1313)\nat org.eclipse.core.launcher.Main.basicRun(Main.java:254)\nat org.eclipse.core.launcher.Main.run(Main.java:817)\nat org.eclipse.core.launcher.Main.main(Main.java:801)\n\n",
    "Wassim, I\u0027m sorry but when Chrix and I did the change we forgot that PDE was\ngenerating a command line... (and don\u0027t know what we were thinking) and that it\nwould require some change at your end (that I\u0027m willing to try to do if you tell\nme where to look).\n\nBasically when targetting 3.1, the -showsplash becomes:\n-launcher \u003cpath to the exe\u003e\n-showsplash \u003cvalue\u003e\n\nFor example:\n-launcher d:/eclipse/eclipse.exe -showsplash 600\n",
    "ummm, this new argument is not going to work for any build 3.0, 3.1 or 2.1 \nprevious to this I-build.\n\nI\u0027m a reasonable man, but this is really pushing it when it comes to backward \ncompatibility. \n\nI suggest you revert to the old argument unless you have a really good reason \nfor changing it.",
    "I know that it is different and that\u0027s why I mentionned \"when targetting 3.1\".\nSo question: don\u0027t you know which version of the platform you are targetting?",
    "Before going any further one way or the other:\n\nAre there any other plugins impacted by the change? i.e. plugins that rely on \ninternal launcher flags such as the -showsplash and -exitdata? The startup.jar \nshould have been the only code to modify when changing launcher internal \nflags. \n",
    "These are startup.jar arguments and no-one is supposed to mess around with those.\nHowever PDE got a special permission since it is starting us :-)",
    "Aside from not being able to self host when having Main in the workspace, why\nPDE can\u0027t use eclipse.exe?",
    "Created an attachment (id\u003d17611)\nPatch to PDE UI\n",
    "Wassim, please find attached a patch fixing the necessary bits and pieces. Note\nthat it takes care of the backward compatibility issue.",
    "Pascal, it\u0027s not about the patch.  It\u0027s about the principle.\n\nAlthough PDE is responsible for providing backward compatibility as much as \nhumanly possible, this gratuitous breaking change certainly does not qualify.\n\nI would expect one to refrain from making such gratuitous changes expecting \nPDE to provide backward compatibility in yet one extra place.\n\nI would also expect the startup code to not choke with an NPE on an argument \nthat was valid a few days ago.  If you really needed to change the name of the \nargument, I would expect you to deprecate the old argument and tolerate it in \nyour code as well.",
    "Some thoughts:\n\n1. History of the change\nThis bug was introduced with bug 81463.\nbug 81463 changed the format of -showsplash and -exitdata internal launcher \narguments in part to support the RCP use cases brought in by Core for 3.1.\n\nThe launcher now supports the -name argument (that\u0027s a public user argument).\neclipse -name \"The Best IDE\"\nThis command starts the launcher and \"The Best IDE\" will be used as the name \nfor the error messages displayed by the launcher and the name of the window \nfor the splash screen. RCP/Core asked for the possibility to change the name \ndisplayed in these places to support launcher branding and customization.\n\nAt the moment, the splash screen is displayed using native code. This may \nchange in the future. Starting with the resolution of bug 81463, the launcher \nshowing the splash screen must be started with:\n\n * Process splashProcess \u003d Runtime.getRuntime().exec( array );\n * Where array stores String arguments in the following order:\n * 0. \u003clauncher absolute name. e.g. d:\\eclipse\\eclipse.exe\u003e\n * 1. -name\n * 2. \u003capplication name. e.g. Eclipse\u003e\n * 3. -showsplash\n * 4. \u003csplash time out in seconds e.g. 600\u003e\n * 5. \u003cabsolute path of the splash screen e.g. d:\\eclipse\\splash.bmp\u003e\n\nThe -name argument is passed to that launcher so that error messages and the \nwindow hosting the splash screen show the user name. That\u0027s the reason the \nformat was changed. The previous format -showsplash \u003cany arbitrary line of \ncommands here\u003e does not accomodate arguments with arbitrary space characters. \nIt cannot be safely converted to a list of string[] to be passed to \nRuntime.exec(String[]). As a result, the launcher now passes to startup.jar \neach argument separately: -launcher \u003cexecutable path\u003e -name \u003cuser name\u003e -\nshowSplash \u003ctimeout\u003e -exitData \u003cshared id\u003e. Startup.jar can then assemble the \nlist of arguments to invoke the splash screen or write the exit data.\n\n2. Suggested path\n- either don\u0027t show the splash screen\n- match Core changes in Main.java. Pascal can assist with this. Format of the \ninternal args of the launcher may change in the future - not for fun (SWT has \nto implement and recompile the C code on all of 8 platforms, that alone is \nenough to assure we don\u0027t do it for no good reason). They are only a contract \nbetween the same version of the launcher the corresponding startup.jar. If \nCore/PDE need more control over the evolution of the launcher internal \nimplementation, the right solution is for them to take ownership of the \nplatform-launcher project.",
    "Chrix comment captures it all. However I can\u0027t prevent my self from adding that\nany other solution we considered would have required some changes anyway.\n",
    "thanks for the clarification.  This certainly is not gratuitous.\n\nwhat do you want me to do?",
    "About the solution that Wassim and Pascal will implement - if Core/PDE could \nthink of a way to avoid having 2 places knowing about the internal launcher \nargs on the java side, this could be a good thing. But after talking with \nPascal, this did not seem simple and may just be a wish :-)",
    "are we going to address this one way or another for tomorrow\u0027s rebuild?  I \ncan\u0027t live without a splash screen.  I\u0027m willing to do whatever it takes \n(within reason) to get it back.",
    "Personally I\u0027m fine without splash screen for a week. So it is really up to you\nto judge the risk.\nIf you want to do something, I would recommand you to use the attached patch as\na base since you probably want to refactor some things.\n\nIf you need help, let me know.",
    "not just the splash screen.  every time you launch a runtime app, you get an \nNPE.  I\u0027ll put a temporary workaround.",
    "By looking at the changes, it seems Chris meant to move this back to runtime.\nCorrecting assignee. Feel free to move back to PDE/UI if that is the right thing\nto do.",
    "Wassim fixed that in I 20050202."
  ],
  "commentCreationDates": [
    "2005-02-01T15:47:56+01:00",
    "2005-02-01T17:18:25+01:00",
    "2005-02-01T17:20:12+01:00",
    "2005-02-01T17:30:43+01:00",
    "2005-02-01T17:55:49+01:00",
    "2005-02-01T18:25:37+01:00",
    "2005-02-01T18:41:11+01:00",
    "2005-02-01T18:46:37+01:00",
    "2005-02-01T18:49:41+01:00",
    "2005-02-01T20:36:00+01:00",
    "2005-02-01T20:39:37+01:00",
    "2005-02-01T20:47:47+01:00",
    "2005-02-01T21:10:19+01:00",
    "2005-02-01T21:26:46+01:00",
    "2005-02-01T21:28:35+01:00",
    "2005-02-01T21:33:43+01:00",
    "2005-02-01T22:28:31+01:00",
    "2005-02-01T22:51:57+01:00",
    "2005-02-01T22:56:59+01:00",
    "2005-02-03T21:33:13+01:00",
    "2005-02-04T13:40:40+01:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.NullPointerException",
      "elements": [
        {
          "method": "java.lang.Runtime.exec",
          "source": "Runtime.java:551"
        },
        {
          "method": "java.lang.Runtime.exec",
          "source": "Runtime.java:491"
        },
        {
          "method": "java.lang.Runtime.exec",
          "source": "Runtime.java:457"
        },
        {
          "method": "org.eclipse.core.launcher.Main.runCommand",
          "source": "Main.java:1337"
        },
        {
          "method": "org.eclipse.core.launcher.Main.handleSplash",
          "source": "Main.java:1313"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:254"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:817"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:801"
        }
      ],
      "number": 0,
      "commentIndex": 2,
      "bugId": "84142",
      "date": "2005-02-01T17:20:12+01:00",
      "product": "Platform",
      "component": "Runtime",
      "severity": "normal"
    }
  ],
  "groupId": "84142",
  "bugId": "84142",
  "date": "2005-02-01T15:47:56+01:00",
  "product": "Platform",
  "component": "Runtime",
  "severity": "normal"
}