{
  "comments": [
    "20050510\n\nWhen you open the Help Contents on Solaris a busy cursor comes up for a while\nand then nothing happens. There are no entries in the log.",
    "This is workbench browser suppport.",
    "Tod, can you go to Window \u003e Preferences \u003e General \u003e Web Browser and let me know\nwhat your current settings are? My guess would be that the internal browser is\nselected and grayed out... if this is correct, can you try switching to the\nsystem browser setting (if available) or an external browser? Once you\u0027ve done\nthis, please try opening the help again to see if that fixed the problem.",
    "This is most likely a dup of 94470, which is fixed in M7 builds. Please let me\nwhether this is the case so that we can close or fix this defect.",
    "20050510 is the M7 test candidate. Was it fixed after that?",
    "Hi Tod,\n\nSorry, it was not in I20050510. It should be in the new candidate, I20050512-1200.",
    "This is still an issue on 20050512. We are getting an out of handles exception",
    "Created an attachment (id\u003d21056)\nLog file\n",
    "Hi Tod,\n\nThe message in the log is the expected behaviour - if it can\u0027t use the internal\nbrowser, it logs the error containing the reason why it can\u0027t. This should\nprobably look a little less like an actual error message, but it is expected.\n\nWhat was the behaviour when you tried to run? Does the Web Browser preference\npage look ok now?",
    "It doesn\u0027t open anything is the behaviour the user sees. We get the busy cursor\nfor a few seconds and then nothing happens. There is no feedback as to what they\nshould do.",
    "This really shouldn\u0027t be ignored for 3.1. Having no help at all is pretty serious.",
    "Tim, shoudn\u0027t the browser support handle this more gracefully i.e. switch to \nthe system or external browser without any message?",
    "I have verified that this works if you specify the external browser - you might\nwant to give the user a message when this happens.",
    "Tod, the expected behavour should be: if the default browser is \u0027internal\u0027 AND \nyou establish that internal browser is not available, switch to system (if \navailable) or external silently (or perhaps with an information dialog with a \ncheckbox \u0027Don\u0027t show this dialog the next time\u0027).\n\nAlso note that Help has switched to use the browser support for external \nbrowsers, so it is vital that the first request is switched smoothly with no \nscary messages and such.",
    "Hi, \n\nAs of 20050512 it should automatically switch to the system or external browser\nwhen the internal one is not available, and I\u0027ve tested this on a couple\nmachines. When you go to the preference page, the internal browser should be\ngrayed out and not selected/selectable. Is this not happening on Solaris?",
    "Yes it is - but there is no way the user would ever think that a silent death\nwould require a change to a Web Browser preference page.\n\nAlso in the install case the user has no external browser defined - you should\nfall back out of the browser support when it is not available.",
    "Are you saying that there are NO external browsers in the out-of-the-box \nscenario for Solaris?\n\nThe whole point of the one-stop-shop browser support was to have at least one \nrunning browser on each platform so that components don\u0027t need to mess with \nthis problem. Rather than falling back from the browser support, we should \nmake the browser support find \u0027a\u0027 browser.\n\nNote that Help is in the same boat. Pre 3.1, it had its own browser support to \nfind a working browser on each platform to show help. In 3.1, we moved all the \naccumulated knowledge into the UI browser support and Help is now using it. \nHence, our goal is never to get in the situation to fall out it it.\n\nTo repeat: the desired solution is that the browser support detects that there \nis no internal browser, silently switch to the external browser and use it to \ndisplay the requested URL.\n\nIf none is available, it should open a message stating so and offer to open \nthe Web browser preference page to allow the user to find a browser manually.",
    "That is exactly the case. There is no external browser until I dig around and\nfind one to specify.",
    "Help was not very good at finding a browser on Solaris either, but was \ndifficult to fail completely.  It expected browsers on the path, tested which \none were availabe, and picked one from among installed.  In the wost case a \nmessage was displayed to define a browser in the preferences.\nNow if all fails, the browser support should display a message on what to do \nto get a browser working.",
    "Created an attachment (id\u003d21140)\norg.eclipse.ui.browser plugin.xml\n\nHi Tod,\n\nOk, that makes more sense now. I checked the plugin.xml, and the entries for\nfinding default browsers on Solaris did not match the OS tag from the platform.\nCan you please try replacing the current plugin.xml in org.eclipse.ui.browser\nwith the attached copy, restarting with a new workspace, and check the list of\nbrowsers? The plugin is now jarred which will make it a little harder to\nreplace the file, but if you replace it should be able to find some default\nbrowsers now.\n\nIn the meantime, I\u0027ll check to see if it isn\u0027t firing the PartInitException in\nthis case, or whether Help is eating the exception.",
    "The PartInitException does appear to get fired correctly in this case and with\nthe correct message (\"Could not open a Web browser because there are none\nconfigured. Check ...\").\n\nKonrad or Dejan - Can you check where Help is launching the browser and ensure\nthat it is displaying the PartInitException if it is received?",
    "Quick look at the code reveals help ignores PartInitException.",
    "I have released a fix to help to display message when PartInitException is \nreceived.\n\nI was only trying on Linux, PartInitException is thrown when selection is \non \"Use external web browser\" and I have no browser defined, but it is not \nthrown when \"Use default system Web browser\" is selected.\nAnd on my machine with internal web browser grayed out, the browser selected \nby default is the \"Use default system Web browser\" so there is no message to \nthe user.",
    "The \"default system browser\" option is only enabled when the SWT Program class\nis able to detect a default application for html. Found a minor bug in how it\nwas being launched, and we were ignoring if the system application still fails\nto launch the URL. Added a PartInitException in this case.\n\nChecked in and tagged all the changes. All of the known issues are now fixed.",
    "Kim is still unable to do this on RC1",
    "What is the current behaviour on Solaris? Do you still see the busy icon and\nthen nothing happens, with no error in the .log?\nCan you post the current Web browser preferences? Did it pick up any externally\ninstalled browsers, and is the \u0027system default browser\u0027 option selected?",
    "\"Default System Webbrowser\" is there and selected but when the page is opened\n(or I try to open help) I would get something similiar to the following:\n\norg.eclipse.swt.SWTError: No more handles [Unsupported platform]\nat org.eclipse.swt.SWT.error(SWT.java:2966)\nat org.eclipse.swt.browser.Browser.\u003cinit\u003e(Browser.java:119)\nat\norg.eclipse.ui.internal.browser.WebBrowserUtil.canUseInternalWebBrowser(WebBrowserUtil.java:136)\nat\norg.eclipse.ui.internal.browser.WebBrowserPreferencePage.createContents(WebBrowserPreferencePage.java:189)\nat\norg.eclipse.jface.preference.PreferencePage.createControl(PreferencePage.java:232)\nat\norg.eclipse.jface.preference.PreferenceDialog.createPageControl(PreferenceDialog.java:1376)\nat\norg.eclipse.jface.preference.PreferenceDialog$12.run(PreferenceDialog.java:1139)\nat\norg.eclipse.core.internal.runtime.InternalPlatform.run(InternalPlatform.java:1038)\nat org.eclipse.core.runtime.Platform.run(Platform.java:775)\nat org.eclipse.ui.internal.JFaceUtil$1.run(JFaceUtil.java:44)\nat org.eclipse.jface.util.SafeRunnable.run(SafeRunnable.java:148)\nat\norg.eclipse.jface.preference.PreferenceDialog.showPage(PreferenceDialog.java:1133)\nat\norg.eclipse.ui.internal.dialogs.FilteredPreferenceDialog.showPage(FilteredPreferenceDialog.java:351)\nat\norg.eclipse.jface.preference.PreferenceDialog$8.selectionChanged(PreferenceDialog.java:639)\nat org.eclipse.jface.viewers.StructuredViewer$3.run(StructuredViewer.java:763)\nat\norg.eclipse.core.internal.runtime.InternalPlatform.run(InternalPlatform.java:1038)\nat org.eclipse.core.runtime.Platform.run(Platform.java:775)\nat org.eclipse.ui.internal.JFaceUtil$1.run(JFaceUtil.java:44)\nat org.eclipse.jface.util.SafeRunnable.run(SafeRunnable.java:148)\nat\norg.eclipse.jface.viewers.StructuredViewer.firePostSelectionChanged(StructuredViewer.java:761)\nat\norg.eclipse.jface.viewers.StructuredViewer.handlePostSelect(StructuredViewer.java:1042)\nat\norg.eclipse.jface.viewers.StructuredViewer$5.widgetSelected(StructuredViewer.java:1062)\nat\norg.eclipse.jface.util.OpenStrategy.firePostSelectionEvent(OpenStrategy.java:231)\nat org.eclipse.jface.util.OpenStrategy.access$4(OpenStrategy.java:226)\nat org.eclipse.jface.util.OpenStrategy$3.run(OpenStrategy.java:392)\nat org.eclipse.swt.widgets.RunnableLock.run(RunnableLock.java:35)\nat org.eclipse.swt.widgets.Synchronizer.runAsyncMessages(Synchronizer.java:118)\nat org.eclipse.swt.widgets.Display.runAsyncMessages(Display.java:3020)\nat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2734)\nat org.eclipse.jface.window.Window.runEventLoop(Window.java:809)\nat org.eclipse.jface.window.Window.open(Window.java:787)\nat\norg.eclipse.ui.internal.OpenPreferencesAction.run(OpenPreferencesAction.java:66)\nat org.eclipse.jface.action.Action.runWithEvent(Action.java:996)\nat\norg.eclipse.jface.action.ActionContributionItem.handleWidgetSelection(ActionContributionItem.java:538)\nat\norg.eclipse.jface.action.ActionContributionItem.access$2(ActionContributionItem.java:488)\nat\norg.eclipse.jface.action.ActionContributionItem$5.handleEvent(ActionContributionItem.java:400)\nat org.eclipse.swt.widgets.EventTable.sendEvent(EventTable.java:66)\nat org.eclipse.swt.widgets.Widget.sendEvent(Widget.java:747)\nat org.eclipse.swt.widgets.Display.runDeferredEvents(Display.java:3042)\nat org.eclipse.swt.widgets.Display.readAndDispatch(Display.java:2731)\nat org.eclipse.ui.internal.Workbench.runEventLoop(Workbench.java:1694)\nat org.eclipse.ui.internal.Workbench.runUI(Workbench.java:1658)\nat org.eclipse.ui.internal.Workbench.createAndRunWorkbench(Workbench.java:366)\nat org.eclipse.ui.PlatformUI.createAndRunWorkbench(PlatformUI.java:143)\nat org.eclipse.ui.internal.ide.IDEApplication.run(IDEApplication.java:103)\nat\norg.eclipse.core.internal.runtime.PlatformActivator$1.run(PlatformActivator.java:226)\nat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:375)\nat org.eclipse.core.runtime.adaptor.EclipseStarter.run(EclipseStarter.java:162)\nat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\nat sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)\nat\nsun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)\nat java.lang.reflect.Method.invoke(Method.java:324)\nat org.eclipse.core.launcher.Main.invokeFramework(Main.java:334)\nat org.eclipse.core.launcher.Main.basicRun(Main.java:278)\nat org.eclipse.core.launcher.Main.run(Main.java:973)\nat org.eclipse.core.launcher.Main.main(Main.java:948)\n",
    "(In reply to comment #25)\n\u003e What is the current behaviour on Solaris? Do you still see the busy icon and\n\u003e then nothing happens, with no error in the .log?\n\u003e Can you post the current Web browser preferences? Did it pick up any \nexternally\n\u003e installed browsers, and is the \u0027system default browser\u0027 option selected?\n\nI am also stuck here.  My Web Browser Preferences have the internal browser \noption disabled, have the external browser selection selected, and the Default \nSystem Browser is selected.  However... when I try to instantiate a Browser \nobject on solaris, I get a No More Handles error.  I am trying to deploy an RCP \non Solaris, Windows, and Linux that uses a Browser in the default perspective.  \nThis causes my Application to die a horrible death on Solaris.  \n\nHow do I get this Browser class to find a default browser to use on all \nplatforms?? This is a major issue!  I MUST have Solaris up and working very \nsoon, and I have no idea what to do in my code.  \n\nAs a matter of fact, looking at the Browser source delivered with eclipse-SDK-\n3.1RC1-solaris-motif.zip, the first check in the constructor error because it \nthinks it should be running on Linux!!!!!!!!!!  See below:\n\npublic Browser(Composite parent, int style) { \n\tsuper(parent,style | SWT.EMBEDDED);\n\t\n\tif (!IsLinux) {\n\t\tdispose();\n\t\tSWT.error(SWT.ERROR_NO_HANDLES, null, \" [Unsupported \nplatform]\"); //$NON-NLS-1$\n\t}\n\nWhat is going on here???\n\n",
    "Scott, we are not talking about the same problem here. Browser support in the \nplatform UI is designed to allow you to open URLs on all the platforms using \neither internal or external web browser. What you are trying to do is use SWT \nBrowser WIDGET on all the platforms. This widget is NOT supported on all the \nplatforms - go read SWT FAQ on the list of supported combinations of operating \nand windowing systems. If you make a dependency of showing a browser embedded \nin the workbench (as a view or editor), your application can only run on the \nsupported systems.\n\nSWT FAQ about the Browser widget:\n\nhttp://dev.eclipse.org/viewcvs/index.cgi/%7Echeckout%7E/platform-swt-\nhome/faq.html#browserplatforms",
    "Thanks for the quick reply Dejan.  I agree, this is a different topic after \nreading the thread more closely.  This is still a big problem.  What is the \nappropriate forum to ask about rendering HTML on all platforms?  I need Solaris \nsupport.  Could I use an embedded Swing pane?  Sorry for cluttering this bug \nreport.\n-scott  ",
    "Yes, you can use the Swing pane. You need to put the Browser creation in the \ntry/catch block and catch the SWTError with the code NO_MORE_HANDLES (see SWT \nhome page for more details). In the \u0027catch \u0027block, you should create any other \nwidget that should replace the browser.",
    "(In reply to comment #26)\n\u003e \"Default System Webbrowser\" is there and selected but when the page is opened\n\u003e (or I try to open help) I would get something similiar to the following:\n\u003e org.eclipse.swt.SWTError: No more handles [Unsupported platform]\n\nKim, you didn\u0027t specify where you get this? If you got this error in the log, \nthat has been fixed. If you got it in the error dialog, that\u0027s not good and we \nwould like to know about it more.",
    "That was in the log.",
    "Kim - Were there any runtime behaviour problems, or was it just the error in the\n.log? As Dejan noted, this has already been fixed by removing the stack trace\nand making it a warning (we still want to log something so that people can\ndiagnose if the internal browser is not working). If it was just the .log error,\nthen I\u0027d like to close this bug again.",
    "Well, other than help not working, no.. no problems at all.  ;)",
    "Hi Kim - Sorry, but this bug has a fair bit of extraneous information in it and\nI\u0027m having a hard time following what is currently broken. Can you please post\nwhat the current behaviour is with a recent build and a new workspace? Also,\nwhat is listed in the external browser list on the Web Browser preference page?",
    "On I20050610-0010:\n\nIf I try to open help I get a dialog titled \"Action: Open [error]\" that has the following contents:\n\n\"TT_DESKTOP_ENOENT No such file or directory.\"\n\nThere is nothing in the error log.\n\nThere is one entry in the Web Browser pref page : \"Default system Web browser\"\n\nAfter open the pref page I get a message in the log:\n\"Internal browser is not available: no more handles [Unsupported platform]\"",
    "I see the same problem as in comment #36.  I know Solaris users are beyond hope,\nbut are they beyond help?\n",
    "Does this only happen on our box, or does this happen on all Solaris boxes?\n",
    "I don\u0027t recognize anything on the error dialog in comment #36 that could be\ncoming from the Web browser plugin. In fact, when I google the error message I\nget documentation about something called \u0027ToolTalk\u0027, which is a complete mystery\nto me.\n\nGiven that the warning message about not being able to use the internal browser\nappears after using the preference page, everything appears to be working\ncorrectly and this is the first time that it is trying to use the browser support.\n\nKonrad - Is Help doing anything before calling the Web browser that might be\ncausing this?\n\nKim/Douglas:\n  1) Can you try going straight to the preferences page first to see if that\ngives the same error, or try using the browser in a different way, e.g. double\nclicking on an html file in the workspace.\n  2) It\u0027s odd that the system default browser is the only one listed by default.\nShould it have picked up any installed browsers on your machine? If so, can you\npost the default install directories that they are in?",
    "I\u0027m not at work at the moment, so I can\u0027t answer.  However, it might be helpful to know what Solaris \nconfigurations you\u0027ve tested the browser support on...",
    "Help is performing its normal startup when first launched.  Nothing specific \nto Solaris, and the error does not ring the bell.\n\nOpening HTML file withoug going through help, as Tim asked in comment #39 \nmight give definite answer whether errror is related to help activity\n\nOne extra thought is that the message is coming from operating system or \nMozilla.  Can someone with access to the machine put an HTML file on the \ndestkop and double click it (or whatever Solaris equivalent is).  Does it \nlaunch a browser?\n\n",
    "Yes, it does open a browser.\n\nIs there a good spot to set a breakpoint?\n",
    "Well, I\u0027ve traced it down to see what is happening.  So far, I\u0027ve been able to\nfigure out that the dialog is being opened by CDE, not by Eclipse itself.  The\ndialog appears to be opened only after Eclipse returns to the event loop (not in\ndirect response to trying to open Help).  And Help is attempt to use the Program\nclass to open the URL.\n\nFrom Sun\u0027s Desktop Integration Guide (which explains how \nthe ToolTalk Document and Media Exchange Message Set works), the\nTT_DESKTOP_ENOENT error code means that:\n\n    The file that was alleged to contain the document does not exist.\n\n",
    "The Program instance carries the following information:\n    command \u003d \"Open\"\n    gnomeExpectUri \u003d false\n    iconPath \u003d \"SDthtml\"\n    name \u003d \"HTML\"\n\nThe file name is \"http://127.0.0.1:61647/help/index.jsp\".",
    "What happens if you try to go to that address manually?  Could it be that Tomcat isn\u0027t starting?",
    "I can connect to this address through an instance of Netscape that is already\nrunning.  \n\nI\u0027ve confirmed that this used to work in 3.0.2.  I\u0027ll try see what the\ndifferences might be.",
    "Previously the browser was opened directly by calling Runtime.exec(String). \nThis works.  My guess would be that the CDE \"Program\" functionality doesn\u0027t\nhandle anything but files on disk.  Judging by the user interface of the\ndesktop, this seems likely.\n\nBilly: Is this an accurate assessment?\n\nI would expect that this problem could be fixed by using a technique similar to\nwhat the MozillaBrowserAdapter did in 3.0.2.\n\n\n",
    "Could you try one other test? Create a new workspace and go directly to the Web\nBrowser preferences. There is a little bit of code that runs to determine if any\nbrowsers are installed in default locations. It could be that this is touching\nsomething that Solaris doesn\u0027t like. If so, setting a breakpoint in\nWebBrowserUtil.addFoundBrowsers() should show the problem.",
    "Program.execute() on CDE is implemented using DtActionInvoke with DtACTION_FILE\nplus the argument, so it is quite possible that it is assuming the argument is a\nfilename.",
    "(In reply to comment #48)\n\u003e Could you try one other test? Create a new workspace and go directly to the Web\n\u003e Browser preferences. There is a little bit of code that runs to determine if any\n\u003e browsers are installed in default locations. It could be that this is touching\n\u003e something that Solaris doesn\u0027t like. If so, setting a breakpoint in\n\u003e WebBrowserUtil.addFoundBrowsers() should show the problem.\n\nI set the breakpoint.  WebBrowserUtil.addFoundBrowsers finds no other browsers.\n There is only the SystemBrowserDescriptor.\n",
    "That\u0027s not much worse, comparing to 3.0.x.  Help only had a \nMozillaBrowserAdapter and it required Mozilla to be on the system path.  So \nlaunching help 3.0.1 on this machine would probably just display a message \nrefering the user to help preferences or to the .log.",
    "(In reply to comment #51)\n\u003e That\u0027s not much worse, comparing to 3.0.x.  Help only had a \n\u003e MozillaBrowserAdapter and it required Mozilla to be on the system path.  So \n\u003e launching help 3.0.1 on this machine would probably just display a message \n\u003e refering the user to help preferences or to the .log.\n\nActually, it opened just fine.  See comment #46.  The problem is that in 3.0.2\nit executes Mozilla using a full path to the executable, while in 3.1 it tries\nto execute Mozilla using the Program API provided by SWT.\n",
    "Not being able to see help on Solaris in 3.1 vs being able to do this on 3.0\nseems like it is a lot worse.\n\nI am worried that this back and forth method of debugging is not going to allow\nus to solve this in time.  \n\nMy question is:\nTim (or Dejan,Konrad), do you actually have access to a Solaris box, if not can\nyou rlogin in to one?  I think that will be the best way to get to the bottom of\nthis in time for RC3.  UI is helping but can only turn around things so fast. \nWe are checking with our Infra team as to whether you can use the one we have\nhere right now.",
    "(In reply to comment #53)\n\u003e My question is:\n\u003e Tim (or Dejan,Konrad), do you actually have access to a Solaris box, if not \ncan\n\u003e you rlogin in to one? \n\nWe don\u0027t have a Solaris box and our attempts to use remote X to debug from \nhere failed due to your firewall settings.\n",
    "What are the chances of getting one of you guys to come down here before we ship to sort this out?",
    "I succeeded loggig-in remotely to Solaris machine in Ottawa, but could get \nEclipse to work.\n\nTo make the tomorrow\u0027s nightly build useful, I suggest we try following \nchanges to the UI Browser support:\n1.  Disable System Browser adapter if Solaris, because it has issues.\n2.  Add path \"/usr/dt/bin/netscape\" to plugin.xml for netscape browser \ndefinition.",
    "Created an attachment (id\u003d23258)\nKonrad\u0027s requested change\n\nI have made the modification and released into HEAD to get the nightly build to\nwork.",
    "Could someone please try how help launches using the nightly build?\nThanks.",
    "The problem still exists in N20050616-0010.",
    "Created an attachment (id\u003d23349)\n94497_o.e.ui.browser_patch2.txt\n\nI was able to do some work on Solaris:\n\nUsing 20050615 (without changes), I see the error from system browser, but user\ncan define a new browser in the prefernce page.\n\nIn N20050616, Netscape appears in the list of external browsers, but System\nbrowser is still there.  We did not disable it enough.\tAttached patch fixes\nthis.  It properly compares OS string, and adds a check if System browser is\navailable when browsers are restore from preferences (otherwise old workspace\nwould still have the system browser visible).\n\nI tested it works.  No errors.\tNetscape launches.\n\nDejan please review/release.  Thanks.",
    "Patch looks good - released.",
    "Verified in I20050617-0010.  A 3.0 workspace launched in I20050617-0010, as does\na workspace created fresh using I20050617-0010.  A workspace created using one\nof the broken builds, however, opens an error dialog saying that there is no\nbrowser defined in the preferences.  Defining a browser in the preferences\nworks.  This is probably okay.\n",
    "Verified again on I20050617-1618, Solaris Motif.",
    "verified on 3.1 RC3 on Linux/Motif"
  ],
  "commentCreationDates": [
    "2005-05-10T21:52:10+02:00",
    "2005-05-10T21:54:39+02:00",
    "2005-05-11T14:27:18+02:00",
    "2005-05-12T16:44:17+02:00",
    "2005-05-12T17:08:21+02:00",
    "2005-05-12T18:41:01+02:00",
    "2005-05-12T19:58:59+02:00",
    "2005-05-12T19:59:34+02:00",
    "2005-05-12T22:11:17+02:00",
    "2005-05-12T22:20:28+02:00",
    "2005-05-13T18:44:46+02:00",
    "2005-05-13T18:52:49+02:00",
    "2005-05-13T19:15:29+02:00",
    "2005-05-13T19:19:20+02:00",
    "2005-05-13T19:37:44+02:00",
    "2005-05-13T20:23:36+02:00",
    "2005-05-13T20:29:06+02:00",
    "2005-05-13T20:31:21+02:00",
    "2005-05-13T21:15:46+02:00",
    "2005-05-13T21:33:28+02:00",
    "2005-05-13T22:14:47+02:00",
    "2005-05-13T22:47:28+02:00",
    "2005-05-13T23:15:21+02:00",
    "2005-05-20T00:30:16+02:00",
    "2005-05-31T20:45:07+02:00",
    "2005-05-31T20:52:58+02:00",
    "2005-05-31T21:01:40+02:00",
    "2005-06-02T22:04:05+02:00",
    "2005-06-02T22:12:01+02:00",
    "2005-06-02T22:38:48+02:00",
    "2005-06-02T22:56:23+02:00",
    "2005-06-09T19:30:28+02:00",
    "2005-06-09T19:32:27+02:00",
    "2005-06-09T21:12:02+02:00",
    "2005-06-09T21:15:01+02:00",
    "2005-06-10T03:29:13+02:00",
    "2005-06-10T17:49:23+02:00",
    "2005-06-13T20:48:36+02:00",
    "2005-06-13T20:51:40+02:00",
    "2005-06-13T21:18:15+02:00",
    "2005-06-13T21:28:41+02:00",
    "2005-06-13T22:00:42+02:00",
    "2005-06-14T17:31:48+02:00",
    "2005-06-14T18:22:57+02:00",
    "2005-06-14T18:29:11+02:00",
    "2005-06-14T18:38:16+02:00",
    "2005-06-14T18:39:21+02:00",
    "2005-06-14T19:05:10+02:00",
    "2005-06-14T21:49:10+02:00",
    "2005-06-14T22:03:59+02:00",
    "2005-06-15T16:39:34+02:00",
    "2005-06-15T17:23:58+02:00",
    "2005-06-15T17:42:39+02:00",
    "2005-06-15T18:12:06+02:00",
    "2005-06-15T18:23:09+02:00",
    "2005-06-15T18:27:06+02:00",
    "2005-06-16T00:19:01+02:00",
    "2005-06-16T00:48:22+02:00",
    "2005-06-16T16:40:41+02:00",
    "2005-06-16T17:04:14+02:00",
    "2005-06-16T19:42:16+02:00",
    "2005-06-16T19:45:17+02:00",
    "2005-06-17T19:48:56+02:00",
    "2005-06-20T19:17:27+02:00",
    "2005-06-20T19:24:53+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.swt.SWTError",
      "message": "No more handles [Unsupported platform]",
      "elements": [
        {
          "method": "org.eclipse.swt.SWT.error",
          "source": "SWT.java:2966"
        },
        {
          "method": "org.eclipse.swt.browser.Browser.\u003cinit\u003e",
          "source": "Browser.java:119"
        },
        {
          "method": "org.eclipse.ui.internal.browser.WebBrowserUtil.canUseInternalWebBrowser",
          "source": "WebBrowserUtil.java:136"
        },
        {
          "method": "org.eclipse.ui.internal.browser.WebBrowserPreferencePage.createContents",
          "source": "WebBrowserPreferencePage.java:189"
        },
        {
          "method": "org.eclipse.jface.preference.PreferencePage.createControl",
          "source": "PreferencePage.java:232"
        },
        {
          "method": "org.eclipse.jface.preference.PreferenceDialog.createPageControl",
          "source": "PreferenceDialog.java:1376"
        },
        {
          "method": "org.eclipse.jface.preference.PreferenceDialog$12.run",
          "source": "PreferenceDialog.java:1139"
        },
        {
          "method": "org.eclipse.core.internal.runtime.InternalPlatform.run",
          "source": "InternalPlatform.java:1038"
        },
        {
          "method": "org.eclipse.core.runtime.Platform.run",
          "source": "Platform.java:775"
        },
        {
          "method": "org.eclipse.ui.internal.JFaceUtil$1.run",
          "source": "JFaceUtil.java:44"
        },
        {
          "method": "org.eclipse.jface.util.SafeRunnable.run",
          "source": "SafeRunnable.java:148"
        },
        {
          "method": "org.eclipse.jface.preference.PreferenceDialog.showPage",
          "source": "PreferenceDialog.java:1133"
        },
        {
          "method": "org.eclipse.ui.internal.dialogs.FilteredPreferenceDialog.showPage",
          "source": "FilteredPreferenceDialog.java:351"
        },
        {
          "method": "org.eclipse.jface.preference.PreferenceDialog$8.selectionChanged",
          "source": "PreferenceDialog.java:639"
        },
        {
          "method": "org.eclipse.jface.viewers.StructuredViewer$3.run",
          "source": "StructuredViewer.java:763"
        },
        {
          "method": "org.eclipse.core.internal.runtime.InternalPlatform.run",
          "source": "InternalPlatform.java:1038"
        },
        {
          "method": "org.eclipse.core.runtime.Platform.run",
          "source": "Platform.java:775"
        },
        {
          "method": "org.eclipse.ui.internal.JFaceUtil$1.run",
          "source": "JFaceUtil.java:44"
        },
        {
          "method": "org.eclipse.jface.util.SafeRunnable.run",
          "source": "SafeRunnable.java:148"
        },
        {
          "method": "org.eclipse.jface.viewers.StructuredViewer.firePostSelectionChanged",
          "source": "StructuredViewer.java:761"
        },
        {
          "method": "org.eclipse.jface.viewers.StructuredViewer.handlePostSelect",
          "source": "StructuredViewer.java:1042"
        },
        {
          "method": "org.eclipse.jface.viewers.StructuredViewer$5.widgetSelected",
          "source": "StructuredViewer.java:1062"
        },
        {
          "method": "org.eclipse.jface.util.OpenStrategy.firePostSelectionEvent",
          "source": "OpenStrategy.java:231"
        },
        {
          "method": "org.eclipse.jface.util.OpenStrategy.access$4",
          "source": "OpenStrategy.java:226"
        },
        {
          "method": "org.eclipse.jface.util.OpenStrategy$3.run",
          "source": "OpenStrategy.java:392"
        },
        {
          "method": "org.eclipse.swt.widgets.RunnableLock.run",
          "source": "RunnableLock.java:35"
        },
        {
          "method": "org.eclipse.swt.widgets.Synchronizer.runAsyncMessages",
          "source": "Synchronizer.java:118"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runAsyncMessages",
          "source": "Display.java:3020"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2734"
        },
        {
          "method": "org.eclipse.jface.window.Window.runEventLoop",
          "source": "Window.java:809"
        },
        {
          "method": "org.eclipse.jface.window.Window.open",
          "source": "Window.java:787"
        },
        {
          "method": "org.eclipse.ui.internal.OpenPreferencesAction.run",
          "source": "OpenPreferencesAction.java:66"
        },
        {
          "method": "org.eclipse.jface.action.Action.runWithEvent",
          "source": "Action.java:996"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.handleWidgetSelection",
          "source": "ActionContributionItem.java:538"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem.access$2",
          "source": "ActionContributionItem.java:488"
        },
        {
          "method": "org.eclipse.jface.action.ActionContributionItem$5.handleEvent",
          "source": "ActionContributionItem.java:400"
        },
        {
          "method": "org.eclipse.swt.widgets.EventTable.sendEvent",
          "source": "EventTable.java:66"
        },
        {
          "method": "org.eclipse.swt.widgets.Widget.sendEvent",
          "source": "Widget.java:747"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.runDeferredEvents",
          "source": "Display.java:3042"
        },
        {
          "method": "org.eclipse.swt.widgets.Display.readAndDispatch",
          "source": "Display.java:2731"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runEventLoop",
          "source": "Workbench.java:1694"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.runUI",
          "source": "Workbench.java:1658"
        },
        {
          "method": "org.eclipse.ui.internal.Workbench.createAndRunWorkbench",
          "source": "Workbench.java:366"
        },
        {
          "method": "org.eclipse.ui.PlatformUI.createAndRunWorkbench",
          "source": "PlatformUI.java:143"
        },
        {
          "method": "org.eclipse.ui.internal.ide.IDEApplication.run",
          "source": "IDEApplication.java:103"
        },
        {
          "method": "org.eclipse.core.internal.runtime.PlatformActivator$1.run",
          "source": "PlatformActivator.java:226"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:375"
        },
        {
          "method": "org.eclipse.core.runtime.adaptor.EclipseStarter.run",
          "source": "EclipseStarter.java:162"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke0",
          "source": "Native Method"
        },
        {
          "method": "sun.reflect.NativeMethodAccessorImpl.invoke",
          "source": "NativeMethodAccessorImpl.java:39"
        },
        {
          "method": "sun.reflect.DelegatingMethodAccessorImpl.invoke",
          "source": "DelegatingMethodAccessorImpl.java:25"
        },
        {
          "method": "java.lang.reflect.Method.invoke",
          "source": "Method.java:324"
        },
        {
          "method": "org.eclipse.core.launcher.Main.invokeFramework",
          "source": "Main.java:334"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:278"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:973"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:948"
        }
      ],
      "number": 0,
      "commentIndex": 26,
      "bugId": "94497",
      "date": "2005-05-31T21:01:40+02:00",
      "product": "Platform",
      "component": "UI",
      "severity": "major"
    }
  ],
  "groupId": "94497",
  "bugId": "94497",
  "date": "2005-05-10T21:52:10+02:00",
  "product": "Platform",
  "component": "UI",
  "severity": "major"
}