{
  "comments": [
    "On 3.1 M7\n\nSteps to reproduce:\n1. Create Hello World RCP example\n2. Create Feature based on Hello World plugin\n3. Create Product 1, based on Hello World Plug-in\n4. Export Product 1.  Product runs without error\n5. Create Product 2, based on Hello World Feature\n6. Product launches fine from the PDE\n7. Export Product 2.  Product fails on launch with the following error\n\n!SESSION Fri Jun 03 10:41:09 EDT 2005 ------------------------------------------\n!ENTRY org.eclipse.core.launcher 4 0 2005-06-03 10:41:09.156\n!MESSAGE Exception launching the Eclipse Platform:\n!STACK\njava.lang.RuntimeException: Could not find framework\n\tat org.eclipse.core.launcher.Main.getBootPath(Main.java:639)\n\tat org.eclipse.core.launcher.Main.basicRun(Main.java:268)\n\tat org.eclipse.core.launcher.Main.run(Main.java:977)\n\tat org.eclipse.core.launcher.Main.main(Main.java:952)",
    "I\u0027ve been testing this during the test pass and I did not see any problem.\nCould you attach the plugins and the features you are using?\n\n",
    "Created an attachment (id\u003d22332)\nHello World Feature\n\nYou should also be able to re-create this problem by following the steps in the\noriginal post.\t",
    "I was able to get the example to work, although I would consider these steps to\nbe a workaround, and a clumsy one at that.  Maybe this isn\u0027t really a bug.  If\nnot, it sure is an odd way to go about creating an RCP app from a feature.\n\nSteps to reproduce:\n1. Create Hello World RCP example\n2. Create Feature based on Hello World plugin\n3. Create Product 1, based on Hello World Plug-in\n4. Export Product 1.  Product runs without error\n5. Create Product 2, based on Hello World Feature\n(here\u0027s the new steps)\n6. Include all plug-ings and fragments listed on the product 1 configuration\npage in the list of \"plug-ins and fragment\" on the \"Plug-ins\" page of the Hello\nWorld Feature.  That is, make sure the two lists are exactly the same\n7. Create product 2 based on the Hello World feature.\n8. Export and run.  The application runs without error.\n\nThere are two problems that I see:\n1. The \"Add required plug-ins\" on the configuration page of a product based on\nplug-ins does not do the same thing as the \"Compute\" button on the dependencies\ntab of feature.xml.  \n2.  Even if the first problem were corrected (or a new button was added), you\nstill need to go through the process of moving the plug-ings from the\n\"Dependencies\" to the \"Plug-ins\" tab on feature.xml.  I realize this is somewhat\nof a special case since the feature IS the application.  I could export the\nproduct based on plugins, but then I will run into problems when I try to use\nthe update manager to install new features.\n\nI\u0027ve attached the two projects that do not export correctly.  ",
    "The attachement represents an invalid setup that can not even run in self host\nmode. When I tried to start with RC1, it indicated that you were missing osgi.\nThis is normal since what you are trying to run does not include any of the\nbasic RCP plugins (osgi, swt, jface, etc). Indeed, your hellpworldfeature only\nincludes the helloworld plugin and does not refer to any other plugin or feature.\n\nI\u0027m moving to PDE UI, to see if something can be done to help those scenarios.\n",
    "That\u0027s fine.  What didn\u0027t seem right to me was that I could create a working\nproduct based on the plug-in (using the \"add required plug-ins\" button), but I\ncould not do the same if I started with a feature based on the plug-in.  \n\nIs the process described in Comment #3 the suggested method of creating an RCP\napp based on a feature?  ",
    "I am moving to PDE/Doc to add to the 3.1 documentation an example of how to \ncreate a feature-based product.",
    "we added a product section to the PDE guide for 3.1 explaining how to create a \nplugin based and a feature based product."
  ],
  "commentCreationDates": [
    "2005-06-03T16:53:18+02:00",
    "2005-06-03T17:30:38+02:00",
    "2005-06-03T17:53:26+02:00",
    "2005-06-03T17:55:14+02:00",
    "2005-06-03T21:05:58+02:00",
    "2005-06-03T21:40:46+02:00",
    "2005-06-03T23:20:38+02:00",
    "2005-06-24T05:44:46+02:00"
  ],
  "traces": [
    {
      "exceptionType": "java.lang.RuntimeException",
      "message": "Could not find framework",
      "elements": [
        {
          "method": "org.eclipse.core.launcher.Main.getBootPath",
          "source": "Main.java:639"
        },
        {
          "method": "org.eclipse.core.launcher.Main.basicRun",
          "source": "Main.java:268"
        },
        {
          "method": "org.eclipse.core.launcher.Main.run",
          "source": "Main.java:977"
        },
        {
          "method": "org.eclipse.core.launcher.Main.main",
          "source": "Main.java:952"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "98287",
      "date": "2005-06-03T16:53:18+02:00",
      "product": "PDE",
      "component": "Doc",
      "severity": "normal"
    }
  ],
  "groupId": "98287",
  "bugId": "98287",
  "date": "2005-06-03T16:53:18+02:00",
  "product": "PDE",
  "component": "Doc",
  "severity": "normal"
}