{
  "comments": [
    "Error in azureus that seems to be a problem with swt and not azureus.  On amd 64\nrunning windows xp 32 bit \n\n org.eclipse.swt.SWTError: Cannot initialize Drop\n        at org.eclipse.swt.dnd.DND.error(DND.java:220)\n        at org.eclipse.swt.dnd.DND.error(DND.java:181)\n        at org.eclipse.swt.dnd.DropTarget.\u003cinit\u003e(DropTarget.java:139)\n        at org.gudy.azureus2.ui.swt.mainwindow.MainWindow.createDropTarget(MainW\nindow.java:925)",
    "On IRC I got the impression that this has only been seen on amd64 machines and\nnot on x86 machines (although all are running 32 bit Windows), is that correct?",
    "yes thats correct.",
    "What version of eclipse are you running?  I can give you a modified SWT plugin \nto gather more information but I need to know what version to build against.",
    "Veronica, do you still have this special swt version?\nI\u0027d be interested in resolving this issue.\n\nLooks like there is couple of somehow related bugs, that are still NEW:\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d161893\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d110166\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d98773\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d76449\nhttps://bugs.eclipse.org/bugs/show_bug.cgi?id\u003d42292",
    "Unfortunately, Veronika is no longer on the SWT team. The defect has been assigned to me but I don\u0027t have much luck trying to replicate it. May be we can resolve it if we don\u0027t hear back from the original reporter.",
    "As a developer for Azureus, I\u0027m inclined to suggest to close this bug, as at least from Azureus\u0027 perspective, this is not necessarily an error.\n\nCreating a drop target has different effects on each platform (or at least is used to, I haven\u0027t checked lately).  On some platforms, creating the droptarget on the composite will propogate it down to all it\u0027s children (meaning you can drag something onto a child and have the parent get the drop event).  Others platforms do not do this.  Some platforms don\u0027t allow creating a droptarget if any parent control already has a droptarget.\n\nAlso, in some cases, Azureus will just try to create a DropTarget, catch the error, spew it and carry on, which is why I\u0027m suggesting this may not be a SWT bug per se.\n\n",
    "I suggest we close this bug report then.  \n\nThe other issues that you mention should have been fixed quite a while ago.  If you are still seeing them, please open a bug report for each one.",
    "I agree to close. I was working with someone also having this problem, but currently have no feedback. I\u0027ll create new bug if new response will come.\nThanks for help Steve \u0026 Duong!",
    "WORKSFORME"
  ],
  "commentCreationDates": [
    "2005-06-07T20:08:59+02:00",
    "2005-06-07T22:32:26+02:00",
    "2005-06-08T13:35:32+02:00",
    "2005-06-08T14:26:32+02:00",
    "2007-06-27T18:28:53+02:00",
    "2007-06-27T20:12:17+02:00",
    "2007-07-10T19:40:54+02:00",
    "2007-07-16T19:15:16+02:00",
    "2007-07-16T21:33:03+02:00",
    "2007-07-16T21:40:08+02:00"
  ],
  "traces": [
    {
      "exceptionType": "org.eclipse.swt.SWTError",
      "message": "Cannot initialize Drop",
      "elements": [
        {
          "method": "org.eclipse.swt.dnd.DND.error",
          "source": "DND.java:220"
        },
        {
          "method": "org.eclipse.swt.dnd.DND.error",
          "source": "DND.java:181"
        },
        {
          "method": "org.eclipse.swt.dnd.DropTarget.\u003cinit\u003e",
          "source": "DropTarget.java:139"
        },
        {
          "method": "org.gudy.azureus2.ui.swt.mainwindow.MainWindow.createDropTarget",
          "source": "MainW indow.java:925"
        }
      ],
      "number": 0,
      "commentIndex": 0,
      "bugId": "98773",
      "date": "2005-06-07T20:08:59+02:00",
      "product": "Platform",
      "component": "SWT",
      "severity": "major"
    }
  ],
  "groupId": "98773",
  "bugId": "98773",
  "date": "2005-06-07T20:08:59+02:00",
  "product": "Platform",
  "component": "SWT",
  "severity": "major"
}